#include "BrandSubSection.h"

enum CAR_LABEL
{
	AUDI,                    //奥迪A0  0
	BMW,                     //宝马B5  1
	HYUNDAI,                 //现代X0  2 
	BENZ,                    //奔驰B0  3 
	HONDA,                   //本田B7  4 
	VW,                      //大众D6  5
	MAZDA,                   //马自达M4 6
	TOYOTA,                  //丰田F2   7
	BUICK,                   //别克B3   8
	CHEVROLET,               //雪弗兰X1  9
	CITERON,                 //雪铁龙X3    10 
	PEUGEOT,                 //标致BA      11
	FORD,                    //福特F3     12
	LEXUS,                   //凌志       13
	NISSAN,                  //尼桑       14
	CHERY,                   //奇瑞Q1     15
	BYD,                     //比亚迪B9   16
	KIA,                     //起亚Q2     17
	ROWE,                    //荣威R2      18
	MITSUBISHI,              //三菱S6       19
	SKODA,                   //斯柯达S5     20
	SUZUKI,                  //铃木L8       21
	CHANGHE,                 //昌河         22
	FIAT,                    //菲亚特F5    23
	VOLVO,                   //沃尔沃W0    24
	JEEP,                    //吉普J6     25
	LANDROVER,               //路虎L3     26
	GMC,                     //通用G0     27  
	RedFlags,                //红旗H5     28
	HUMMER,                  //悍马H2    29
	JINBEI,                  //金杯J2    30
	JAC,                     //江淮J3    31
	JMC,                     //江铃      32
	GEELY,                   //吉利J4    33
	LANDWIND,                //陆风L2     34
	LIFAN,                   //力帆L1     35
	MG,                      //名爵M1      上海汽车  36
	ACURA,                   //讴歌M6                37
	INFINITI,                //英菲尼迪Y0            38
	FLYWITHOUT,              //中华Z0       华晨中华  39
	ZOTYEAUTO,               //众泰Z1       众泰汽车  40
	RELY,                    //威麟W1                 41
	SUBARU,                  //斯巴鲁S1                42
	SPYKER,                  //世爵S4                  43
	SHUANGHUANAUTO,           //双环S2                  44
	SAAB,                    //萨博S0                  45
	WIESMANN,                //威兹曼W3                46
	GLEAGLE,                 //全球鹰Q0                47
	GONOW,                   //吉奥J0                  48
	HAWTAIAUTOMOBILE,         //华泰H6                   49
	SMA,                     //华普H4                  50
	HAFEI,                   //哈飞H0                  51
	SOUEAST,                 //东南D4  东南汽车        52
	EMGRANO,                 //帝豪D3                  53
	CHANA,                   //长安C0                 54
	CHANGFENAMOTOR,           //长丰C2                 55
	GREATWALL,               //长城C1                 56
	DAEWOO,                  //大宇                  57
	ISUZU,                   //五十铃                58
	DAIHATSU,                //大发D1                59
	JAGUAR,                  //捷豹J1                60
	OPEL,                    //欧宝M5               61
	//OUGE,                    //######
	CHRYSLER,                //克莱斯勒K1            62
	ALFAROMEO,               //阿尔法-罗密欧A1       63
	LINCOLN,                 //林肯L6                64
	ROLLSROYCE,              //劳斯莱斯LA            65
	FERRARI,                 //法拉利F1             66
	PORSCHE,                 //保时捷B6             67
	LOTUS,                   //莲花L4               68
	ASTONMARTIN,             //阿斯顿马丁A2         69
	CROWN,                   //皇冠                70
	BESTURN,                 //奔腾B8              71
	DONGFENG,    		      //东风D0              72
	POLARSUN,		          //中顺                73
	FOTON,                   //福田F4              74
	WULING,                  //五菱W2              75  
	CADILLAC,                //凯迪拉克K0           76    
	MASERATI,				  //玛莎拉蒂M3          77
	XIALI,                  //夏利                  78
	RENAULT,                //雷诺                  79
	IVECO,                  //依维柯                80
	BNTLY,                  //宾利                  81
	MINI,                   //迷你                  82
	SSANGYONG,              //双龙                   83
	HUIZHONG,               //汇众                   84
	YIQI,                   //一汽                  85
	KARRY,                  //开瑞                  86
	NANQI,                  //南汽                  87
	YUEJIN,			         //跃进                  88
	FAW,                    //解放                  89
	KINGLONG,               //金龙                   90
	RANGEROVER,             //罗福                   91
	ZX,                    //中兴                   92
	RIICH,                 //瑞麒                   93
	SG,                    //曙光                   94
	BEIQI,                 //北汽                   95
	HAIMA,				   //海马郑州			    	96
	CNHTC,					//中国重汽				97
	SHACMAN,				//陕汽重卡				98
	BEIBENTRUCK,			//北奔重卡				99
	YUTONG,					//宇通客车				100
	YCACO,                  //羊城汽车               101
	FUDI,                   //福迪汽车              102
	GUANGQI,                //广汽                  103
	HUADE,                 //华德                   104  
	CF,						//楚风					105
	CHUNLAN,                //春兰					106
	DAYUN,					//大运					107
	DFLZ,					//东风柳州				108
	FEICHI,					//佛山飞驰				109
	HINO,					//日野                  110
	HONGYAN,				//红岩					111
	CAMC,					//华菱					112
	GOLDENDRAGON,			//金旅					113
	CC,						//联合					114
	MAN,					//曼					    115
	YOUNGMAN,				//青年					116
	UD,						//日产					117
	SHENYE,					//神野					118
	SHITONG,				//十通					119
	SCANIA,					//斯堪尼亚				120
	WAW,					//五征					121
	XCMG,					//徐工					122
	ZHONGTONG,              //中通					123
	CDW,                    //王牌                   124	
	BAOJUN,		//宝骏 125
	LINIAN,		//理念 126
	SHUANGLONG,	//双龙 127
	QICHEN,		//启辰 128
	CHUANQI,	//传祺 129 
	DODGE,	//道奇     130
	HAVAL,	//哈佛     131
	LUXGEN,	//纳智捷   132
	SMART,	//斯玛特        133	
	MUSTANG, //野马     134
	LAMBORGHINI,   //兰博基尼  135
	PLYMOUTH,   //普利茅斯	136
	EUNOS,   	//俊郎	137
	MERCURY,	//水星	138
	SATURN, 	//土星	139
	LANCIA,  	//蓝西亚	140
	SEAT,   	//西亚特	141
	PONTIAC,    //庞蒂克	142
	OLDSMOBILE,  //奥士莫比	143
	AUSTIN, 	//奥斯汀	144
	MAYBACH,	//迈巴赫	145
	BUGATTI,	//布加迪	146
	ROVER, 	  //中国罗浮	147
	SHIDAI,   //时代	148
	YINGLUN,   //吉利英伦	149
	ROWOR,	 //瑞沃	150
	HIGER,	//海格	151
	TVR,	//英国TVR	152
	UFO,	//永源UFO	153
	OUGE,   //讴歌        //154
	LEX,//雷克萨斯 155
	NANJ,//南京 156
	SMAR,//精灵 157
	KAMA,//凯马 158
	YAXI,//亚星客车 159
	SANY,//三一 160
	NJUN,//南骏 161
	AKAI,//安凯客车 162
	MDHD,//牡丹花都 163
	SHUD,//蜀都公交 164
	TKNG,//唐骏 165
	QNGQ,//轻骑微卡 166
	HUGH,//黄海客车 167
	CHQY,//川汽野马 168
	XIKAI,//新凯 169
	SIFENG,//时风 170
	THRC,//三环 171
	BLK,//百路佳 172
	BFNO,//北方尼奥普兰 173
	SULO,//上海申通 174
	

	//**************************子类车标枚举****************************************//
	//////////////liudan****0-3000****//////////////
	//奥迪**********200-499***********//
	aud0=200,     //奥迪 A4      2004-2005款            
	aud1,     //奥迪 A4      2006-2008款            
	aud2,     //奥迪 A4L     2009-2012款            
	aud3,     //奥迪 A4L     2013款                 
	aud4,     //奥迪 A6      2004款                 
	aud5,     //奥迪 A6L     2005-2008款            
	aud6,     //奥迪 A6L     2009-2011款            
	aud7,     //奥迪 A6L     2012-2014款            
	aud8,     //奥迪 A8L     2004-2010款            
	aud9,     //奥迪 A8L     2011-2013款            
	aud10,    //奥迪 Q3      2013-2014款            
	aud11,    //奥迪 Q5      2010-2013款            
	aud12,    //奥迪 Q7      2006-2014款            
	aud13,    //奥迪 A1      2008-2014款            
	aud14,    //奥迪 A3      2004-2013款            
	aud15,    //奥迪 A5      2008-2014款            
	aud16,    //奥迪 A7      2011-2013款            
	aud17,    //奥迪 TT      2004-2013款            
	aud18,    //奥迪 R8      2007-2014款            
	aud19,    //奥迪 RS5     2011-2013款            
	aud20,    //奥迪 RS6     2002,2009款            
	aud21,    //奥迪 S5      2009-2012款            
	aud22,    //奥迪 S6      2006-2009款            
	aud23,    //奥迪 S6      2013款                 
	aud24,    //奥迪 TTS     2008,2011,2013款       
	aud25,    //奥迪 A4      2009-2012款            
	aud26,    //奥迪 A6L     未知                   
	aud27,    //奥迪 A6L     2009-2012款            
	aud28,    //奥迪 A6      2013款                 
	aud29,    //奥迪 A8L	     2010款  //*****************                
	aud30,    //奥迪 Q3      2013款                 
	aud31,    //奥迪 Q5      2009-2011款            
	aud32,    //奥迪 Q5      2012款                 
	aud33,    //奥迪 Q5      2013款                 
	aud34,    //奥迪 Q7      2006-2007款            
	aud35,    //奥迪 Q7      2010-2012款            
	aud36,    //奥迪 A7	     2011-2013款 //****************                
	aud37,    //奥迪 TT      2013款                 
	aud38,    //奥迪 A8/A8L	 2011款                
	aud39,    //奥迪  A3  	 2013款 	
	//******************20140722******************//
	aud40,    //奥迪 *** ***
	//&&&&&&&&&&&&&&
	aud41,    //奥迪 RS4  2006款       //小客
	aud42,    //奥迪 S3   2006,2009款  //小客     
	//******************20140825*****************//
	aud43,    //奥迪 A3(进口)      2010,2012款  
	aud44,    //奥迪 A4/A4(进口)   2008款/2003款
	aud45,    //奥迪 A1            2010,2012-2014款  
	aud46,    //奥迪 Q3(进口)      2012款  
	aud47,    //奥迪 A3(进口)/A5   2014款/2012-2014款
	aud48,    //奥迪 A6/A4         2004款/2004-2005款 
	aud49,    //奥迪 TT            20011-2012款 
	aud50,    //奥迪 A5            2012-2014款 
	aud51,    //奥迪 S4            2008款
	aud52,    //奥迪 A5            2008-2010款
	aud53,    //奥迪 TTS           2008款
	aud54,    //奥迪 A3(进口)      2013款
	aud55,    //奥迪 Q5/Q5(进口)   2011-2012款/2010款	
	aud56,    //奥迪 S5            2009-2010款
	aud57,    //奥迪 TT            2004款
	aud58,    //奥迪 RS6           2009款	
	aud59,    //奥迪 Q5/Q5(进口)   2012款/2010,2012款
	aud60,    //奥迪 A8            2010-2013款
	aud61,    //奥迪 A8            2005-2009款
	aud62,    //奥迪 S6            2006，2008-2009款


	//大众**********500-999***********//
	vw500=500,   //大众  宝来            2006-2007款     
	vw501,   //大众  宝来            2008-2012款     
	vw502,   //大众  CC             2013款	        
	vw503,   //大众  CC             2010-2012款     
	vw504,   //大众  高尔夫          2004，2005,2008款   
	vw505,   //大众  宝来            2004-2005款        
	vw506,   //大众  捷达            2013款             
	vw507,   //大众  捷达            2010-2012款        
	vw508,   //大众  甲壳虫          2004-2010款         
	vw509,   //大众  朗逸            2011款             
	vw510,   //大众  朗逸            2013款             
	vw511,   //大众  迈腾            2007-2011款        
	vw512,   //大众  迈腾            2012-2013款        
	vw513,   //大众  帕萨特领驭       2005-2007款        
	vw514,   //大众  帕萨特领驭       2009款             
	vw515,   //大众  帕萨特           2011-2014款        
	vw516,   //大众  途锐             2011-2014款       
	vw517,   //大众  POLO两厢         2004-2009款       
	vw518,   //大众  POLO三厢         2004-2009款       
	vw519,   //大众  桑塔纳vista      2008-2010款        
	vw520,   //大众  POLO两厢         2011-2013款       
	vw521,   //大众  速腾             2012-2014款       
	vw522,   //大众  速腾             2007-2011款       
	vw523,   //大众  普桑塔纳          2004,2007款       
	vw524,   //大众  桑塔纳2000       未知               
	vw525,   //大众  桑塔纳3000       未知               
	vw526,   //大众  桑塔纳vista       2004,2006款       
	vw527,   //大众  途安              2004-2013款      
	vw528,   //大众  夏朗              2012-2013款      
	vw529,   //大众  途观              2013款           
	vw530,   //大众  途锐              2003,2006-2010款 
	vw531,   //大众  尚酷              2009-2013款      
	vw532,   //大众  途观              2008-2012款      
	vw533,   //大众  帕萨特            2004,2005,2007款  
	vw534,   //大众  POLO三厢          2010款           
	vw535,   //大众  宝来              2013-2014款      
	vw536,   //大众  桑塔纳            2013-2014款       
	vw537,   //大众  辉腾              2004-2010款      
	vw538,   //大众  宝来             2013款            
	vw539,   //大众  宝来自动豪华型   	 2011-2012款       
	vw540,   //大众  宝来             2008款            
	vw541,   //大众  宝来时尚版        2012款            
	vw542,   //大众  高尔夫            2004-2005款       
	vw543,   //大众  高尔夫	          2010-2012款      
	vw544,   //大众  捷达 	          2006-2009款      
	vw545,   //大众  捷达 	          2010，2012款      
	vw546,   //大众  甲壳虫	          2008-2010,2012款 
	vw547,   //大众  迈腾 	          2010-2011款      
	vw548,   //大众  帕萨特	          2005款           
	vw549,   //大众  帕萨特领驭	      2007款  //***************           
	vw550,   //大众  未知              未知               
	vw551,   //大众  帕萨特	          2013款           
	vw552,   //大众  POLO 	          2004款           
	vw553,   //大众  POLO 劲取	      2009款           
	vw554,   //大众  POLO 劲情	      2006款           
	vw555,   //大众  POLO 	          2013款           
	vw556,   //大众  速腾 	          2009,2011款      
	vw557,   //大众  速腾 	          2012款           
	vw558,   //大众  桑塔纳	          2006-2007款      
	vw559,   //大众  桑塔纳 志俊        2004，2006款      
	vw560,   //大众  桑塔纳 vista       未知        //***************
	vw561,   //大众  途安 	          2006，2008款      
	vw562,   //大众  途安 	          2011,2013款      
	vw563,   //大众  途观 	          2012-2013款      
	vw564,   //大众  途锐 	          2013款           
	vw565,   //大众  桑塔纳 志俊	      2010款           
	vw566,   //大众  POLO 劲取	      2011款           
	vw567,   //大众  桑塔纳	          2013款   //****************        
	vw568,   //大众  POLO 劲取	      2009款           
	vw569,   //大众  POLO 劲取         2006款           
	vw570,   //大众  捷达 	          2005款 
	//******************20140722******************//
	vw571,   //大众  ***  ***

	//&&&&&&&&&&&&
	vw572,   //大众  高尔夫GTI    2010-2011款  //小客
	//*********************20140825********************//
	vw573,   //大众  宝来经典     2004,2005款
	vw574,   //大众  宝来         2008,2011，2012款
	vw575,   //大众  CC          2010,2011,2012款
	vw576,   //大众  高尔夫       2004,2005，2008款
	vw577,   //大众  甲壳虫       2004-2006,2008-2010款
	vw578,   //大众  朗逸/朗行    2013款/2013款          //小客/中客
	vw579,   //大众  迈腾         2007-2009，2010,2011款
	vw580,   //大众  passat领驭   2009,2011款
	vw581,   //大众  速腾/高尔夫（进口）     2006,2007,2009-2011款/2008款   //小客/中客
	vw582,   //大众  速腾         2012-2014款
	vw583,   //大众  桑塔纳经典   2004,2006,2007款
	vw584,   //大众  桑塔纳志俊   2004,2010款
	vw585,   //大众  捷达         2013款
	vw586,   //大众  桑塔纳志俊   2008款
	vw587,   //大众  宝来         2013,2014款
	vw588,   //大众  尚酷         2009-2011,2013款
	vw589,   //大众  迈腾（进口）  2012款       //中客
	vw590,   //大众  POLO Cross POLO   2007款   //中客
	vw591,   //大众  宝来经典      2006款
	vw592,   //大众  捷达          1994款
	vw593,   //大众  朗逸          2010款
	vw594,   //大众  高尔          2004款
	vw595,   //大众  途安          2004-2006款   //中客
	vw596,   //大众  POLO Cross POLO   2012,2014款  //中客
	vw597,   //大众  帕萨特       2008款
	vw598,   //大众  朗行/朗逸/途观     2014款/2014款/2010，2012款   //小客/小客/中客
	vw599,   //大众  POLO Sporty  2009款       //中客
	vw600,   //大众  朗行/朗逸   2013款/2013款   //中客/小客
	vw601,   //大众  Tiguan      2012,2014款     //中客
	vw602,   //大众  途锐   2006款   //中客
	vw603,   //大众  高尔夫/高尔夫（进口）      2010-2012款/2011，2013款/2010-2012款　　／／小客／小客／中客
	vw604,   //大众  甲壳虫        2004,2006款
	vw605,   //大众  甲壳虫        2013,2014款
	vw606,   //大众  途锐          2007-2010款  //中客
	vw607,   //大众  高尔夫（进口）     2001,2006款   //中客
	vw608,   //大众  POLO劲取       2011款     
	vw609,   //大众  途观          2013,2015款 //中客
	vw610,   //大众  迈特威/凯路威      2012,2013款/2014款    //中客
	vw611,   //大众  夏朗           2012,2013款   //中客
	vw612,   //大众  捷达       2013款  
	vw613,   //大众  高尔夫（进口）        2011，2012款/2014款  //中客/小客
	vw614,   //大众  尚酷          2011款
	vw615,   //大众  高尔夫（进口） 2011款   //中客
	vw616,   //大众  Tiguan       2009款   //中客
	vw617,   //大众  高尔夫/高尔夫（进口）     2014款/2012款   //中客
	vw618,   //大众  途锐       2011-2014款   //中客
	vw619,   //大众  迈特威     2008款   //中客


 
	//宝马**********1000-1499***********// 
	bmw1000=1000,   //宝马  m3            2010-2013款     
	bmw1001,   //宝马  5系GT         2010-2013款        
	bmw1002,   //宝马  3系           2009-2012款        
	bmw1003,   //宝马  3系           2005-2008款        
	bmw1004,   //宝马  X3            2006-2010款        
	bmw1005,   //宝马  5系           2005-2010款        
	bmw1006,   //宝马  3系           2013款             
	bmw1007,   //宝马  5系           2011-2014款        
	bmw1008,   //宝马  未知          未知                
	bmw1009,   //宝马  m3            2001款             
	bmw1010,   //宝马  7系           2004款             
	bmw1011,   //宝马  7系           2009-2013款        
	bmw1012,   //宝马  5系（进口）    2001款             
	bmw1013,   //宝马  X3 	        2011-2013款        
	bmw1014,   //宝马  5系           1994款             
	bmw1015,   //宝马  X1 	        2010-2013款        
	bmw1016,   //宝马  X5 	        2004-2013款        
	bmw1017,   //宝马  1系   	    2007-2010款        
	bmw1018,   //宝马  X6   	        2008-2013款        
	bmw1019,   //宝马  Z4	        2009-2013款        
	bmw1020,   //宝马  6系  	        2004-2007款        
	bmw1021,   //宝马  1系	        未知                
	bmw1022,   //宝马  1系	        2007款             
	bmw1023,   //宝马  1系	        2012款             
	bmw1024,   //宝马  5系	        未知              
	bmw1025,   //宝马  3系	        2010款            
	bmw1026,   //宝马  3系	        2013-2014款     
	bmw1027,   //宝马  5系	        2004款          
	bmw1028,   //宝马  5系	        2009-2010款     
	bmw1029,   //宝马  5系	        2011-2012款     
	bmw1030,   //宝马  5系	        2013款          
	bmw1031,   //宝马  7系	        2010款          
	bmw1032,   //宝马  x6	        未知            
	bmw1033,   //宝马  x5	        2010-2011，2013款   
	bmw1034,   //宝马  x1	        2011-2012款        
	bmw1035,   //宝马  x3	        2006款 2009款       
	bmw1036,   //宝马  x3	        2011-2012款        
	bmw1037,   //宝马  6系           未知    

	//**********************20140722**************//
	bmw1038,   //宝马  ***   ***

	//&&&&&&&&&&&&&
	bmw1039,   //宝马  3系	        2004款   //小客
	//**********************20140825*************//
	bmw1040,   //宝马  3系(进口)     2011款  
	bmw1041,   //宝马  5系           2008-2010款
	bmw1042,   //宝马  3系（进口）    2006,2007,2009，2011款
	bmw1043,   //宝马  Z4            2009-2010,2012，2014款
	bmw1044,   //宝马  7系           2009，2011款 
	bmw1045,   //宝马  X5            2008-2010款  //中客
	bmw1046,   //宝马  1系           2012,2013款  //中客
	bmw1047,   //宝马  3系/3系（进口）2013-2014款/2013-2014款
	bmw1048,   //宝马  7系           2013-2014款
	bmw1049,   //宝马  6系/M6        2004，2006-2007款/2006款	
	bmw1050,   //宝马  3系GT         2013款
	bmw1051,   //宝马  5系/5系（进口）2014款/2014款
	bmw1052,   //宝马  X5            2011,2013款  //中客
	bmw1053,   //宝马  X1            2013-2014款  //中客
	bmw1054,   //宝马  X5            2004,2006款	 //中客
	bmw1055,   //宝马  3系（进口）    2010-2011款
	bmw1056,   //宝马  6系           2010-2013款	
	bmw1057,  //宝马   M3           2009-2011，2013款
	bmw1058,   //宝马   Z4           2004款
	bmw1059,   //宝马   5系（进口）/M5   2006款/1995,2005，2008款
	bmw1060,   //宝马   X5           2014款         //中客
	bmw1061,   //宝马   X5           2011，2013款   //中客
	bmw1062,   //宝马   X1/X1（进口） 2012款/2012款  //中客
	bmw1063,   //宝马   1系          2010-2012款
	bmw1064,   //宝马   1系          2007，2008,2010,2011款
	bmw1065,   //宝马   3系          2005-2008款





	//本田**********1500-1999***********//
	hod1500=1500,   //本田  CRV          2007-2008款    
	hod1501,   //本田  雅阁 	       2004-2005款     
	hod1502,   //本田  雅阁	       2011-2012款     
	hod1503,   //本田  艾力绅        2012款         
	hod1504,   //本田  未知1          未知	       
	hod1505,   //本田  未知2	         未知          
	hod1506,   //本田  思域          2008-2009款    
	hod1507,   //本田  奥德赛        2009，2011款     
	hod1508,   //本田  雅阁	        2008-2010款     
	hod1509,   //本田  CRV	        2012-2013款     
	hod1510,   //本田  未知3	         未知            
	hod1511,   //本田  奥德赛        2004款           
	hod1512,   //本田  思域 	        2012-2013款     
	hod1513,   //本田  飞度	        2008款          
	hod1514,   //本田  雅阁	        2006-2007款     
	hod1515,   //本田  奥德赛         2007款          
	hod1516,   //本田  雅阁	        2014款          
	hod1517,   //本田  飞度	        2004，2007款     
	hod1518,   //本田  思铂睿         2009款          
	hod1519,   //本田  思迪	         2006-2007款    
	hod1520,   //本田  飞度	         2011款         
	hod1521,   //本田  未知4           未知           
	hod1522,   //本田  未知5	          未知           
	hod1523,   //本田  未知6	          未知           
	hod1524,   //本田  未知7	          未知           
	hod1525,   //本田  未知8	          未知           
	hod1526,   //本田  未知9	          未知          
	hod1527,   //本田  雅阁            2013款        
	hod1528,   //本田  奥德赛          2014款         
	hod1529,   //本田  杰德	          2013款        
	hod1530,   //本田  未知10           未知          
	hod1531,   //本田  CRV	          2005款        
	hod1532,   //本田  凌派	          2013款        
	hod1533,   //本田  CRV             2004款        
	hod1534,   //本田  未知11           未知         
	hod1535,   //本田  飞度（进口）	   未知         
	hod1536,   //本田  奥德赛	           2004-2005款  
	hod1537,   //本田  奥德赛      	   2007-2008款  
	hod1538,   //本田  奥德赛	           2009款       
	hod1539,   //本田  CRV	           2010款       
	hod1540,   //本田  锋范	           未知          
	hod1541,   //本田  锋范	           2008-2012款  
	hod1542,   //本田  歌诗图	           2011-2012款  
	hod1543,   //本田  思域	           未知          
	hod1544,   //本田  雅阁             1990-1991款  
	hod1545,   //本田  雅阁	           2004款       
	hod1546,   //本田  雅阁	           2005-2007款  
	hod1547,   //本田  雅阁 EXL Navi	   2010款       
	hod1548,   //本田  雅阁	           2011-2013款  
	hod1549,   //本田  雅阁	           2008-2009款  
	hod1550,   //本田  思域	           2013款       
	hod1551,   //本田  奥德赛 劲秀	   2011款  

	//********************20140722*********************//
	hod1552,   //本田  ***  ***

	//&&&&&&&&&&&&&&
	hod1553,   //本田  锋范	           2011款   //小客
	//********************20140825*********************//
	hod1554,   //本田  思域	           2009款       	     
	hod1555,   //本田  飞度	           2004款       
	hod1556,   //本田  飞度	           2011款   //中客
	hod1557,   //本田  锋范	           2011-2012,2014款 
	hod1558,   //本田  飞度	           2007款   //中客
	hod1559,   //本田  飞度/飞度（进口） 2011款/2009,2013款 //中客 
	hod1560,   //本田  思铂睿	       2013款 	
	hod1561,   //本田  思域	           2006,2008,2009款 
	hod1562,   //本田  雅阁	           2004,2006,2007款
	hod1563,   //本田  思域	           2004,2006，2007,2009款 
	hod1564,   //本田  思域	           2012款 	
	hod1565,   //本田  奥德赛	       2013-2014款  //中客
	hod1566,   //本田  奥德赛	       2015款


	//别克**********2000-2499***********//
	buik2000=2000,   //别克  凯越	                2007款    
	buik2001,   //别克  GL8陆尊	            2008款      
	buik2002,   //别克  GL8舒适版/行政版 	    2011-2014款 
	buik2003,   //别克  林荫大道 	            2007-2011款 
	buik2004,   //别克  未知1                未知	        
	buik2005,   //别克  未知2                未知        
	buik2006,   //别克  GL8豪华商务版	        2011-2014款 
	buik2007,   //别克  君威      	        2002-2005款 
	buik2008,   //别克  未知3	                未知        
	buik2009,   //别克  君威	                2009-2013款 
	buik2010,   //别克  荣御                 2004-2005款 
	buik2011,   //别克  凯越             	    2008、2011、2013款  
	buik2012,   //别克  凯越   	            2004-2005款        
	buik2013,   //别克  凯越HRV              2005、2006、2008款  
	buik2014,   //别克  君越                 2008款              
	buik2015,   //别克  君越     	            2009-2012款        
	buik2016,   //别克  皇朝	                未知                
	buik2017,   //别克  君越	                2013款             
	buik2018,   //别克  凯越 	                2007款             
	buik2019,   //别克  英朗XT	            2010-2014款        
	buik2020,   //别克  英朗GT	            2010-2013款        
	buik2021,   //别克  君越   	            2006-2007款        
	buik2022,   //别克  未知4                未知                
	buik2023,   //别克  昂科拉	            2013-2014款        
	buik2024,   //别克  昂科雷	            2009-2014款        
	buik2025,   //别克  未知4***             未知                
	buik2026,   //别克  GL8	                2004-2007款        
	buik2027,   //别克  君威	                未知                
	buik2028,   //别克  昂科雷	            2010-2013款        
	buik2029,   //别克  GL8 	                2004款             
	buik2030,   //别克  GL8   	            2007款         
	buik2031,   //别克  GL8 	                2010款         
	buik2032,   //别克  GL8 CT豪华商务版  	2011款         
	buik2033,   //别克  GL8 CT舒适版	        2011款         
	buik2034,   //别克  君威 	                2004-2005款    
	buik2035,   //别克  君威              	2010-2012款    
	buik2036,   //别克  君越             	    2006-2008款    
	buik2037,   //别克  凯越	                未知           
	buik2038,   //别克  凯越               	2008款         
	buik2039,   //别克  凯越             	    2004,2007款    
	buik2040,   //别克  凯越              	2013款         
	buik2041,   //别克  林荫大道          	2011款         
	buik2042,   //别克  赛欧	                未知           
	buik2043,   //别克  英朗              	2010款         
	buik2044,   //别克  英朗               	2010-2011款

	//********************20140722*********************//
	buik2045,   //别克  ***  ***
	//********************20140825*********************//
	buik2046,   //别克  GL8               	2011，2013,2014款
	buik2047,   //别克  英朗               	2010-2013款
	buik2048,   //别克  君威               	2014款
	buik2049,   //别克 昂克威                2014款
	

	//奔驰**********2500-2999***********//
	benz2500=2500,   //奔驰  E级     	            2011-2013款
	benz2501,   //奔驰  S级     	            2010-2012款   
	benz2502,   //奔驰  唯雅诺  	            2010-2014款   
	benz2503,   //奔驰  C级     	            2011-2013款   
	benz2504,   //奔驰  E级	                未知          
	benz2505,   //奔驰  B级     	            2009-2010款   
	benz2506,   //奔驰  B级     	            2012-2013款   
	benz2507,   //奔驰  R级     	            2006-2007款   
	benz2508,   //奔驰  CLS级   	            2007-2009款        
	benz2509,   //奔驰  E级     	            2005-2008款        
	benz2510,   //奔驰  R级  	            2010、2011、2014款  
	benz2511,   //奔驰  GLK级	            2008-2012款        
	benz2512,   //奔驰  S级                  2004款             
	benz2513,   //奔驰  S级                  未知	               
	benz2514,   //奔驰  GL级    	            2006、2008、2011款  
	benz2515,   //奔驰  CLK级	            2004-2006款        
	benz2516,   //奔驰  SLK级                2004-2009款        
	benz2517,   //奔驰  CLS级   	            2010-2013款        
	benz2518,   //奔驰  M级     	            2005-2010款        
	benz2519,   //奔驰  A级	                2004、2009、2011款  
	benz2520,   //奔驰  S级     	            2008-2009款        
	benz2521,   //奔驰  未知1	                未知               
	benz2522,   //奔驰  A级     	            2013款             
	benz2523,   //奔驰  A级	                2009-2011款        
	benz2524,   //奔驰  B级						2009款            
	benz2525,   //奔驰  C级 标准/经典/优雅，	2008,2010-2011，2013款 
	benz2526,   //奔驰  C级 时尚/运动，	    2008,2010-2011，2013款 
	benz2527,   //奔驰  CLS3XX，	            2008-2009款            
	benz2528,   //奔驰  CLS350，	            2007款                 
	benz2529,   //奔驰  E2XX/E3XX级，	        2006-2008款            
	benz2530,   //奔驰  E2XX/E3XX 时尚，	    2010-2013款    
	benz2531,   //奔驰  E2XX/E3XX 优雅，	    2010-2013款    
	benz2532,   //奔驰  E级，	                2006款         
	benz2533,   //奔驰  GL450 4MATIC尊贵，	2008款      
	benz2534,   //奔驰  GL450 4MATIC经典，	2008款      
	benz2535,   //奔驰  GLK300 豪华型，	    2012款      
	benz2536,   //奔驰  GLK300 时尚/动感，	2012-2013款 
	benz2537,   //奔驰  ML3XX，	            2012款      
	benz2538,   //奔驰  ML3XX/ML5XX，	    2008,2010款 
	benz2539,   //奔驰  ML，	                2007款      
	benz2540,   //奔驰  ML3XX/ML5XX，	    2006款      
	benz2541,   //奔驰  R3XX/R5XX，	        2009-2011款 
	benz2542,   //奔驰  R3XX/R5XX，	        2006-2007款 
	benz2543,   //奔驰  S，	                2006款      
	benz2544,   //奔驰  SL，	                2004款      
	benz2545,   //奔驰  SLK，	            2012款      
	benz2546,   //奔驰  SLK，	            2008-2009款 
	benz2547,   //奔驰  S，	                2012款      
	benz2548,   //奔驰  威霆，              	2011,2013款 
	benz2549,   //奔驰  唯雅诺/威霆，	        2010款      
	benz2550,   //奔驰  M级	                未知        
	benz2551,   //奔驰  威霆	                未知        
	benz2552,   //奔驰  E级（进口）	        未知        
	benz2553,   //奔驰  E级，          	    2007款    
	benz2554,   //奔驰  M级，	            2010款        
	benz2555,   //奔驰  唯雅诺，	            2014款    
	benz2556,   //奔驰  凌特， 	            2012款    
	benz2557,   //奔驰  R级                  未知    

	//&&&&&&&&&&&&
    benz2558,   //奔驰  未知        未知
	benz2559,   //奔驰  E260L      2014款   //小客

	//********************20140827*********************//
	benz2560,   //奔驰  A级，	            2009,2011款      //中客
	benz2561,   //奔驰  B级，	            2009款 
	benz2562,   //奔驰  C级，	            2011,2013款 
	benz2563,   //奔驰  E级（进口）/E级，	    2006款/2005款     
	benz2564,   //奔驰  GLK级，	            2013，2014款      //中客     
	benz2565,   //奔驰  M级，	            2012，2014款      //中客    
	benz2566,   //奔驰  M级，	            2010款            //中客
	benz2567,   //奔驰  M级，	            2007款            //中客
	benz2568,   //奔驰  M级，              	2005,2006，2008款 //中客
	benz2569,   //奔驰  R3XX/R5XX/C级（进口），	 2009-2011，2014款/2011款    //小客/中客   
	benz2570,   //奔驰  S，	                2004款        
	benz2571,   //奔驰  SLK/CLS级/CLS级      2011款/2013款/2012款  //小客/中客/小客       
	benz2572,   //奔驰  SLK	                2004，2009-2010款    
	benz2573,   //奔驰  S，          	    2006,2008-2010款    
	benz2574,   //奔驰  CLS级，	            2012款        
	benz2575,   //奔驰  威霆，	            2011，2013款    
	benz2576,   //奔驰  E级AMG， 	        2007款    
	benz2577,   //奔驰  C级（进口）          2004款
	benz2578,   //奔驰  E级（进口），        1988款 
	benz2579,   //奔驰  S级，              	1993款 
	benz2580,   //奔驰  E级（进口），	        2010,2011款   
	benz2581,   //奔驰  S级，	            2014款        
	benz2582,   //奔驰  唯雅诺/唯雅诺（进口） 2012-2014款/2011款  //小客/中客      
	benz2583,   //奔驰  E级	                2014-2015款    
	benz2584,   //奔驰  GL级，          	    2014款    //中客
	benz2585,   //奔驰  C级（进口）/S级，	    1993款/2008款        
	benz2586,   //奔驰  GLK级/GLK级（进口），	2012款/2008款    //中客
	benz2587,   //奔驰  C级AMG， 	        2008-2011款/2011款  //小客/中客    
	benz2588,   //奔驰  C级/C级（进口）      2011,2013款/2011款  //小客/中客
	benz2589,   //奔驰  C级/C级（进口）      2008,2010款/2007款
	benz2590,   //奔驰  G级/G级AMG，	        2004，2007款/2007款   //中客
	benz2591,   //奔驰  C级，	            2013款        
	benz2592,   //奔驰  S级                 2008，2010-2012款      
	benz2593,   //奔驰  R级	                2007款      //中客 
	benz2594,   //奔驰  GL级，          	    2011款    //中客
	benz2595,   //奔驰  唯雅诺（进口）/唯雅诺，	2010款/2011款     //中客      
	benz2596,   //奔驰  R级，	            2006款    //中客
	benz2597,   //奔驰  S级AMG， 	        2010-2011，2012款     
	benz2598,   //奔驰  C级/C级（进口）      2008,2010款/2007，2008款  //小客
	benz2599,   //奔驰  G级/G级AMG，	        2009-2011，2013款/2009-2010款   //中客
	benz2600,   //奔驰  E级(进口)，	        2012款        
	benz2601,   //奔驰  C级/C级（进口）      2010款/2010款  //小客/中客   
	benz2602,   //奔驰  GL级,				2006,2008款			//中客
	benz2603,	//奔驰  CLS级,				2008-2009款			//小客
	benz2604,	//奔驰	CLS级，				2007款

	//前黄牌添加
	benz2900=2900,  //奔驰  未知    未知   //中客
   //&&&&&&&
    benz2901,       //奔驰  未知    未知   //大客

	//现代**********3000-3499***********//
	hyd3000=3000,   //北京现代    ix35	           2010、2012款   
	hyd3001,   //现代        伊兰特         2004-2005款      
	hyd3002,   //现代        未知1	       未知　           
	hyd3003,   //现代        悦动           2008、2010款     
	hyd3004,   //现代        领翔           2009款           
	hyd3005,   //现代        名驭           2009款           
	hyd3006,   //现代        索纳塔八 	   2011、2013、2014款   
	hyd3007,   //现代        朗动           2012-2013款          
	hyd3008,   //现代        劳恩斯-酷派     2009-2010款         
	hyd3009,   //现代        索纳塔	       2004、2006、2008款   
	hyd3010,   //现代        新胜达         2006款               
	hyd3011,   //现代        瑞纳      	   2010-2014款         
	hyd3012,   //现代        伊兰特	       2011款              
	hyd3013,   //现代        途胜      	   2006、2009款         
	hyd3014,   //现代        未知2          未知	　     
	hyd3015,   //现代        美佳           2005款      
	hyd3016,   //现代        名途     	   2014款      
	hyd3017,   //现代        圣达菲	       2004款      
	hyd3018,   //现代        酷派 	       2006款      
	hyd3019,   //现代        全新胜达       2013款      
	hyd3020,   //现代        途胜     	   2013款      
	hyd3021,   //北京现代    ix35   	       2013款      
	hyd3022,   //现代        御翔           2005款      
	hyd3023,   //现代        未知3          未知	　     
	hyd3024,   //现代        雅科仕	       2009、2012款
	hyd3025,   //现代        雅尊     	   2011款      
	hyd3026,   //现代        i20	           2009款      
	hyd3027,   //现代        伊兰特	       2007款      
	hyd3028,   //现代        新胜达	       2011-2012款 
	hyd3029,   //现代        悦动     	   2011款      
	hyd3030,   //现代        雅绅特	       2006、2008款
	hyd3031,   //现代        酷派，	       2004款      
	hyd3032,   //北京现代     i30，	       2009款      
	hyd3033,   //现代        全新胜达，     2007款      
	hyd3034,   //现代        全新胜达，	   2011-2012款 
	hyd3035,   //现代        索纳塔，	   2004-2006款 
	hyd3036,   //现代        索纳塔八，	   2010-2014款 
	hyd3037,   //现代        途胜，	       2006-2009款 
	hyd3038,   //现代        维拉克斯，	   2007-2012款 
	hyd3039,   //北京现代     ix35，	       2010-2012款 
	hyd3040,   //现代        悦动，	       2008-2010款 
	hyd3041,   //现代        伊兰特，	       2007-2011款 
	hyd3042,   //现代        雅绅特，	       2006-2008款 
	hyd3043,   //现代        雅绅特，	       2011款      
	hyd3044,   //现代        雅尊，	       2006-2010款 
	hyd3045,   //现代        H-1辉翼，	   2011款     
	hyd3046,   //现代        酷派           未知  //新增************

	//********************20140722*********************//
	hyd3047,   //现代  ***  ***
	//**********************20140825*********************//
    hyd3048,   //现代        索纳塔，	   2004款  
	hyd3049,   //现代        瑞纳，	       2014款 
	hyd3050,   //现代        索纳塔八,	   2013-2014款 
	hyd3051,   //现代		 维拉克斯,	   2007,2009款
	//20150310
	hyd3052,  //现代  Santafe  未知

	//前黄牌添加
	hyd3400=3400,  //现代  未知    未知  //中客

	

       
	//福特**********3500-3999***********//
	ford3500=3500,   //福特  福克斯三厢经典	    2009-2012款       
	ford3501,   //福特  福克斯两厢经典	    2006-2012款    
	ford3502,   //福特  Windstar	        未知           
	ford3503,   //福特  福克斯三厢	    2012款         
	ford3504,   //福特  嘉年华	        2004-2006款    
	ford3505,   //福特  福克斯两厢   	    2012款         
	ford3506,   //福特  蒙迪欧-制胜	    2007-2010款    
	ford3507,   //福特  全顺	            2009、2013款   
	ford3508,   //福特  蒙迪欧	        2004-2006款    
	ford3509,   //福特  全新新时代全顺	    2013款         
	ford3510,   //福特  嘉年华两厢	    2009-2014款    
	ford3511,   //福特  嘉年华三厢	    2009、2011款   
	ford3512,   //福特  蒙迪欧        	2013款         
	ford3513,   //福特  嘉年华三厢	    2013款         
	ford3514,   //福特  麦柯斯 	        2007-2008款    
	ford3515,   //福特  翼虎         	    2013款          
	ford3516,   //福特  锐界         	    2011-2012款    
	ford3517,   //福特  翼博            	2013款         
	ford3518,   //福特  福克斯三厢	    2005-2007款    
	ford3519,   //福特  福克斯	        2005-2007款    
	ford3520,   //福特  福克斯	        2009、2011款   
	ford3521,   //福特  福克斯   	        2012款         
	ford3522,   //福特  福克斯	        2013款        
	ford3523,   //福特  嘉年华           2009-2011款    
	ford3524,   //福特  蒙迪欧	        2004款         
	ford3525,   //福特  经典全顺          2009、2013款   
	ford3526,   //福特  未知             未知           
	ford3527,   //福特  蒙迪欧	        2006款         
	ford3528,   //福特  蒙迪欧-致胜       2008、2010款   
	ford3529,   //福特  致胜             2013款         
	ford3530,   //福特  嘉年华	        2014款         
	ford3531,   //福特  新世代全顺 	    2009、2013款   
	ford3532,   //福特  福克斯 进口 	    1998款         
	ford3533,   //福特  福瑞斯	        2014款         
	ford3534,   //福特  征服者	       2012、2015款 

	//********************20140722*********************//
	ford3535,   //福特  ***  ***
	//*********************20140825*******************//	
	ford3536,   //福特  探险者					2011-2013款			//中客
	ford3537,   //福特  赛拉图					2010款   
	ford3538,	//福特  嘉年华 运动型			2009-2012款			//小客
	ford3539,	//福特  福克斯 两厢				2013款				//小客
	ford3540,	//福特  蒙迪欧-致胜 运动版		2007-2008,2010款	//小客

	//前黄牌添加
	ford3900=3900,    //福特  未知  未知     //中客

	/////////毕东旭****4000-9500****//////////////
	//起亚**********4000-4499***********//
	kia4000=4000,   //起亚 索兰托	    2009、2010、2012款      
	kia4001,   //起亚 赛拉图	    2005-2012款           
	kia4002,   //起亚 福瑞迪	    2009、2011、2012款     
	kia4003,   //起亚 智跑     	2011-2012款           
	kia4004,   //起亚 K5      	2011-2012款           
	kia4005,   //起亚 K2三厢   	2011-2012款           
	kia4006,   //起亚 狮跑     	2007-2012款           
	kia4007,   //起亚 速迈     	2010、2011、2013款 
	kia4008,   //起亚 K3	        2013款            
	kia4009,   //起亚 凯尊       2011-2012款        
	kia4010,   //起亚 千里马      2004-2006款       
	kia4011,   //起亚 欧菲莱斯 	 2007-2008款      
	kia4012,   //起亚 嘉华     	 2004、2006款      
	kia4013,   //起亚 佳乐     	 2013款           
	kia4014,   //起亚 佳乐     	 2005款           
	kia4015,   //起亚 佳乐        2007、2011款      
	kia4016,   //起亚 狮跑       	 2013款       
	kia4017,   //起亚 锐欧      	 2005-2007款  
	kia4018,   //起亚 赛拉图欧风	 2008款       
	kia4019,   //起亚 远舰     	 2005款       
	kia4020,   //起亚 智跑     	 2014款       
	kia4021,   //起亚 索兰托    	 2013款       
	kia4022,   //起亚 未知1		 未知	      
	kia4023,   //起亚 K5			 2011-2014款  
	kia4024,   //起亚 VQ			  2006款      
	kia4025,   //起亚 佳乐			2007款    
	kia4026,   //起亚 佳乐			2011款    
	kia4027,   //起亚 嘉华			2004款    
	kia4028,   //起亚 嘉华			2006款    
	kia4029,   //起亚 千里马MT		2004款    
	kia4030,   //起亚 锐欧			2007款    
	kia4031,   //起亚 赛拉图		   2005款     
	kia4032,   //起亚 赛拉图		2007、2010款  
	kia4033,   //起亚 赛拉图		2008、2012款  
	kia4034,   //起亚 狮跑			2009、2011款  
	kia4035,   //起亚 狮跑			2012-2013款   
	kia4036,   //起亚 索兰托		2010款            
	kia4037,   //起亚 索兰托		2004款            
	kia4038,   //起亚 索兰托		2009款 2012款     
	kia4039,   //起亚 秀尔			2010款        
	kia4040,   //起亚 秀尔			2012-2013款   
	kia4041,   //起亚 智跑			2011-2014款   
	kia4042,   //起亚 未知2			未知	         
	kia4043,   //起亚 Picanto		2008款        
	kia4044,   //起亚 未知3			未知	         
	kia4045,   //起亚 未知4			未知	         
	kia4046,   //起亚 未知5			未知	         
	kia4047,   //起亚 凯尊			2013款        
	kia4048,   //起亚 未知6			未知	   

	//********************20140722*********************//
	kia4049,   //起亚  ***  ***
	//&&&&&&&&&&&&&
	kia4050,   //起亚 狮跑	       2007款   //中客
	//*********************20140825*******************//	
    kia4051,   //起亚 赛拉图         2010款		//小客
	kia4052,   //起亚 福瑞迪		 2014款		//小客
	kia4053,   //起亚 K5			 2014款		//小客


	//马自达**********4500-4999***********//
	mzd4500=4500,   //马自达 马6                    2004-2013款    
	mzd4501,   //马自达 马3                         2006-2012款         
	mzd4502,   //马自达 马6（进口） Wagon基本型	    2009、2011款           
	mzd4503,   //马自达 马2    	                    2007-2012款        
	mzd4504,   //马自达 未知1                       未知                 
	mzd4505,   //马自达 马8                         2011、2013款        
	mzd4506,   //马自达 323                         1998-2003款         
	mzd4507,   //马自达 马5 	                    2011-2013款            
	mzd4508,   //马自达 马5 	                    2008、2010款           
	mzd4509,   //马自达 CX-5	                    2013-2014款            
	mzd4510,   //马自达 PREMACY	                    2000-2001款        
	mzd4511,   //马自达 CX-7                        2008、2010-2011款   
	mzd4512,   //马自达 未知2                        未知	               
	mzd4513,   //马自达 未知3                        未知	               
	mzd4514,   //马自达 未知4                        未知	               
	mzd4515,   //马自达 马3星骋	                    2011-2013款        
	mzd4516,   //马自达 马2劲翔	                    2008、2011款       
	mzd4517,   //马自达 未知0						    未知	               
	mzd4518,   //马自达 马2							2007-2009、2011款  
	mzd4519,   //马自达 马3							2007、2009款       
	mzd4520,   //马自达 马3							2010、2012款       
	mzd4521,   //马自达 马6							2004、2006-2008款  
	mzd4522,   //马自达 马6							2011-2014款        
	mzd4523,   //马自达 睿翼						2009、2010款      
	mzd4524,   //马自达 睿翼						2011、2012款      
	mzd4525,   //马自达 马3							2006款        
	mzd4526,   //马自达 马6							未知	         
	mzd4527,   //马自达 睿翼						    未知			 
	mzd4528,   //马自达 未知5						    未知          
	mzd4529,   //马自达 未知6						    未知	         
	mzd4530,   //马自达 马3昂克赛拉/马6阿特兹		    2014款        
	mzd4531,   //马自达 CX-7（进口）				    2010、2011款  
	mzd4532,   //马自达 未知7						    未知	         
	mzd4533,   //马自达 未知8						    未知    

	//********************20140722*********************//
	mzd4534,   //马自达  ***  ***

	//&&&&&&&&&&&&&&
	mzd4535,   //马自达 马3（进口两厢）	2008款   //小客
	//*********************20140825************************//
	mzd4536,   //马自达 睿翼		            2012款		//小客
	


	//日产**********5000-5499***********//
	nis5000=5000,   //日产 蓝鸟      未知	          
	nis5001,   //日产 西玛     	2004款            
	nis5002,   //日产 NV200    	2010-2014款       
	nis5003,   //日产 R50	    未知               
	nis5004,   //日产 骊威     	2007-2010款       
	nis5005,   //日产 蓝鸟	    未知               
	nis5006,   //日产 天籁     	2005-2007款       
	nis5007,   //日产 颐达     	2005-2006款       
	nis5008,   //日产 奇骏     	2008、2010、2012款 
	nis5009,   //日产 天籁     	2013-2014款       
	nis5010,   //日产 D22	    未知               
	nis5011,   //日产 D22	    未知   //nis5060       
	nis5012,   //日产 骊威      2013款        
	nis5013,   //日产 骐达      2008款        
	nis5014,   //日产 阳光      2011-2014款   
	nis5015,   //日产 轩逸      2006-2008款	
	nis5016,   //日产 天籁      2008款        
	nis5017,   //日产 逍客      2008-2013款   
	nis5018,   //日产 轩逸      2009款        
	nis5019,   //日产 骐达      2005-2006款   
	nis5020,   //日产 玛驰      2010款        
	nis5021,   //日产 骐达      2011-2013款   
	nis5022,   //日产 风度	    2004款       
	nis5023,   //日产 颐达      2008款        
	nis5024,   //日产 天籁      2011-2012款   
	nis5025,   //日产 奥丁	    2007-2013款  
	nis5026,   //日产 阳光      2004-2005款   
	nis5027,   //日产 轩逸      2012-2014款   
	nis5028,   //日产 蓝鸟     	2004款       
	nis5029,   //日产 阳光	    未知         
	nis5030,   //日产 帕拉丁      2004-2006款 
	nis5031,   //日产 D50	    2012-2014款  
	nis5032,   //日产 御轩	    未知         
	nis5033,   //日产 未知1      未知	        
	nis5034,   //日产 未知2      未知               
	nis5035,   //日产 ZN/D22 	2012款/2011、2013款
	nis5036,   //日产 骏逸		2006款             
	nis5037,   //日产 蓝鸟至尊	2004款            
	nis5038,   //日产 骊威		2007，2008款      
	nis5039,   //日产 骊威		2009款            
	nis5040,   //日产 骊威		2010款            
	nis5041,   //日产 骊威		2013款             
	nis5042,   //日产 帕拉丁	    2004、2006、2013款 
	nis5043,   //日产 奇骏		2010款             
	nis5044,   //日产 奇骏		2012款             
	nis5045,   //日产 天籁		2004、2006、2007款 
	nis5046,   //日产 逍客		     2008、2010款  
	nis5047,   //日产 逍客		     2011-2013款   
	nis5048,   //日产 阳光		     2004款        
	nis5049,   //日产 阳光		     2005款        
	nis5050,   //日产 阳光		     2011款        
	nis5051,   //日产 ZN厢式车	     2012款     
	nis5052,   //日产 蓝鸟自动旗舰型	 2004款     
	nis5053,   //日产 贵士		     2005款     
	nis5054,   //日产 贵士		     2006款     
	nis5055,   //日产 玛驰(海外)		 2011款     
	nis5056,   //日产 逍客		     未知       
	nis5057,   //日产 骏逸		     未知
	nis5058,   //日产 未知           未知       //添加的小货*************
	
	//********************20140722*********************//
	nis5059,   //日产  ***  ***

	//&&&&&&&&&&&&&&&&
	nis5060,   //日产 楼兰	 2011-2013款  //中客
	//20140820 
    //*********************20140826*******************//
	nis5061,   //日产 NP300					2013款
	nis5062,   //日产 阳光					2014款
	nis5063,   //日产 逍客（带保险杠）		2011-2013款
	nis5064,   //日产 奇骏（带保险杠）		2012款   //中客
	nis5065,   //日产 未知					未知    //中客
	nis5066,   //日产 风雅					2005-2007款
	nis5067,   //日产 风度					1998款
	nis5068,   //日产 奇骏                  2014款  //suv
	nis5069,   //日产 蓝鸟                  2004款
	nis5070,   //日产 天籁（荣耀版）        2011-2012款





	//前黄牌添加
	nis5400=5400,   //日产尼桑  未知   未知   //大货

	//标致**********5500-5999***********//
	peu5500=5500,   //标致 207			2009-2011、2013款 
	peu5501,   //标致 206			2004-2008款           
	peu5502,   //标致 408			2011-2012款           
	peu5503,   //标致 307			2004-2007款           
	peu5504,   //标致 307			2008-2013款           
	peu5505,   //标致 308			2012-2014款           
	peu5506,   //标致 408			2013-2014款           
	peu5507,   //标致 508			2011-2014款    
	peu5508,   //标致 3008			2013-2014款    
	peu5509,   //标致 308			2012款         
	peu5510,   //标致 未知1			    未知	           
	peu5511,   //标致 未知2			    未知           
	peu5512,   //标致 DS DS5 DS4进口	    2012款        //******************      
	peu5513,   //标致 207			    2009-2010款    
	peu5514,   //标致 307			2004-2006款    
	peu5515,   //标致 307			2009、2010、2012款 
	peu5516,   //标致 408			2010-2013款       
	peu5517,   //标致 3008（进口）	2011款            
	peu5518,   //标致 3008			2013款            
	peu5519,   //标致 207			未知             
	peu5520,   //标致 408			未知             
	peu5521,   //标致 207			2011、2013款

	//********************20140722*********************//
	peu5522,   //标致  ***  ***
	 //*********************20140826*******************//
	 peu5523,   //标致	标致301	        2014款			//小客
	 peu5524,   //标致	标致207（进口）	2011-2013款		//小客
	 peu5525,   //标致	标致2008	    2014款          //中客
	 peu5526,   //标致	标致307CROSS	2011-2013款		//小客



	//丰田**********6000-6499***********//
	toy6000=6000,   //丰田 rav4（5594）	 2013款      
	toy6001,   //丰田 未知1           未知	        
	toy6002,   //丰田 未知2  	         未知            
	toy6003,   //丰田 汉兰达          2011,2013款     
	toy6004,   //丰田 雅力士    	     2008,2009,2011款
	toy6005,   //丰田 未知3           未知            
	toy6006,   //丰田 rav4            2009-2012款    
	toy6007,   //丰田 逸致            2011-2014款     
	toy6008,   //丰田 普瑞维亚        2006-2007款     
	toy6009,   //丰田 未知4  	         未知            
	toy6010,   //丰田 威驰            2006款          
	toy6011,   //丰田 威驰            2008-2014款     
	toy6012,   //丰田 卡罗拉          2011-2013款     
	toy6013,   //丰田 花冠            2013款          
	toy6014,   //丰田 凯美瑞          2006-2011款     
	toy6015,   //丰田 普拉多          2010款       
	toy6016,   //丰田 未知5 	         未知         
	toy6017,   //丰田 凯美瑞进口       2005款       
	toy6018,   //丰田 凯美瑞进口       2010款       
	toy6019,   //丰田 锐志            2013款       
	toy6020,   //丰田 威驰            2014款     
	toy6021,   //丰田 卡罗拉进口       2009款     
	toy6022,   //丰田 锐志            2012款       
	toy6023,   //丰田 锐志            2007-2009款  
	toy6024,   //丰田 花冠            2007款       
	toy6025,   //丰田 凯美瑞          2012款       
	toy6026,   //丰田 花冠            2010-2011款  
	toy6027,   //丰田 皇冠            2005款       
	toy6028,   //丰田 卡罗拉          2007-2009款  
	toy6029,   //丰田 锐志            2005-2006款  
	toy6030,   //丰田 sienna          2013款      
	toy6031,   //丰田 凯美瑞          2005款       
	toy6032,   //丰田 YARiS           2007-2009款
	toy6033,   //丰田 FT-86           2013款      
	toy6034,   //丰田 汉兰达          2012款       
	toy6035,   //丰田 未知6           未知         
	toy6036,   //丰田 威驰            2004-2005款  
	toy6037,   //丰田 86进口 	        2012-2014款   
	toy6038,   //丰田 未知7  	         未知         
	toy6039,   //丰田 埃尔法          2011款       
	toy6040,   //丰田 AVALON	         未知         
	toy6041,   //丰田 未知8 	         未知         
	toy6042,   //丰田 卡罗拉	         未知        
	toy6043,   //丰田 普锐斯          2006款      
	toy6044,   //丰田 未知9 	         未知         
	toy6045,   //丰田 埃尔法          2011款       
	toy6046,   //丰田 雅力士          2008-2011款  
	toy6047,   //丰田 普拉多进口      2014款        
	toy6048,   //丰田 RAV4进口        2004款       
	toy6049,   //丰田 HIACE           2011款      
	toy6050,   //丰田 未知10          未知         
	toy6051,   //丰田 汉兰达          2012款       
	toy6052,   //丰田 普锐斯	         2013款       
	toy6053,   //丰田 普锐斯          2012款       
	toy6054,   //丰田 普瑞维亚        2004款       
	toy6055,   //丰田 凯美瑞          2012款       
	toy6056,   //丰田 锐志            2010-2012款  
	toy6057,   //丰田 锐志            2010款       
	toy6058,   //丰田 花冠            2004-2007款  
	toy6059,   //丰田 RAV4			  2010款      
	toy6060,   //丰田 RAV4			  2012-2013款 
	toy6061,   //丰田 埃尔法		    2011-2012款   
	toy6062,   //丰田 汉兰达		    2009-2011款   
	toy6063,   //丰田 汉兰达	  	    2012-2013款   
	toy6064,   //丰田 花冠			  2004款      
	toy6065,   //丰田 花冠			  2007-2009款 
	toy6066,   //丰田 凯美瑞		      2006-2008款 
	toy6067,   //丰田 凯美瑞		      2009-2012款 
	toy6068,   //丰田 凯美瑞		      2012-2013款 
	toy6069,   //丰田 兰德酷路泽   	  2007-2012款 
	toy6070,   //丰田 普拉多		      2004-2006款 
	toy6071,   //丰田 普拉多		      2010款             
	toy6072,   //丰田 普瑞维亚	 	  2006-2007、2012款  
	toy6073,   //丰田 锐志			  2010-2012款        
	toy6074,   //丰田 雅力士		      2008-2009款        
	toy6075,   //丰田 雅力士		      2011款         
	toy6076,   //丰田 威驰			  2008款         
	toy6077,   //丰田 威驰			  2004款         
	toy6078,   //丰田 威驰			  2005-2006款    
	toy6079,   //丰田 Sienna		      2011-2013款    
	toy6080,   //丰田 RAV4			  2009、2011款   
	toy6081,   //丰田 花冠			  2004款         
	toy6082,   //丰田 Verso			  2013-2014款 

	//********************20140722*********************//
	toy6083,   //丰田  ***  ***
	//&&&&&&&&&&&&&&
	toy6084,   //丰田 YARiS			  2009款   //小客
	//*********************20140826*******************//
	toy6085,   //丰田	RAV4 特享版/炫装版（带保险杠）	2012-2013		//中客
	toy6086,   //丰田	凯美瑞（海外）					2005款			//小客
	toy6087,   //丰田	未知	                        未知
	toy6088,   //丰田	凯美瑞							未知			//小客	
	toy6089,   //丰田	锐志 风度版        				2010款			//小客
	toy6090,   //丰田	Avensis							2009款			//小客
	toy6091,   //丰田	威驰							2011-2013款		//小客
	toy6092,   //丰田   普拉多							2014款			//中客
	toy6093,   //丰田   凯美瑞骏瑞						2012款			//小客
	toy6094,   //丰田   普锐斯							未知			//小客
	toy6095,   //丰田	卡罗拉（海外）					未知			//小客
	toy6096,   //丰田	普锐斯							2005-2006款		//小客
	toy6097,   //丰田	凯美瑞2.0\2.5					2012-2013款		//小客
	toy6098,   //丰田	RAV4							未知			//中客
	toy6099,   //丰田	普瑞维亚						未知			//小客
	toy6100,   //丰田	锐志（海外）基本型				2010款			//小客
	toy6101,   //丰田	锐志 风尚版						2010款			//小客
	toy6102,   //丰田	RAV4							2013款			//中客
	toy6103,   //丰田   雷凌							2014款
	toy6104,   //丰田   卡罗拉						2011-2013款
	toy6105,   //丰田   兰德酷路泽					2012款  //suv
	toy6106,   //丰田   卡罗拉						2014款

	//前黄牌添加
	toy6400=6400,   //丰田  未知    未知1   //中客
	toy6401,        //丰田  未知    未知2   //大客


	//雪佛兰**********6500-6999***********//
	che6500=6500,   //雪佛兰 景程           2005-2006款    
	che6501,   //雪佛兰 赛欧           2010-2013款     
	che6502,   //雪佛兰 景程           2005-2006款     
	che6503,   //雪佛兰 景程           2011-2012款     
	che6504,   //雪佛兰 科鲁兹         2011、2014款     
	che6505,   //雪佛兰 科鲁兹         2012款          
	che6506,   //雪佛兰 景程           2010款          
	che6507,   //雪佛兰 科帕奇         2012-2014款     
	che6508,   //雪佛兰 乐风           2006-2008款     
	che6509,   //雪佛兰 爱唯欧         2013款          
	che6510,   //雪佛兰 乐聘           2008款          
	che6511,   //雪佛兰 爱唯欧         2011款          
	che6512,   //雪佛兰 迈瑞宝         2012-2014款     
	che6513,   //雪佛兰 未知1          未知	         
	che6514,   //雪佛兰 赛欧            2005款         
	che6515,   //雪佛兰 乐聘            2005款         
	che6516,   //雪佛兰 赛欧            2005款         
	che6517,   //雪佛兰 赛欧            2004款         
	che6518,   //雪佛兰 未知2            未知          
	che6519,   //雪佛兰 未知3            未知          
	che6520,   //雪佛兰 未知4            未知	         
	che6521,   //雪佛兰 科鲁兹            2013款       
	che6522,   //雪弗兰 爱唯欧	        2011、2013款  
	che6523,   //雪弗兰 景程舒适/豪华	    2007-2012款         
	che6524,   //雪弗兰 科鲁兹	        2009、2011-2014款   
	che6525,   //雪弗兰 乐骋	            2008、2010款        
	che6526,   //雪弗兰 乐风	            2009-2010款         
	che6527,   //雪弗兰 赛欧	            2004-2005款         
	che6528,   //雪弗兰 赛欧	            2010、2011、2013款   
	che6529,   //雪弗兰 迈瑞宝	            未知            
	che6530,   //雪弗兰 景程致真版/行政版	2007-2012款         
	che6531,   //雪弗兰 科帕奇	            未知 
	
	//********************20140722*********************//
	che6532,   //雪弗兰  ***  ***
	//&&&&&&&&&&&
	che6533,   //雪佛兰 景程   2013款
   //*********************20140826*******************//
    che6534,   //雪佛兰	赛欧  	未知					//小客
	che6535,   //雪佛兰	科鲁兹	2009，2011-2013款		//小客
	che6536,   //雪佛兰	斯帕可 	2011款					//小客
	che6537,   //雪佛兰	科鲁兹 	未知					//小客
	che6538,   //雪佛兰	科迈罗	2012款					//小客



	//雪铁龙**********7000-7499***********//
	cit7000=7000,   //雪铁龙 未知1        未知	  
	cit7001,   //雪铁龙 世嘉         2010款         
	cit7002,   //雪铁龙 C5           2010-2012款   
	cit7003,   //雪铁龙 凯旋	        2006-2010款   
	cit7004,   //雪铁龙 C4L	         2013-2014款  
	cit7005,   //雪铁龙 世嘉         2011-2013款    
	cit7006,   //雪铁龙 C2	         2006-2013款  
	cit7007,   //雪铁龙 未知2        未知	          
	cit7008,   //雪铁龙 爱丽舍       2008-2013款    
	cit7009,   //雪铁龙 未知3        未知           
	cit7010,   //雪铁龙 世嘉         2014款         
	cit7011,   //雪铁龙 富康	        2004-2007款   
	cit7012,   //雪铁龙 塞纳         2004款         
	cit7013,   //雪铁龙 未知4        未知           
	cit7014,   //雪铁龙 C4			 2006、2008款  
	cit7015,   //雪铁龙 C5			 2013-2014款       
	cit7016,   //雪铁龙 爱丽舍		 2004-2005、2007款 
	cit7017,   //雪铁龙 世嘉		   2012-2013款	       
	cit7018,   //雪铁龙 毕加索		 2007款            
	cit7019,   //雪铁龙 塞纳		 2004-2005款           
	cit7020,   //雪铁龙 世嘉		 2008-2011款       
	cit7021,   //雪铁龙 塞纳		 未知	           
	cit7022,   //雪铁龙 C4Aircross	 2012-2013款
	
	//********************20140722*********************//
	cit7023,   //雪铁龙  ***  ***
	//&&&&&&&&&&&
	cit7024,   //雪铁龙 爱丽舍  2014款
	//*********************20140826*******************//
	cit7025,  //雪铁龙	富康		2005,2007款		//小客
	cit7026,  //雪铁龙	富康 		2004款			//小客
	cit7027,   //雪铁龙  毕加索	 2007款  //mpv

	//斯柯达**********7500-7999***********//
	sko7500=7500,   //斯柯达 野帝      2013-2014款  
	sko7501,   //斯柯达 昕锐      2013款           
	sko7502,   //斯柯达 晶锐      2008-2013款       
	sko7503,   //斯柯达 昊锐	  2009-2013款          
	sko7504,   //斯柯达 明锐      2010-2014款     
	sko7505,   //斯柯达 明锐      2007-2009款     
	sko7506,   //斯柯达 昊锐	  2009、2010、2012款 
	sko7507,   //斯柯达 晶锐	  2008、2009、2011款 
	sko7508,   //斯柯达 晶锐	  2012款             
	sko7509,   //斯柯达 明锐	  2010、2013款       
	sko7510,   //斯柯达 未知1     未知	        
	sko7511,   //斯柯达 野帝	  2014款             

	//********************20140722*********************//
	sko7512,   //斯柯达 ***  ***
	//*********************20140826*******************//
	sko7513,   //斯柯达	晶锐 			2014款	//小客
	sko7514,   //斯柯达	Yeti（进口）	2013款	//中客
	sko7515,   //斯柯达	晶锐 晶致版		2012款	//小客
	sko7516,   //斯柯达	明锐 RS			2010款	//小客
	sko7517,   //斯柯达	明锐 RS			未知	//小客

	//沃尔沃**********8000-8499***********//
	volo8000=8000,   //沃尔沃 S80L	2009-2014款
	volo8001,   //沃尔沃 S40     2007-2011款    
	volo8002,   //沃尔沃 C70     2008款         
	volo8003,   //沃尔沃 XC60    2009-2014款    
	volo8004,   //沃尔沃 S60     2009-2014款    
	volo8005,   //沃尔沃 XC90    2006-2013款    
	volo8006,   //沃尔沃 C30	    2006-2013款    
	volo8007,   //沃尔沃 S80     2004款         
	volo8008,   //沃尔沃 S40     2004-2006款    
	volo8009,   //沃尔沃 C30	    2006、2008、2010款   
	volo8010,   //沃尔沃 C30	    2011-2013款         
	volo8011,   //沃尔沃 C70     2004款	            
	volo8012,   //沃尔沃 C70	    2010款              
	volo8013,   //沃尔沃 S40	    2006款              
	volo8014,   //沃尔沃 S40	    2007、2008、2010款   
	volo8015,   //沃尔沃 S40	    2011、2012款         
	volo8016,   //沃尔沃 S80	    2006-2007款         
	volo8017,   //沃尔沃 S80	    2009-2012款         
	volo8018,   //沃尔沃 V60	    2011-2013款         
	volo8019,   //沃尔沃 XC90	2006、2007、2009款   
	volo8020,   //沃尔沃 XC90	2010-2013款         
	volo8021,   //沃尔沃 未知1	未知	                
	volo8022,   //沃尔沃 V40	    2013款
	volo8023,   //沃尔沃 未知   未知            //添加的小货**********


	//********************20140722*********************//
	volo8024,   //沃尔沃  ***  ***
	//*********************20140826*******************//
	volo8025,   //沃尔沃	 S80L	2014款
	volo8026,   //沃尔沃	 V40	2014款



	//前黄牌添加
	volo8400=8400,   //沃尔沃  未知  未知   //大客
    //&&&&&&&
    volo8401,        //沃尔沃  未知  未知   //大货

	//雷克萨斯**********8500-8999***********//
	lex8500=8500,   //雷克萨斯 ES240      2010、2012款   
	lex8501,   //雷克萨斯 ES	        2013款         
	lex8502,   //雷克萨斯 GS         2005-2011款    
	lex8503,   //雷克萨斯 LX         2007-2013款    
	lex8504,   //雷克萨斯 RX         2009-2011款    
	lex8505,   //雷克萨斯 CT         2011-2014款    
	lex8506,   //雷克萨斯 IS200      2004款	       
	lex8507,   //雷克萨斯 IS         2009款         
	lex8508,   //雷克萨斯 RX350	     未知          
	lex8509,   //雷克萨斯 GX460      2010款         
	lex8510,   //雷克萨斯 GS250      2012-2014款    
	lex8511,   //雷克萨斯 LS600hL    2007,2010款    
	lex8512,   //雷克萨斯 RX400h     2007款         
	lex8513,   //雷克萨斯 LS430      2004-2005款    
	lex8514,   //雷克萨斯 IS300      2006-2008款    
	lex8515,   //雷克萨斯 ES		    1993款         
	lex8516,   //雷克萨斯 ES豪华版	 2006款        
	lex8517,   //雷克萨斯 ES		    2010、2012款   
	lex8518,   //雷克萨斯 GS		 2004款            
	lex8519,   //雷克萨斯 GS		 2005款            
	lex8520,   //雷克萨斯 GS		 2008-2011款       
	lex8521,   //雷克萨斯 GX		 2010、2012款      
	lex8522,   //雷克萨斯 IS		 2009-2010款       
	lex8523,   //雷克萨斯 LS		 2004-2005款       
	lex8524,   //雷克萨斯 LS		 2006、2007款      
	lex8525,   //雷克萨斯 LX		 2004款            
	lex8526,   //雷克萨斯 LX		 2005款            
	lex8527,   //雷克萨斯 LX		 2007、2009款      
	lex8528,   //雷克萨斯 LX		 2012-2013款       
	lex8529,   //雷克萨斯 RX		 2004款          
	lex8530,   //雷克萨斯 RX		 2007款          
	lex8531,   //雷克萨斯 RX		 2009-2011款     
	lex8532,   //雷克萨斯 RX		 2012-2013款     
	lex8533,   //雷克萨斯 IS		 2004款          
	lex8534,   //雷克萨斯 LS		 1993款          
	lex8535,   //雷克萨斯 LS		 未知
	
	//**********20140722***********//
	lex8536,   //雷克萨斯 ***		 ***
	//&&&&&&&&&&&
	lex8537,   //雷克萨斯 未知  未知
	lex8538,   //雷克萨斯 GS   2004-2005,2008-2009款
	//*****************************20140827******************************//
	lex8539,   //雷克萨斯 CT F-Sport		 2012款          
	lex8540,   //雷克萨斯 IS		 2009-2010款          
	lex8541,   //雷克萨斯 LS600hL	2010款     
	lex8542,   //雷克萨斯 IS		 2006,2008款     
	lex8543,   //雷克萨斯 CT 200h		 2014款          
	lex8544,   //雷克萨斯 LS 430		 2004-2005款          
	lex8545,   //雷克萨斯 RX		 未知             //中客



	//雷诺**********9000-9499***********//
	ren9000=9000,   //雷诺 科雷傲	    2009-2014款 
	ren9001,   //雷诺 风朗       2011、2013款    
	ren9002,   //雷诺 梅甘娜     2006款          
	ren9003,   //雷诺 维度		2013款          
	ren9004,   //雷诺 风景		未知	            
	ren9005,   //雷诺 风景		2004款          
	ren9006,   //雷诺 风景		2011-2012款     
	ren9007,   //雷诺 科雷傲	    2009-2010款     
	ren9008,   //雷诺 科雷傲	    2012-2013款     
	ren9009,   //雷诺 维度		2011款          
	ren9010,   //雷诺 未知1		未知            
	ren9011,   //雷诺 科雷傲	    2014款          
	ren9012,   //雷诺 风朗		2013款  

	//**********20140722***********//
	ren9013,   //雷诺  ***  ***
	//***************20140827*****************//
	ren9014,   //雷诺 拉古那		2011款            
	ren9015,   //雷诺 风朗		2011款          

	//前黄牌添加
	ren9400=9400,   //雷诺  未知    未知  //大货

	//三菱**********9500-9999***********//
	mit9500=9500,   //三菱 伊柯丽斯		2008-2009款    
	mit9501,   //三菱 翼神			2010-2013款    
	mit9502,   //三菱 劲炫ASX		   2011-2014款     
	mit9503,   //三菱 风迪思		   2013款          
	mit9504,   //三菱 蓝瑟          2006-2012款     
	mit9505,   //三菱 君阁	        2008、2011款   
	mit9506,   //三菱 菱帅	        2004-2005款    
	mit9507,   //三菱 帕杰罗进口	    2007-2014款    
	mit9508,   //三菱 欧蓝德		    2007-2012款	   
	mit9509,   //三菱 V5	            2012款         
	mit9510,   //三菱 菱绅	        2004-2006款    
	mit9511,   //三菱 帕杰罗         2004-2011款    
	mit9512,   //三菱 戈蓝	        2007、2009、2012款 
	mit9513,   //三菱 格蓝迪 	        2004-2009款       
	mit9514,   //三菱 欧蓝德          2004-2005款    
	mit9515,   //三菱 东南DN6473   	未知            
	mit9516,   //三菱 欧蓝德          2013款         
	mit9517,   //三菱 未知1			未知            
	mit9518,   //三菱 Lancer		    2008款        
	mit9519,   //三菱 翼神			2010-2011款   
	mit9520,   //三菱 伊柯力斯		2009款        
	mit9521,   //三菱 戈蓝			2007、2009款    
	mit9522,   //三菱 格蓝迪		    2004、2006款    
	mit9523,   //三菱 格蓝迪		    2007款          
	mit9524,   //三菱 劲炫ASX		    2013款          
	mit9525,   //三菱 蓝瑟			2006款          
	mit9526,   //三菱 蓝瑟			2007-2008,2010款  
	mit9527,   //三菱 蓝瑟			2012款            
	mit9528,   //三菱 菱绅			未知              
	mit9529,   //三菱 菱绅			2006款            
	mit9530,   //三菱 菱绅			2004-2005款     
	mit9531,   //三菱 欧蓝德（进口）   2007-2009款     
	mit9532,   //三菱 欧蓝德（进口）   2010-2012款       
	mit9533,   //三菱 帕杰罗		    未知                 
	mit9534,   //三菱 帕杰罗		   2004-2005,2008,2011款 
	mit9535,   //三菱 帕杰罗进口	     未知                
	mit9536,   //三菱 帕杰罗进口	     2004款              
	mit9537,   //三菱 帕杰罗进口       2008-2012款         
	mit9538,   //三菱 帕杰罗进口	     2014款         
	mit9539,   //三菱 帕杰罗速跑	      2004款        
	mit9540,   //三菱 ASX劲炫（进口)		2012款      
	mit9541,   //三菱 帕杰罗劲畅（进口）	2011款  
	mit9542,   //三菱 菱利               未知 //新增**************
	
	//**********20140722***********//
	mit9543,   //三菱  ***  ***
	//&&&&&&&&&&
	mit9544,   //三菱 帕杰罗（进口)   2007-2010款
	mit9545,   //三菱 Lancer		   2006款 
	//**********************20140827******************//
	mit9546,   //三菱 帕杰罗劲畅（带保险杠）     2013-2014款   //中客           
	mit9547,   //三菱 帕杰罗劲畅                2013-2014款    //中客        
	mit9548,   //三菱 未知                      未知      //中客           
	mit9549,   //三菱 格蓝迪	      2009款        
	mit9550,   //三菱  欧蓝德（进口）   2006款  //suv

	//*******************罗晶波********10000-20000*****************//
	//比亚迪**********10000-10499***********//
	byd10000=10000,   //比亚迪 F0	           2008-2013款      
	byd10001,   //比亚迪 F3	           2005-2013款     
	byd10002,   //比亚迪 G3	           2010-2013款     
	byd10003,   //比亚迪 速瑞	           2012-2014款     
	byd10004,   //比亚迪 L3 	           2010-2013款     
	byd10005,   //比亚迪 F6	           2008、2009、2011款   
	byd10006,   //比亚迪 S6	           2011-2014款         
	byd10007,   //比亚迪 M6	           2010、2011、2013款   
	byd10008,   //比亚迪 G6	           2011-2013款         
	byd10009,   //比亚迪 F3R	           2007-2011款       
	byd10010,   //比亚迪 F3	           2010，2012,2013款 
	byd10011,   //比亚迪 F3R            2008,2009，2011款 
	byd10012,   //比亚迪 福莱尔         2003款             
	byd10013,   //比亚迪 福莱尔豪华型    2005款             
	byd10014,   //比亚迪 S6   	       2011-2013款       
	byd10015,   //比亚迪 未知1          未知 
   //&&&&&&&&&
    byd10016,   //比亚迪 F3  2007-2010款
   //**********************20140827******************//
    byd10017,   //比亚迪 秦	           2014款 


	//路虎**********10500-10999***********//
	land10500=10500,   //路虎 揽胜运动	       2012-2013款    
	land10501,   //路虎 第四代发现者	   2010-2014款    
	land10502,   //路虎 神行者          2011-2014款    
	land10503,   //路虎 神行者          2007-2010款    
	land10504,   //路虎 揽胜极光	       2012-2014款    
	land10505,   //路虎 揽胜            2005-2012款    
	land10506,   //路虎 揽胜Vogue	   2013款            
	land10507,   //路虎 发现者          未知           
	land10508,   //路虎 发现者	       2011-2013款   
	land10509,   //路虎 揽胜   	       2007款        
	land10510,   //路虎 揽胜            未知          
	land10511,   //路虎 揽胜运动版	   2010、2013款  
	land10512,   //路虎 神行者	       2003、2004款  
	land10513,   //路虎 神行者	       2010款        
	land10514,   //路虎 神行者	       2011-2013款   
	land10515,   //路虎 揽胜极光	       2011款        
	land10516,   //路虎 揽胜	           2010款        
	land10517,   //路虎 揽胜	           2012、2013款  
	land10518,   //路虎 未知1           未知          
    //**********************20140827******************//
	land10519,   //路虎 揽胜   	       2010-2012款    //中客     
	land10520,   //路虎 第四代发现者    2014款         //中客
	land10521,   //路虎 揽胜运动版	   2014款         //中客

	//凯迪拉克**********11000-11499***********//
	cad11000=11000,   //凯迪拉克 SRX				2010-2014款 
	cad11001,   //凯迪拉克 CTS				2008-2010款     
	cad11002,   //凯迪拉克 XTS				2013-2014款     
	cad11003,   //凯迪拉克 凯雷德Hybrid		2009-2010款     
	cad11004,   //凯迪拉克 CTS				2005-2006款	    
	cad11005,   //凯迪拉克 SLS				2007-2012款     
	cad11006,   //凯迪拉克 SLS赛威	        2007款          
	cad11007,   //凯迪拉克 SLS赛威	        2010-2012款     
	cad11008,   //凯迪拉克 SRX	            2013款          
	cad11009,   //凯迪拉克 SRX	            2010-2012款     
	cad11010,   //凯迪拉克 BLS	            2008款          
	cad11011,   //凯迪拉克 XTS               未知

    //**********20140722***********//
	cad11012,   //凯迪拉克 ***  ***
	//**********************20140827******************//
	cad11013,   //凯迪拉克 ATS（进口）		2014款
	 //20150310
	cad11014,   //凯迪拉克 ATS-L		2014款

	//斯巴鲁**********11500-11999***********//
	sub11500=11500,   //斯巴鲁 森林人     2008-2012款     
	sub11501,   //斯巴鲁 森林人     2006、2007款           
	sub11502,   //斯巴鲁 傲虎       2010-2014款           
	sub11503,   //斯巴鲁 傲虎       2006款                
	sub11504,   //斯巴鲁 XV         2011-2014款          
	sub11505,   //斯巴鲁 力狮       2010-2014款           
	sub11506,   //斯巴鲁 翼豹两厢   2007-2011款	        
	sub11507,   //斯巴鲁 森林人     2013款             
	sub11508,   //斯巴鲁 BRZ	       2013款            
	sub11509,   //斯巴鲁 XV	       2012款            
	sub11510,   //斯巴鲁 傲虎	   2005款                
	sub11511,   //斯巴鲁 傲虎	   2010-2012款           
	sub11512,   //斯巴鲁 傲虎	   2013款                
	sub11513,   //斯巴鲁 驰鹏	   2008、2011款           
	sub11514,   //斯巴鲁 力狮	   2004、2005款           
	sub11515,   //斯巴鲁 力狮	   2006款                
	sub11516,   //斯巴鲁 力狮	   2010款                
	sub11517,   //斯巴鲁 森林人	   2008、2010款          
	sub11518,   //斯巴鲁 森林人	   2011、2012款          
	sub11519,   //斯巴鲁 翼豹	   2007、2008款              
	sub11520,   //斯巴鲁 森林人	   未知                  
	sub11521,   //斯巴鲁 XV	       未知
	
	//**********20140722***********//
	sub11522,   //斯巴鲁 ***  ***  
	//&&&&&&&&&&
	sub11523,   //斯巴鲁 驰鹏  2007款
	//******************20140827********************//
	sub11524,   //斯巴鲁 力狮	   2013-2014款           
	sub11525,   //斯巴鲁 森林人	   2013-2014款   //中客               
	sub11526,   //斯巴鲁 未知	   未知
	sub11527,	//斯巴鲁 XV		   2012,2014款	 //中客


	//克莱斯勒**********12000-12499***********//
	chr12000=12000,   //克莱斯勒          铂锐                2008款        
	chr12001,        //克莱斯勒          未知1	            未知           
	chr12002,        //克莱斯勒	       300C                 2006款        
	chr12003,        //克莱斯勒          大捷龙	            2012款        
	chr12004,        //克莱斯勒         300C_SRT	            2008、2010款   
	chr12005,        //克莱斯勒         PT_漫步者	            2007款        
	chr12006,        //克莱斯勒          Town and Country	    2011款        

	//皇冠**********12500-12999***********//
	crow12500=12500,   //皇冠  未知1	   未知	                              
	crow12501,         //皇冠  皇冠	   2005-2009款                        
	crow12502,         //皇冠  皇冠	    2010-2011款                       
	crow12503,         //皇冠  皇冠	    2012款                            
	crow12504,         //皇冠  V6 	    2011款                            
	crow12505,         //皇冠  V6 	    2010款                      
	crow12506,         //皇冠  V6 	    2012款                      
	crow12507,         //皇冠   皇冠     1991-1999款                 
	crow12508,         //皇冠  皇冠     2004款                       
	crow12509,         //皇冠  V8/V6  2010款 
	//&&&&&&&&&&&
	crow12510,         //皇冠  皇冠     2012款 

	//菲亚特**********13000-13499***********//
	fiat13000=13000,   //菲亚特 周末风 	          2004-2006款       
	fiat13001,         //菲亚特 菲翔  	              2012-2014款   
	fiat13002,         //菲亚特 博悦	              2008、2009、2011款 
	fiat13003,         //菲亚特 菲跃   	          2012-2013款       
	fiat13004,   //菲亚特 派朗  	              2006款            
	fiat13005,   //菲亚特 500  		          2011-2012款       
	fiat13006,   //菲亚特 派力奥/西耶那/周末风  2004-2005款        
	fiat13007,   //菲亚特 派力奥/西耶那/周末风  2005-2006款        
	fiat13008,   //菲亚特 博悦                 2011款            
	fiat13009,   //菲亚特 Doblo                2010款            
	//******************20140827***********************//
	fiat13010,         //菲亚特 菲亚特500       2010-2012款   
	fiat13011,        //菲亚特 ottimo致悦   2014款

	//英菲尼迪**********13500-13999***********//
	infty13500=13500,   //英菲尼迪 未知1	                    未知	             
	infty13501,         //英菲尼迪 G25	                        2010-2013款  
	infty13502,         //英菲尼迪 FX35	                    2009-2012款      
	infty13503,   //英菲尼迪 M25	                        2011、2012款         
	infty13504,   //英菲尼迪 EX25	                    2011-2013款              
	infty13505,   //英菲尼迪 M35	                        2008、2009款         
	infty13506,   //英菲尼迪 FX34/FX45                   2004、2007款          
	infty13507,   //英菲尼迪 FX30d/FX35/FX50/FX37        2009-2011款          
	infty13508,   //英菲尼迪 G25/G37                     2010、2012、2013款    
	infty13509,   //英菲尼迪 QX50/EX系/M35               2008-2013款           
	infty13510,   //英菲尼迪 G35/G37                     2007、2009款          
	infty13511,   //英菲尼迪 Q70L/M系                    2011-2013款           
	infty13512,   //英菲尼迪 FX37/FX/FX35                2012、2013款 
	//&&&&&&&&&&
	infty13513,   //英菲尼迪 M35  2007-2009款
	//***********************20140827************************//
	infty13514,   //英菲尼迪 G37	                    2010-2012款

	//迷你**********14000-14499***********//
	mini14000=14000,   //迷你	MINI	            2004款                     
	mini14001,         //迷你 COUNTRYMAN	        2011款                         
	mini14002,         //迷你 COUNTRYMAN	        2012、2013款                   
	mini14003,   //迷你 CLUBMAN	            2007-2011款                        
	mini14004,   //迷你 MINI                2004、2007、2009-2011、2013款       
	mini14005,   //迷你 COUNTRYMAN          2011、2013款                        
	mini14006,   //迷你 CLUBMAN             2011-2013款                        
	mini14007,   //迷你 COUNTRYMAN滑雪板  	2013款                             
	mini14008,   //迷你 PACEMAN             2014款                             
	mini14009,   //迷你 COUPE               2012款                             
	mini14010,   //迷你 CLUBMAN             2012款   

	//&&&&&&&&&&
	mini14011,   //迷你 未知  未知
	//******************20140827****************************//
	mini14012,   //迷你 COOPER FUN	        2007款                   
	mini14013,   //迷你 COOPER	            未知                        
	mini14014,   //迷你 COUNTRYMAN	        2012款       
	mini14015,   //迷你 COUNTRYMAN          2013款                        
	mini14016,   //迷你 ROADSTER            2012款   

	//捷豹**********14500-14999***********//
	jag14500=14500,   //捷豹 XJ	    2010-2014款     
	jag14501,         //捷豹 XF	    2012-2014款     
	jag14502,         //捷豹 S-Type 	2004款          
	jag14503,   //捷豹 XJ	    2004、2005款        
	jag14504,   //捷豹 X-Type 	2004款              
	jag14505,   //捷豹 XJ 	    1968款              
	jag14506,   //捷豹 XF 	    2008-2011/2013/2014款         

	//宾利**********15500-15999***********//
	bntly15500=15500,   //宾利 慕尚	       2011-2013款                        
	bntly15501,         //宾利 飞驰	       2005-2012款                        
	bntly15502,         //宾利 Continental   2004/2007-2010/2012/2013款       

	//吉普**********16000-16499***********//
	jeep16000=16000,   //吉普 牧马人		1993、2000-2012款    
	jeep16001,         //吉普 北京Jeep	    2007款           
	jeep16002,         //吉普 切诺基		2004-2010款          
	jeep16003,   //吉普 切诺基		2011-2013款              
	jeep16004,   //吉普 未知1		未知                         
	jeep16005,   //吉普 大切诺基	    2007、2008、2010款       
	jeep16006,   //吉普 大切诺基	    2004、2005款             
	jeep16007,   //吉普 指挥官	    2007、2008款             
	jeep16008,   //吉普 指南者 	    2011-2014款              
	jeep16009,   //吉普 大切诺基 	2011-2013款                  
	jeep16010,   //吉普 切诺基	    1997款                   
	jeep16011,   //吉普 牧马人	    2011款                   
	jeep16012,   //吉普 牧马人 	    2008-2014款              
	jeep16013,   //吉普 大切诺基	    未知                     
	jeep16014,   //吉普 大切诺基 	2014款                       
	jeep16015,   //吉普 指南者 	    2013款
	//&&&&&&&&&
	jeep16016,   //吉普 大切诺基(进口)  2008,2010款 
	jeep16017,   //吉普 大切诺基(进口)  2007款
	jeep16018,   //吉普 大切诺基(进口)  2014款
	jeep16019,   //吉普 自由客         2011-2014款
	jeep16020,   //吉普 北京Jeep	     2004-2005款 
	//**********************20140825**********************//
	

	//莲花**********16500-16999***********//
	lot16500=16500,   //莲花 L5	    2011、2012款             
	lot16501,         //莲花 竞悦/L3	2009、2010款	            
	lot16502,         //莲花 L3       2009、2010、2013款	
	//******************20140825*****************//
	lot16503,         //莲花 L3       2013款	//小客
	lot16504,         //莲花 未知     未知		//小客

	//欧宝**********17000-17499***********//
	ope17000=17000,   //欧宝 安德拉	    2011-2013款          
	ope17001,         //欧宝 雅特 	    2004款         
	ope17002,         //欧宝 雅特舒适型	2005款         
	ope17003,         //欧宝 安德拉  		2008、2010款   
	ope17004,   //欧宝 威达 	        2004款             
	ope17005,   //欧宝 赛飞利 	    2010 2013款        
	ope17006,   //欧宝 雅特 	        2007款           
	ope17007,   //欧宝 欧美佳 	    1997款           
	ope17008,   //欧宝 雅特   	    1997、1999款       
	ope17009,   //欧宝 威达 	        1998、1999款       
	ope17010,   //欧宝 赛飞利  	    2011、2013款 
	//&&&&&&&&&&
	ope17011,  //欧宝 雅特  2004-2005,2007,2010款
	ope17012,  //欧宝 威达 	2006款
    ope17013,  //欧宝 雅特  2006-2007,2010款
	ope17014,  //欧宝 赛飞利  2004款
	//**************20140825**********************//
	ope17015,  //欧宝 英速亚  2013款		//小客

	//玛莎拉蒂**********17500-17999***********//
	msrt17500=17500,   //玛莎拉蒂 总裁 	2008-2011款          

	//保时捷**********18000-18499***********// 
	por18000=18000,   //保时捷 Panamera	    2010-2013款      
	por18001,         //保时捷 卡宴   	    2011-2014款    
	por18002,         //保时捷 Panamera	    2014款         
	por18003,         //保时捷 卡宴 	        2010、2011、2014款  
	por18004,         //保时捷 卡宴Turbo 	    2006款	     
	por18005,   //保时捷 卡宴 	           2007款           
	por18006,   //保时捷 卡宴 	           2008、2009款	     
	por18007,   //保时捷 Boxster 	       2004/2006/2009-2011/2013-2014款 
	por18008,   //保时捷 卡宴 Cayenne           2007款       
	por18009,   //保时捷 卡宴 Cayenne S         2006款       
	por18010,   //保时捷 卡宴 Cayenne S         2007,2009款  
	por18011,   //保时捷 卡宴 Cayenne Turbo     未知
	
	//**********20140722***********//
	por18012,   //保时捷 *** ***
	//&&&&&&&&&
	por18013,         //保时捷 卡宴  2006款
	//*****************20140825************************//
	por18014,   //保时捷 Boxster 	       2013款		//小客
	por18015,   //保时捷 Boxster 	       2009-2011款	//小客
	por18016,   //保时捷 Cayman 	       2009-2012款	//小客
	por18017,   //保时捷 卡宴           2007-2009款
	por18018,   //保时捷 Macan	    2014款         
	//荣威**********18500-18999***********//
	row18500=18500,   //荣威 350  	    2010-2013款  
	row18501,         //荣威 550		    2008-2014款  
	row18502,         //荣威 750 		2006-2010款  
	row18503,         //荣威 750 		2011-2012款  
	row18504,   //荣威 W5  		2011-2014款          
	row18505,   //荣威 未知1  	未知	                 
	row18506,   //荣威 950 		2012、2014款         
	row18507,   //荣威 E50 	    2013款               
	row18508,   //荣威 350 	    2010款               
	row18509,   //荣威 350      2011-2014款           
	row18510,   //荣威 750 	    2006-2012款          
	row18511,   //荣威 750 	    2007-2008款          
	row18512,   //荣威 950 	    2012款               
	row18513,   //荣威 w5 	    2011-2013款          
	row18514,   //荣威 罗孚75 	2003-2005款   
	//*******************20140825**********************//
	row18515,   //荣威 750 	    未知			//小客
	row18516,   //荣威 550 	    2003-2005款		//小客 
	row18517,   //荣威 W5 	    2014款			//中客


	//铃木**********19000-19499***********//
	suzk19000=19000,   //铃木 雨燕    	        2013款          
	suzk19001,         //铃木 雨燕	            2005-2012款     
	suzk19002,         //铃木 天语SX4 	        2006-2010款     
	suzk19003,         //铃木 利亚纳	            2006-2012款     
	suzk19004,         //铃木 天语SX4		      2011-2013款       
	suzk19005,   //铃木 羚羊	            2004款                  
	suzk19006,   //铃木 奥拓         	     2009、2010款                
	suzk19007,   //铃木 奥拓	            2013款                  
	suzk19008,   //铃木 利亚纳	        2005款                  
	suzk19009,   //铃木 未知1		    未知                        
	suzk19010,   //铃木 未知2		    未知                        
	suzk19011,   //铃木 奥拓 	        2001、2006款		            
	suzk19012,   //铃木 奥拓 	        2009、2010、2012款	        
	suzk19013,   //铃木 奥拓快乐王子  	2006款	                    
	suzk19014,   //铃木 北斗星	        2004、2009、2012款	    
	suzk19015,   //铃木 北斗星       	2005、2007、2008、2011款     
	suzk19016,   //铃木 北斗星	        2010款	                
	suzk19017,   //铃木 雨燕          	2007-2009款	            
	suzk19018,   //铃木 雨燕          	2005、2008、2009、2011款 
	suzk19019,   //铃木 雨燕          	2005、2010-2012款	    
	suzk19020,   //铃木 天语SX4	        2006款	                
	suzk19021,   //铃木 天语SX4	        2007-2011款	            
	suzk19022,   //铃木 天语SX4	        2009、2010款	            
	suzk19023,   //铃木 天语SX4 运动版	2011款	                
	suzk19024,   //铃木 天语尚悦	        2011，2012款	            
	suzk19025,   //铃木 利亚纳	        2005、2006、2008、2011、2012款	
	suzk19026,   //铃木 利亚纳	        2011-2013款	                   
	suzk19027,   //铃木 羚羊           	2004、2011款	                   
	suzk19028,   //铃木 羚羊             2007、2009款	                   
	suzk19029,   //铃木 吉姆尼	        2007-2011款	                   
	suzk19030,   //铃木 浪迪	            2007、2010款	                
	suzk19031,   //铃木 超级维特拉	    2007、2008、2011款	        
	suzk19032,   //铃木 天语SX4	        2012款	                    
	suzk19033,   //铃木 凯泽西	        2010、2011款	                
	suzk19034,   //铃木 吉姆尼	        2012款
	//******************20140722**************//
	suzk19035,   //铃木  ***   ***

	//&&&&&&&&&&
	suzk19036,    //铃木 雨燕       2007-2009款
	suzk19037,   //铃木 超级维特拉   2012款
	//******************20140825*******************//
	suzk19038,   //铃木 锋驭	        2014款  //中客
	suzk19039,	 //铃木	天语SX4			2013款	//中客
	suzk19040,    //铃木 羚羊           	2011款	 
	suzk19041,    //铃木 羚羊           	2012款	
	suzk19042,    //铃木 北斗星       2012-2013款

	//名爵**********19500-19999***********//
	mg19500=19500,   //名爵 未知1		    未知	                   
	mg19501,         //名爵 MG6		    2010-2014款            
	mg19502,         //名爵 MG3   	        2013-2014款        
	mg19503,         //名爵 MG5  		    2012、2014款        
	mg19504,   //名爵 MG3  		    2011款                     
	mg19505,   //名爵 Mg3SW	        2008、2009款                
	mg19506,   //名爵 Mg3	        2010-2013款                
	mg19507,   //名爵 Mg7	        2007-2010款                
	mg19508,   //名爵 Mg7自动加长	2007-2009款                    

	//奇瑞 **********20000-20499***********//
	chry20000=20000,   //奇瑞 瑞虎    		    2010-2013款    
	chry20001,         //奇瑞 瑞虎			    2005-2009款    
	chry20002,         //奇瑞 东方之子		    2004-2007款    
	chry20003,         //奇瑞 旗云2   		    2012款         
	chry20004,   //奇瑞 A3     			2009款           
	chry20005,   //奇瑞 旗云			    2006-2007款      
	chry20006,   //奇瑞 风云2两厢		2010款               
	chry20007,   //奇瑞 旗云			    2004款           
	chry20008,   //奇瑞 A5     			2006-2009款      
	chry20009,   //奇瑞 未知1			未知	                 
	chry20010,   //奇瑞 QQ3    			2004-2012款      
	chry20011,   //奇瑞 旗云    		    2008款           
	chry20012,   //奇瑞 未知2			未知	                 
	chry20013,   //奇瑞 A3				2010-2012款      
	chry20014,   //奇瑞 风云2掀背		2010款               
	chry20015,   //奇瑞 风云2掀背		2013款               
	chry20016,   //奇瑞 旗云1   		    2010-2012款      
	chry20017,   //奇瑞 QQ       		2013款           
	chry20018,   //奇瑞 QQ3运动版		2012款               
	chry20019,   //奇瑞 旗云3			2010款               
	chry20020,   //奇瑞 E5     			2011、2012款     
	chry20021,   //奇瑞 QQ6			 	2007款           
	chry20022,   //奇瑞 未知3			未知	                 
	chry20023,   //奇瑞 未知4			未知	                 
	chry20024,   //奇瑞 东方之子Cross	2006-2009款          
	chry20025,   //奇瑞 东方之子	        2012款           
	chry20026,   //奇瑞 A5	            2006，2007，2009款
	chry20027,   //奇瑞 瑞虎	            2005款           
	chry20028,   //奇瑞 A3	            2008-2010，2012款
	chry20029,   //奇瑞 风云	            2005款           
	chry20030,   //奇瑞 瑞虎          	2007，2009款     
	chry20031,   //奇瑞 E5	            2011，2012，2014款
	chry20032,   //奇瑞 旗云	            2004，2006-2008款
	chry20033,   //奇瑞 开瑞优雅      	2007款           
	chry20034,   //奇瑞 东方之子	        2004-2006款      
	chry20035,   //奇瑞 旗云2	        2010款               
	chry20036,   //奇瑞 A1	            2007，2009，2011款
	chry20037,   //奇瑞 开瑞优翼	        2007款              
	chry20038,   //奇瑞 旗云1          	2010款 
	//&&&&&&&&&&&
	chry20039,   //奇瑞 东方之子  2006款
	chry20040,   //奇瑞 E3        2013款  //小客
	//************************20140825*************************//
	chry20041,   //奇瑞 艾瑞泽7          	2013-2014款		//小客
	chry20042,   //奇瑞 QQ         	        未知			//小客
    chry20043,   //奇瑞 旗云1          	    2012款			//小客
	chry20044,   //奇瑞 东方之子          	2007款			//小客
	chry20045,   //奇瑞 瑞虎5          	    2014款			//中客

	//************************陈聪***20500-49500***************************//
	//帝豪**********20500-20999***********// 
	emg20500=20500,   //帝豪 EC7		    2009、2012款            
	emg20501,         //帝豪 EC7 		2013款                  
	emg20502,         //帝豪 未知1     	未知                    
	emg20503,         //帝豪 EC7  	    2009款、2012-2013款     
	emg20504,         //帝豪 EC7   	    2010款、2012款          
	emg20505,         //帝豪 EC8   	    2011款
	//&&&&&&&&&&&
	emg20506,         //帝豪 EC7   	    2009、2010、2012、2013款   //小客

	//哈飞**********21000-21499***********//
	hafe21000=21000,   //哈飞 未知1	        未知	               
	hafe21001,         //哈飞 小霸王          2010款             
	hafe21002,         //哈飞 未知2	        未知	               
	hafe21003,         //哈飞 民意金牛版	    2008款              
	hafe21004,         //哈飞 路宝     	    2004款              
	hafe21005,         //哈飞 路宝    	    2008款              
	hafe21006,         //哈飞 民意超值版	    2008款              
	hafe21007,         //哈飞 民意     	    2005款              
	hafe21008,         //哈飞 中意     	    2000-2002款         
	hafe21009,         //哈飞 赛马    	    2004款              
	hafe21010,         //哈飞 赛马     	    2007款              
	hafe21011,         //哈飞 松花江  	    2004款              
	hafe21012,         //哈飞 路尊大霸王	    2011款              
	hafe21013,         //哈飞 赛马    	    2009款              
	hafe21014,         //哈飞 骏意    	    2010款    
	hafe21015,         //哈飞 中意V5         2013款
	hafe21016,         //哈飞 民意           2012款

	//东南**********21500-21999***********//
	soue21500=21500,   //东南 得利卡		2014款           
	soue21501,         //东南 V3菱悦		2008-2014款      
	soue21502,         //东南 V5菱致		2012-2014款      
	soue21503,         //东南 希旺    	2013款           
	soue21504,         //东南 得利卡  	2008款           
	soue21505,   //东南 未知1		未知	            
	soue21506,   //东南 未知2		未知	            
	soue21507,   //东南 未知3		未知	            
	soue21508,   //东南 V6菱仕  	2012-2014款     
	soue21509,   //东南 菱帅    	2004-2005款     
	soue21510,   //东南 未知4		未知	            
	soue21511,   //东南 未知5		未知             
	soue21512,   //东南 富利卡   	2003款          
	soue21513,   //东南 富利卡   	2009款          
	soue21514,   //东南 希旺    	2011款          
	soue21515,   //东南 菱帅     	2004款          
	soue21516,   //东南 菱利    	2006款          
	soue21517,   //东南 V3菱悦   	2010-2011款     
	soue21518,   //东南 V3菱悦  	2008-2009款     
	soue21519,   //东南 V3菱悦  	2012款          
	soue21520,   //东南 富利卡  	2001款          
	soue21521,   //东南 得利卡  	2002款          
	soue21522,   //东南 富利卡  	2003款 
	//********************20140825*******************//
	soue21523,   //东南 V6凌仕  	2013-2014款		//小客

	//前黄牌添加
	soue21900=21900,    //东南  未知    未知   //中客


	//宝骏**********22000-22499***********//        
	baoj22000=22000,   //宝骏 630 	  2011-2013款
	baoj22001,         //宝骏 未知	  2013-2014款
	baoj22002,         //宝骏 乐驰     2009-2012款
	baoj22003,         //宝骏 730      2014款

	//奔腾**********22500-22999***********//
	best22500=22500,   //奔腾 B70 	     2010-2011款     
	best22501,         //奔腾 B50		 2009、2011款  
	best22502,         //奔腾 B70		 2006-2009款   
	best22503,         //奔腾 未知1     未知	          
	best22504,         //奔腾 B70  	 2010款            
	best22505,         //奔腾 B50   	 2010款        
	best22506,         //奔腾 X80   	 2013款 
	best22507,         //奔腾 未知    未知  //添加的小货*********
    //********************20140825*******************//
	best22508,         //奔腾 未知    未知  //中客
	best22509,        //奔腾  B70    2014-2015款
	//昌河**********23000-23499***********//
	chah23000=23000,   //昌河 未知1	    未知       
	chah23001,         //昌河 福瑞达	   2011款      
	chah23002,         //昌河 爱迪尔	   2004款      

	//大发**********23500-23999***********//
	daih23500=23500,   //大发 森雅 	    2007-2008款      
	daih23501,         //大发 特锐	    2003款           
	daih23502,         //大发 CUORE	    1997款           

	//东风**********24000-24499***********//
	dofe24000=24000,   //东风  风行菱智/菱智V3			2007、2012-2014款             
	dofe24001,         //东风  风行/M3					2010-2011、2013-2014款    
	dofe24002,         //东风  风行景逸/景逸SUV	  	2007-2014款                   
	dofe24003,         //东风  风行菱智M5           	2012-2014款     
	dofe24004,   //东风	小康K07/K17/K07II	  	2006-2013款         
	dofe24005,   //东风 风行景逸X5          	2013款                  
	dofe24006,   //东风 未知1					未知	                    
	dofe24007,   //东风 风神H30		          	2010-2014款         
	dofe24008,   //东风 小康C37              	2012款                  
	dofe24009,   //东风 小康V27/V29/V07S	   	2011、2012款            
	dofe24010,   //东风 风神S30		          	2009-2012款         
	dofe24011,   //东风 雪铁龙					未知                
	dofe24012,   //东风 风神A60		          	2012、2014款        
	dofe24013,   //东风 小康风光             	2013款                  
	dofe24014,   //东风 景逸                	2007款、2009-2012款、2014款	
	dofe24015,   //东风 小康K17         	    2009款	                    
	dofe24016,   //东风 锐骐                 	2010款                      
	dofe24017,   //东风 菱智                 	2007-2008款、2010-2011款     
	dofe24018,   //东风 菱智                	2013款                      
	dofe24019,   //东风 菱智                 	2010款、2012-2014款	 
	dofe24020,   //东风 风神H30/S30         	2012款	             
	dofe24021,   //东风 福瑞卡              	2010款	             
	dofe24022,   //东风 东风劲诺            	2009款               
	dofe24023,   //东风 信天游皮卡          	2002款               
	dofe24024,   //东风 帅客                	2010-2013款       
	dofe24025,   //东风 菱智                 	2013-2014款	      
	dofe24026,   //东风 东风小霸王          	2006款	          
	dofe24027,   //东风 东风小霸王            	2012款	      
	dofe24028,   //东风 奥丁                 	2007款	          
	dofe24029,   //东风 御轩                  	2009款        
	dofe24030,   //东风 环卫设备系列          	未知              
	dofe24031,   //东风 小康V                  	2011款	      
	dofe24032,   //东风 菱智                  	2012-2014款   
	dofe24033,   //东风 景逸                	2011-2012款、2014款
	dofe24034,   //东风 小康C35/C37	            2013款，2012款  
	dofe24035,   //东风 东风小康V29         	2012款             
	dofe24036,   //东风 虎视                 	2008款             
	dofe24037,   //东风 东风乘龙               	2012款         
	dofe24038,   //东风 东风金刚            	2005款             
	dofe24039,   //东风 劲诺                 	2011款
	dofe24040,   //东风 未知                未知1   //添加的小货***********
	dofe24041,   //东风 未知                 未知2   //添加的小货***********
	dofe24042,   //东风 本田 思铭             2012款
	//&&&&&&&&&&&&
	dofe24043,   //东风	小康K0711  2013款
	dofe24044,   //东风	小康K17    2009款
	dofe24045,   //东风	锐骐皮卡  2013款   //小货
	//********************20140825*******************//
	dofe24046,   //东风	风神H30  2013，2014款	//中客
	dofe24047,   //东风	风行CM7  2014款			//中客
	dofe24048,   //东风	风神S30  2013-2014款	//小客
	dofe24049,   //东风	小康K07  2013款			//中客
	dofe24050,   //东风 俊风cv03  2012款         //中客 
	dofe24051,   //东风 御风       2012-2014款
	dofe24052,   //东风 景逸S50    2014款

	//前黄牌添加
	dofe24400=24400,   //东风 未知 未知   //大货
	dofe24401,         //东风 未知 未知   //大客

	//福迪**********24500-24999***********//
	fudi24500=24500,   //福迪 雄狮        	2012款     
	fudi24501,         //福迪 探索者6 	    2010款     
	fudi24502,         //福迪 雄狮        	2009款     
	fudi24503,         //福迪 小超人      	2012款     
	fudi24504,         //福迪 雄狮F16     	2012款  
   //********************20140825*******************//
   fudi24505,         //福迪 未知     	未知 

	//传祺**********25500-25999***********//
	chuaq25500=25500,   //传祺 GA5	  2011-2012款      
	chuaq25501,         //传祺 GS5	  2012-2014款 
	//********************20140825*******************//
	chuaq25502,          //传祺 GA3	  2013-2014款   

	//海马**********26000-26499***********//
	haim26000=26000,   //海马 福美来   	2011-2014款   
	haim26001,         //海马 M3	        2013-2014款   
	haim26002,         //海马 海福星  	2007-2010款   
	haim26003,         //海马 未知1		未知	         
	haim26004,         //海马 海马3      2007-2010款   
	haim26005,   //海马 未知2		未知	          
	haim26006,   //海马 丘比特  	2010-2013款   
	haim26007,   //海马 骑士	    2010-2013款   
	haim26008,   //海马 普力马   	2006款        
	haim26009,   //海马 福美来   	2008-2010款   
	haim26010,   //海马 福美来   	2006款        
	haim26011,   //海马 海福星	2011-2012款   
	haim26012,   //海马 普力马	2013款        
	haim26013,   //海马 S7     	2013款        
	haim26014,   //海马 福美来  	2006-2007款   
	haim26015,   //海马 普力马  	2007款        
	haim26016,   //海马 普力马  	2010款、2012款 
	haim26017,   //海马 欢动    	2009-2010款   
	haim26018,   //海马 福美来   	2011款        
	haim26019,   //海马 骑士    	2012款        
	haim26020,   //海马 丘比特   	2010-2012款   
	haim26021,   //海马 福仕达鸿达  2009款      
	haim26022,   //海马 S3      	2010款        
	haim26023,   //海马 福美来  	2012-2014款 
	//&&&&&&&&&&&&&&&&
	haim26024,   //海马 福仕达鸿达/腾达         2012款
	haim26025,   //海马 普力马（电动版/自动座）  2010,2014款
	haim26026,   //海马 M3                    2014款 
	//********************20140825*******************//
	haim26027,   //海马 福仕达荣达       2012款		//中客
	haim26028,   //海马 海马王子         2010款		//小客
	haim26029,   //海马 福美来M5         2014款    
	haim26030,   //海马 S5              2014款  //SUV

	
	//中华**********26500-26999***********//
	flyw26500=26500,   //中华 骏捷				2006-2010款   
	flyw26501,         //中华 骏捷FSV  			2009-2011款   
	flyw26502,         //中华 未知1				未知	          
	flyw26503,         //中华 骏捷Cross/骏捷FRV	2008-2010款   
	flyw26504,         //中华 530				2011-2012款   
	flyw26505,   //中华 尊驰    			2004-2008款    
	flyw26506,   //中华 V5				2012、2014款   
	flyw26507,   //中华 骏捷				2011-2012款    
	flyw26508,   //中华 H230				2012款         
	flyw26509,   //中华 尊驰       	    2004款         
	flyw26510,   //中华 骏捷FSV         	2011款         
	flyw26511,   //中华 骏捷FRV         	2008-2009款    
	flyw26512,   //中华 H530            	2011-2012款    
	flyw26513,   //中华 骏捷FRV         	2010款         
	flyw26514,   //中华 中华尊驰        	2004款/2007-2008款  
	flyw26515,   //中华 骏捷FSV         	2009款              
	flyw26516,   //中华 骏捷CROSS       	2009-2010款         
	flyw26517,   //中华 中华酷宝         	2007款  
	//&&&&&&&&&&&&
	flyw26518,   //中华 H330     2013款
	//********************20140825*******************//
	flyw26519,   //中华 骏捷     2011-2012款	//小客

	//汇众**********27000-27499***********//
	huiz27000=27000,   //汇众 伊思坦纳     	2013款     
	huiz27001,         //汇众 伊斯坦纳	    2008款     
	huiz27002,         //汇众 伊斯坦纳	    2005款     
	huiz27003,         //汇众 大通	        2011款     
	huiz27004,         //汇众 伊斯坦纳救护车	2005款   

	//前黄牌添加
	huiz27400=27400,   //汇众 未知  未知   //中客

	//吉利**********27500-27999***********//
	geely27500=27500,   //吉利 自由舰   	 2011-2012款       
	geely27501,         //吉利 熊猫   		 2009-2011款   
	geely27502,         //吉利 GX7			 2012-2014款   
	geely27503,         //吉利 远景			 2006-2013款   
	geely27504,   //吉利 金刚   	     2006-2010、2013款     
	geely27505,   //吉利 SC6	         2012款                
	geely27506,   //吉利 全球鹰 GC718	 2013款                
	geely27507,   //吉利 未知1		  未知	              
	geely27508,   //吉利 优利欧     	  2004-2005款          
	geely27509,   //吉利 GX2	          2011-2012款          
	geely27510,   //吉利 未知2			 未知	          
	geely27511,   //吉利 未知3			 未知	          
	geely27512,   //吉利 未知4			 未知	          
	geely27513,   //吉利 自由舰		 2005-2010款           
	geely27514,   //吉利 远景         2004款、2009-2010款   
	geely27515,   //吉利 金刚/金鹰     2009-2010款、2013款，2008款、2010款 
	geely27516,   //吉利 海晏        	 2010-2013款	                       
	geely27517,   //吉利 金刚        	 2006-2007款                        
	geely27518,   //吉利 熊猫        	 2009-2011款、2013款                
	geely27519,   //吉利 远景         2011-2013款                        
	geely27520,   //吉利 美日/优利欧   2004款，2004-2005款                
	geely27521,   //吉利 豪情       	 2004款                             
	geely27522,   //吉利 自由舰   	 2007款                             
	geely27523,   //吉利 美日   	     2006款                             
	geely27524,   //吉利 豪情 	     2004-2006款                        
	geely27525,   //吉利 GC7          2012-2013款                       
	geely27526,   //吉利 GX7          2012-2013款	                   
	geely27527,   //吉利 金刚        	 2010款	
	geely27528,   //吉利 美人豹        未知    
	//********************20140825*******************//
	geely27529,   //吉利 SX7          2013款	 //中客

	//江淮**********28000-28499***********//
	jac28000=28000,   //江淮 瑞风			2007款     
	jac28001,         //江淮 和悦RS	    2010-2012款
	jac28002,         //江淮 和悦			2010-2012款
	jac28003,         //江淮 瑞风			未知       
	jac28004,   //江淮 瑞风政采版	    2011款         
	jac28005,   //江淮 未知1		    未知	          
	jac28006,   //江淮 瑞风M5		    2012-2014款   
	jac28007,   //江淮 同悦			2008-2012款   
	jac28008,   //江淮 星锐    		2011款        
	jac28009,   //江淮 和悦RS   	    2013款        
	jac28010,   //江淮 瑞风S5  		 2013款       
	jac28011,   //江淮 瑞风			 2011款       
	jac28012,   //江淮 威铃	         未知          
	jac28013,   //江淮 瑞风     	    2007款,2011款,2012款  
	jac28014,   //江淮 瑞鹰     	    2007-2010款	         
	jac28015,   //江淮 瑞风M5    	    2012-2013款          
	jac28016,   //江淮 瑞风      	    2007款、2011款	     
	jac28017,   //江淮 好运M系   	    2010款	             
	jac28018,   //江淮 好运             未知	             
	jac28019,   //江淮 好运W系  	    2010款               
	jac28020,   //江淮 大好运           未知               
	jac28021,   //江淮 宾悦     	    2008-2009款          
	jac28022,   //江淮 和悦A13RS/同悦	2014款，2008-2012款   
	jac28023,   //江淮 瑞玲         	2011-2012款          
	jac28024,   //江淮 好运N系       	2010款               
	jac28025,   //江淮 帅铃N系      	2013款               
	jac28026,   //江淮 瑞鹰         	2011-2013款
	jac28027,   //江淮 未知         未知               //添加的小货**********
	//&&&&&&&&&&&
	jac28028,   //江淮 威铃2中卡    未知       
	jac28029,   //江淮 威铃中卡     未知       
	jac28030,   //江淮 瑞驰K5      2014款   
	//********************20140825*******************//
	jac28031,   //江淮 宾悦      2011-2012款	//小客 
	jac28032,   //江淮 凌铃      2014款			//小货
	jac28033,   //江淮 悦悦      2009-2012款	//小客
	jac28034,   //江淮 瑞风S5    2013-2014款
	jac28035,   //江淮 悦悦CROSS   2012款

	//前黄牌truck添加
	jac28400=28400,   //江淮 未知    未知1  //大货*******
	jac28401,         //江淮 未知    未知2  //中客********
	//20140820
	jac28402,         //江淮 未知    未知3  //大客*****
	jac28403,         //江淮  威铃
	jac28404,         //江淮  帅铃
	jac28405,         //江淮  好运

	//江铃**********28500-28999***********//
	jmc28500=28500,    //江铃 全顺		  未知         
	jmc28501,          //江铃 宝威		  2005、2009款 
	jmc28502,          //江铃 顺达	      未知         
	jmc28503,          //江铃 宝典    	  2007款       
	jmc28504,    //江铃 宝典汽油版  2009款              
	jmc28505,    //江铃 凯运	       2010款     
	jmc28506,    //江铃 宝典柴油版   2009款      
	jmc28507,    //江铃 未知1       未知        
	jmc28508,    //江铃 驭胜        2011-2012款 
	jmc28509,    //江铃 宝威        2009款      
	jmc28510,    //江铃 宝典    	   2013款      
	jmc28511,    //江铃 宝威        2005款
	//&&&&&&&&&&&&
	jmc28512,   //江铃 未知  未知
	//********************20140825*******************//
	jmc28513,    //江铃 凯锐800        未知		//大货
	jmc28514,    //江铃 驭胜           2013款	//中客
	jmc28515,    //江铃 驭胜  未知

	//前黄牌truck添加
	jmc28900=28900,    //江铃 未知    未知   //大货********
	jmc28901,     //江铃 凯运

	//金杯**********29000-29499***********//
	jinb29000=29000,   //金杯 大海狮		     2011-2013款 
	jinb29001,         //金杯 未知1		     未知        
	jinb29002,         //金杯 阁瑞斯		     2008款      
	jinb29003,         //金杯 未知2		     未知        
	jinb29004,   //金杯 海星A7/A9	     2011款              
	jinb29005,   //金杯 海狮		     2011、2014款        
	jinb29006,   //金杯 勤务兵/快运	 2005款，2008款    
	jinb29007,   //金杯 海狮    	     2011款           
	jinb29008,   //金杯 阁瑞斯  	     2007款、2010款    
	jinb29009,   //金杯 海星A7/A9/T22	 2011-2012款         
	jinb29010,   //金杯 阁瑞斯      	 2008款、2013款       
	jinb29011,   //金杯 金典007     	 2009款              
	jinb29012,   //金杯 大力神      	 2009款
	jinb29013,   //金杯 未知         未知    //添加的小货***********

	//前黄牌truck添加
	jinb29400=29400,   //金杯 未知   未知    //中客********
	//20140820
	jinb29401,         //金杯 未知   未知    //大货********

	//开瑞**********29500-29999***********//
	karr29500=29500,   //开瑞 优雅2代		    2013款          
	kary29501,         //开瑞 优雅    	    2007款、2012款   
	kary29502,         //开瑞 优劲    	    2012款          
	kary29503,         //开瑞 优翼    	    2007款   
	//********************20140825**************//
	kary29504,         //开瑞 优胜2代    	 2010款 //中客
	kary29505,         //开瑞 未知   	     未知   //中客
	kary29506,         //开瑞 优优   	     2012款   //中客
	kary29507,         //开瑞 优优2代      2013款  //MBC


	//理念**********30000-30499***********//
	lini30000=30000,   //理念 S1	2011-2012款    
	lini30001,         //理念 S1 2014款

	//力帆**********30500-30999***********//
	lfan30500=30500,   //力帆 620		2008-2012款  
	lfan30501,         //力帆 X60		2011-2012款  
	lfan30502,         //力帆 320		2009-2012款  
	lfan30503,         //力帆 520		2007款       
	lfan30504,         //力帆 风顺	    2011款       
	lfan30505,         //力帆 520		2008-2011款  
	lfan30506,         //力帆 520		2011款       
	lfan30507,         //力帆 320		2009-2013款  
	lfan30508,         //力帆 丰顺	    2011款   
	//&&&&&&&&&&
	lfan30509,         //力帆 X60(发现版)  2012款
	lfan30510,         //力帆 X60		2012-2013款   //中客
	lfan30511,         //力帆 720		2013-2014款   //小客
	//********************20140825**************//
	lfan30512,         //力帆 T21        2013款     //中客


	//南京**********31000-31499***********//
	nanj31000=31000,   //南京 未知1   未知        

	//启辰**********31500-31999***********//
	qich31500=31500,   //启辰 R50		2012-2014款   
	qich31501,         //启辰 D50		2012-2014款   

	//威麟**********32000-32499***********//
	rely32000=32000,   //威麟 V5		2009款       
	rely32001,         //威麟 X5		2010-2011款  
	rely32002,	       //威麟 V5		2009-2012款  

	//五十铃**********32500-32999***********//
	isuz32500=32500,   //五十铃 Redeo	         未知   
	isuz32501,         //五十铃 100P轻型商用车     未知   
	isuz32502,         //五十铃 庆铃T系列		     2009款 
	isuz32503,         //五十铃 600P轻型商用车     未知   
	isuz32504,         //五十铃 未知1             未知   
	isuz32505,         //五十铃 庆铃N系列		    2009款
	isuz32506,         //五十铃 未知              未知     //添加的小货***********
	//&&&&&&&&&&&
	isuz32507,         //五十铃 皮卡   2009款
	isuz32508,         //五十铃 FRR中卡  未知

	//前黄牌添加
	isuz32900=32900,   //五十铃 未知 未知  //大货
	


	//夏利**********33000-33499***********//
	xial33000=33000,   //夏利 未知1	        未知            
	xial33001,         //夏利 未知2	        未知            
	xial33002,         //夏利 未知3	        未知            
	xial33003,         //夏利 夏利N3三厢	2004-2005款         
	xial33004,         //夏利 夏利N3三厢	2008款              
	xial33005,         //夏利 夏利A+		2006、2010、2011款  
	xial33006,         //夏利  未知 		未知                

	//羊城**********33500-33999***********//
	ycac33500=33500,   //羊城 骏铃  未知      
	ycac33501,         //羊城 未知1 未知      


	//一汽**********34000-34499***********//
	yiqi34000=34000,   //一汽 佳宝V52		   2011款          
	yiqi34001,         //一汽 森雅M80		   2009、2011款    
	yiqi34002,         //一汽 威乐		    2004款         
	yiqi34003,         //一汽 威志三厢	    2007-2011款    
	yiqi34004,   //一汽 威志V2		2010、2012款      
	yiqi34005,   //一汽 N1			未知              
	yiqi34006,   //一汽 夏利N7		2013款            
	yiqi34007,   //一汽 夏利N5		2010-2014款       
	yiqi34008,   //一汽 森雅S80		2011、2013款 
	yiqi34009,   //一汽 夏利N5		未知         
	yiqi34010,   //一汽 奔腾B50		2009-2013款  
	yiqi34011,   //一汽 奔腾B70		2006-2008款  
	yiqi34012,   //一汽 奔腾B70		2009-2011款  
	yiqi34013,   //一汽 未知1		    未知         
	yiqi34014,   //一汽 未知2		    未知         
	yiqi34015,   //一汽 奔腾B79		2012款       
	yiqi34016,   //一汽 未知3		    未知         
	yiqi34017,   //一汽 小解放        未知        
	yiqi34018,   //一汽 一汽解放1     未知         
	yiqi34019,   //一汽 一汽501       未知        
	yiqi34020,   //一汽 森雅M80		2011款       
	yiqi34021,   //一汽 霸铃          未知        
	yiqi34022,   //一汽 威志		    2006-2009款  
	yiqi34023,   //一汽 威姿		    2004、2011款 
	yiqi34024,   //一汽 佳宝T57		2011款       
	yiqi34025,   //一汽 自由风		2005-2010款  
	yiqi34026,   //一汽 威志		    2011款       
	yiqi34027,   //一汽 佳宝V70		2011款       
	yiqi34028,   //一汽 威志V5		2012-2013款  
	yiqi34029,   //一汽 一汽解放2     未知
	yiqi34030,   //一汽 未知         未知1   //添加的小货************
	yiqi34031,   //一汽 未知         未知2  //添加的小货************
	yiqi34032,   //一汽 未知         未知3   //添加的小货************
	//&&&&&&&&&&
	yiqi34033,   //一汽 吉林佳星T51   2011款
	yiqi34034,   //一汽 坤程          2011款   //小货
	yiqi34035,   //一汽 威志V2        2010、2011款   //中客
	//********************20140825*************************//
	yiqi34036,   //一汽 佳宝V80        2013、2014款  //中客
	yiqi34037,   //一汽 奔腾B70       2014款
	yiqi34038,   //一汽 奔腾B90       2013-2014款

	//前黄牌添加******
	yiqi34400=34400,   //一汽 未知 未知1  //大客
	yiqi34401,         //一汽 未知 未知2  //大货
	
	//依维柯**********34500-34999***********//
	ivec34500=34500,   //依维柯 得意	        2009、2012款   
	ivec34501,         //依维柯 都灵			2009款        
	ivec34502,         //依维柯 康果			2003-2004款   
	ivec34503,         //依维柯 得意			2009款        
	ivec34504,         //依维柯 未知1           未知        
	ivec34505,         //依维柯 宝迪			2009、2012款 

	//前黄牌添加
	ivec34900=34900,    //依维柯 未知  未知   //中客

	//跃进**********35000-35499***********//
	yuej35000=35000,   //跃进 未知1  未知   
	yuej35001,   //跃进 未知  未知   //添加的小货************
	//*****************20140827*******************//
	yuej35002,   //跃进 小福星S50  未知   //小货

	//长城**********35500-35999***********//
	grtw35500=35500,   //长城 赛影	        2007款        
	grtw35501,         //长城 酷熊	        2009-2010款   
	grtw35502,         //长城 C20R	        2011、2013款  
	grtw35503,         //长城 M1		        2009-2010款   
	grtw35504,   //长城 赛弗	        2003-2004款           
	grtw35505,   //长城 C50		    2012-2013款     
	grtw35506,   //长城 M2		    2010款          
	grtw35507,   //长城 风骏3	        2011款          
	grtw35508,   //长城 嘉誉	        2008-2009款     
	grtw35509,   //长城 H5		    2010-2013款     
	grtw35510,   //长城 H6		    2011-2014款     
	grtw35511,   //长城 凌傲	        2010-2011款     
	grtw35512,   //长城 M4		        2012-2013款 
	grtw35513,   //长城 H3		        2005-2012款 
	grtw35514,   //长城 C30		        2010-2013款 
	grtw35515,   //长城 未知1	            未知        
	grtw35516,   //长城 哈弗H6			2011-2012款 
	grtw35517,   //长城 哈弗H3锐意版	    2009-2012款 
	grtw35518,   //长城 金迪尔			2008款      
	grtw35519,   //长城 V80				2012-2013款 
	grtw35520,   //长城 炫丽			    2010-2011款 
	grtw35521,   //长城 炫丽			    2008-2009款 
	grtw35522,   //长城 精灵			    2008-2009款 
	grtw35523,   //长城 哈弗H3			2006-2007款 
	grtw35524,   //长城 哈弗H3			2008款      
	grtw35525,   //长城 哈弗H3领先版	    2009-2010款 
	grtw35526,   //长城 哈弗H5智尊版	    2010-2012款 
	grtw35527,   //长城 C30				2010款      
	grtw35528,   //长城 C30				2012款      
	grtw35529,   //长城 C30				2013款      
	grtw35530,   //长城 哈弗H5欧风版	    2010-2011款 
	grtw35531,   //长城 风骏5			    2011款      
	grtw35532,   //长城 哈弗H5欧风版	    2012款      
	grtw35533,   //长城 风骏5			    2013款      

	//*****************20140722****************//
	grtw35534,   //长城 ***  ***  
	//******************20140827************************//
	grtw35535,   //长城 M4	            2012-201014款  //中客
	grtw35536,   //长城 V80/嘉誉	        2011款/2008，2009款  //中客
	grtw35537,   //长城 哈弗H5			2012款   //中客  

	//五菱**********36000-36499***********//
	wuli36000=36000,   //五菱 五菱荣光	                2011-2012款   
	wuli36001,         //五菱 五菱之光	                2013款        
	wuli36002,         //五菱 五菱之光	                2008-2010款   
	wuli36003,         //五菱 五菱兴旺	                未知          
	wuli36004,         //五菱 未知1		                未知          
	wuli36005,   //五菱 五菱宏光	                2010、2013款          
	wuli36006,   //五菱 五菱之光	                未知                  
	wuli36007,   //五菱 宏光舒适/豪华型		        2010、2013款      
	wuli36008,   //五菱 荣光标准型			        2011-2012款       
	wuli36009,   //五菱	荣光基本型	   		        2011-2012款       
	wuli36010,   //五菱 五菱之光(加保险杠)	            2013款        
	wuli36011,   //五菱 PN货车				        2010款        
	wuli36012,   //五菱	五菱之光基本型		        2010款        
	wuli36013,   //五菱	五菱之光实用型		        2010款        
	wuli36014,   //五菱	宏光S				        2013-2014款   
	wuli36015,   //五菱 五菱之光		  	        2008款            
	wuli36016,   //五菱 五菱之光立业型		        2010款       
	wuli36017,   //五菱	五菱之光标准版		    2010款       
	wuli36018,   //五菱 PN货车(加保险杠)	        2010款       
	wuli36019,   //五菱 五菱之光实用型(加保险杠)	2010款
	//&&&&&&&&
	wuli36020,   //五菱 五菱荣光  2012款
	wuli36021,   //五菱 五菱宏光  2010款
	wuli36022,   //五菱 五菱之光  2010款
    wuli36023,   //五菱 五菱荣光  2014款
	//******************20140827************************//
	wuli36024,   //五菱	宏光			2010款  //中客

	//中兴**********36500-36999***********//
	zx36500=36500,     //中兴 无限V3		2008款       
	zx36501,           //中兴 昌铃		    2010款   
	zx36502,           //中兴 未知1        未知       
	zx36503,           //中兴 威虎TUV		2011、2013款 
	zx36504,           //中兴 威虎G3		2010-2013款  

	//讴歌**********37000-37499***********//
	acur37000=37000,   //讴歌 讴歌TL		2009-2012款     
	acur37001,         //讴歌 讴歌TSX		2009-2011款     
	acur37002,         //讴歌 未知        未知       
	acur37003,         //讴歌 RDX		2010-2013款 
	acur37004,         //讴歌 MDX		2007、2009款
	acur37005,         //讴歌 TSX		2009款      
	acur37006,         //讴歌 ZDX		2009、2012款

	//北汽**********37500-37999***********//
	beiq37500=37500,   //北汽 北汽制造            未知       
	beiq37501,         //北汽 北汽制造骑士S12	    2009款     
	beiq37502,         //北汽 北京汽车            未知       
	beiq37503,         //北汽 北京汽车E系列	    2012-2013款
	beiq37504,         //北汽 北汽威望		    2011、2013款
	beiq37505,         //北汽 威旺306		        2011、2013款
	beiq37506,         //北汽 未知               未知 //添加的小货***********
	//******************20140827************************//
	beiq37507,         //北汽 北汽威旺M20	    2013-2014款   //中客
	beiq37508,         //北汽 北汽制造 陆铃		2012款  //小货
	beiq37509,         //北汽 北汽威旺T205-D/北汽威旺T205	    2013款/2013款 //小货/中客
	beiq37510,         //北汽 北汽制造BJ 212	    2012款     
	beiq37511,         //北汽 未知               未知  
	beiq37512,         //北汽制造  路霸       2012款   //suv

	//大宇**********38000-38499***********//
	daew38000=38000,   //大宇 两厢凯越   未知  
	//******************20140827************************//
	daew38001,      //大宇 未知 未知

    //前黄牌添加
	daew38400=38400,    //大宇  未知  未知  //大客

	//吉奥**********38500-38999***********//
	gono38500=38500,   //吉奥 帅舰		        2009款          
	gono38501,         //吉奥 财运100		    2009、2012款 
	//*****************20140722****************//
	gono38502,         //吉奥  未知    未知

	//&&&&&&&&&&&
	gono38503,   //吉奥 帅舰	     2012款
	gono38504,   //吉奥 财运100	 2012款
	gono38505,   //吉奥 星旺CL	 2012款   //小客
	//******************20140827************************//
	gono38506,   //吉奥 星朗	     2013-2014款  //中客
	gono38507,   //吉奥 财运100	 未知         //中客
	gono38508,   //吉奥 星旺CL	 未知         //小货

	//华泰**********39000-39499***********//
	hawt39000=39000,   //华泰 圣达菲		        2008-2013款  
	hawt39001,         //华泰 圣达菲自动四驱	    2012款       
	hawt39002,         //华泰 圣达菲手动两驱       2012款   
	//20140820
	hawt39003,        //华泰  未知  未知


	//陆风**********39500-39999***********//
	ldwd39500=39500,   //陆风 陆风X6		    2006、2008、2011款  
	ldwd39501,	       //陆风 风华		    2007-2008款        
	ldwd39502,         //陆风 陆风X5		    2013款             
	ldwd39503,         //陆风 龙腾		    2006款             
	ldwd39504,         //陆风 龙腾		    2008款             
	//******************20140827************************//
	ldwd39505,         //陆风 X8	    2012，2014款   //中客    
	ldwd39506,         //陆风 风华       2007,2008款 
	ldwd39507,         //陆风 风尚       未知       //中客

	//瑞麒**********40000-40499***********//
	riic40000=40000,   //瑞麒 G3			2010-2012款      
	riic40001,         //瑞麒 G5			2010-2012款      
	riic40002,         //瑞麒 M1			2009-2011、2013款
	riic40003,         //瑞麒 M5         未知             
	riic40004,         //瑞麒 G3			2010款           
	riic40005,         //瑞麒 未知1      未知             
	riic40006,         //瑞麒 G5			2010款  
	riic40007,         //瑞麒 X1         2010-2012款 
	//******************20140827************************//
	riic40008,         //瑞麒 未知		未知 
	riic40009,         //瑞麒 G6			2011款 

	//曙光**********40500-40999***********//
	sg40500=40500,     //曙光 旗胜V3		2011款    1627
	sg40501,           //曙光 挑战者SUV	    2010款    1628
	//******************20140827************************//
	sg40502,           //曙光 大柴神	    2009款    //小货
	sg40503,           //曙光 挑战者	    2010款    //中客
	sg40504,           //曙光 未知	    未知
	sg40505,           //曙光 傲骏	    2009款    //小货
	sg40506,		   //曙光 旗胜F1	2010,2012款	  //中客
	sg40507,          //曙光（黄海） 大柴神   2009,2012款   //小货
	sg40508,         //曙光（黄海）   N1      2014款       //小货


	//双环**********41000-41499***********// 
	shhn41000=41000,   //双环 未知1       未知              
	shhn41001,         //双环 SCEO		 2006、2009、2011款
	shhn41002,         //双环 SCEO		 2005款            
	shhn41003,         //双环 来宝SRV	     2004款            
	shhn41004,         //双环 未知2       未知  

	//前黄牌添加
	shhn41400=41400,    //双环  未知    未知   //大货


	//双龙**********41500-41999***********//
	shlg41500=41500,   //双龙 爱腾		2006款        
	shlg41501,         //双龙 未知1       未知         
	shlg41502,         //双龙 主席		2002、2004款  
	shlg41503,         //双龙 主席		2012款        
	//******************20140827************************//
	shlg41504,         //双龙 路帝		2008款  //中客
	shlg41505,         //双龙 柯兰多		2014款   //中客
	shlg41506,         //双龙 爱腾		2014款  //suv
	shlg41507,         //双龙 雷斯特W		2014款  //suv

	//华普**********42000-42499***********//
	sma42000=42000,    //华普 海尚		2005款     
	sma42001,          //华普 海域		2004-2007款 
	sma42002,          //华普 海锋		2007款      
	sma42003,          //华普 海迅		2006-2007款 
	sma42004,          //华普 海炫        未知       
	sma42005,          //华普 海迅		2004款      
	sma42006,          //华普 海迅        2005款     
	sma42007,          //华普 海域		2004款     
	
	//众泰**********42500-42999***********//
	zoty42500=42500,   //众泰 众泰5008	2008、2010款    
	zoty42501,         //众泰 5008		2010款
	//&&&&&&&&&&&&&&
	zoty42502,         //众泰 Z300		2012-2014款  //小客
	//zoty42503,         //众泰 未知       未知
	//******************20140827************************//
	zoty42503,          //众泰 5008        2008,2010款     
	zoty42504,          //众泰 2008		   2008,2010款 
	zoty42505,         //众泰 未知       未知

	//长安**********43000-43499***********//
	chan43000=43000,   //长安 长安之星	    2009款  
	chan43001,         //长安 长安V5		    2013款  
	chan43002,         //长安 金牛星		    2011款  
	chan43003,         //长安 长安星光	    2007款  
	chan43004,         //长安 欧诺		    2012款  
	chan43005,   //长安 杰勋		    2007、2009款    
	chan43006,	 //长安 长安之星2	    2009款       
	chan43007,	 //长安 长安之星2	    2012款       
	chan43008,   //长安 奔奔mini	    2010-2012款  
	chan43009,   //长安 CS35		    2012、2014款 
	chan43010,   //长安 悦翔三厢	    2009-2012款  
	chan43011,   //长安 逸动		    2012-2014款  
	chan43012,   //长安 长安之星	    2013款       
	chan43013,   //长安 奥拓		    1999-2000款  
	chan43014,   //长安 雅科仕	    	2004-2014款  
	chan43015,   //长安 未知1	     	未知             
	chan43016,   //长安 悦翔V3		    2012款       
	chan43017,   //长安 奔奔i		    2006-2008款 
	chan43018,   //长安 悦翔两厢	    2010款      
	chan43019,   //长安 CX20		    2011、2014款
	chan43020,   //长安 未知1           未知     
	chan43021,   //长安 悦翔		    2012款      
	chan43022,   //长安 悦翔		    2009-2011款 
	chan43023,   //长安 奔奔LOVE	    2010款      
	chan43024,   //长安 长安星光4500	2012款      
	chan43025,   //长安 商用星卡        未知      
	chan43026,   //长安 逸动		    2012-2013款 
	chan43027,   //长安 CX20		    未知        
	chan43028,   //长安 商用CM8         未知     
	chan43029,   //长安 星光小卡	    2007款      
	chan43030,   //长安 奔奔i	    	2007款      
	chan43031,   //长安 CX30		    2012款      
	chan43032,   //长安 欧力威		    2013款  
	chan43033,   //长安 金牛星		    2011、2013款   
	chan43034,   //长安 奔奔Mini	        2012款         
	chan43035,   //长安 CX20            未知            
	chan43036,   //长安 星卡            未知 

	//&&&&&&&&&&&&
	chan43037,   //长安  未知    未知
	chan43038,   //长安  神骐    2012款   //小货
	chan43039,   //长安  悦翔V3  2012款   //小客
	chan43040,   //长安  长安V5  2013款   //中客
	chan43041,   //长安  欧力威  2014款  //中客
	//******************20140827************************//
	chan43042,   //长安  CX20		        2014款     //中客
	chan43043,   //长安  CS35		        2012、2014款   //中客
	chan43044,   //长安  悦翔	            2011款         
	chan43045,   //长安  奔奔MINI            2012款   //中客
	chan43046,   //长安  奔奔MINI            未知   //中客
	chan43047,   //长安  长安星卡            2013款   //小货
	chan43048,   //长安  悦翔V5              2012款  
	chan43049,   //长安  睿骋         2013-2014款
	chan43050, //长安 CX30 2010-2011款
	chan43051, //长安 志翔 2008款

	//道奇**********43500-43999***********//
	dodg43500=43500,   //道奇 酷博	      2008-2011款  
	dodg43501,         //道奇 未知1	      未知         
	dodg43502,         //道奇 酷威	      2009-2011款  
	dodg43503,         //道奇 酷威	      2013款       
	dodg43504,	       //道奇 凯领（进口）  2013款       
	dodg43505,         //道奇 酷威          未知        
	dodg43506,         //道奇 凯领		  2007款       


	//哈弗**********44000-44499***********//
	hava44000=44000,   //哈弗 H6		2011-2014款     
	hava44001,         //哈弗 H6		2013款          
	hava44002,         //哈弗 H6		2012款          
	hava44003,         //哈弗 M2		2012款          
	//******************20140827************************//
	hava44004,         //哈弗 H6		  2013、2014款 //中客

	//纳智捷**********44500-44999***********//
	luxg44500=44500,   //纳智捷 大7SUV	2011-2012款 
	luxg44501,         //纳智捷 5Sedan	2013-2014款 
	luxg44502,         //纳智捷 U7TURBO	2010款      
	luxg44503,         //纳智捷 大7MPV	2013款

	//**************20140722*****************//
	luxg44504,         //纳智捷 ***  ***
	//&&&&&&&&&&&&&&&&
	luxg44505,         //纳智捷 大7SUV锋芒限量版	2012款  //中客
	luxg44506,         //纳智捷 U6 TURBO  2014款

	//精灵**********45000-45499***********//
	smar45000=45000,   //精灵 fortwo	    2009-2014款 
	smar45001,         //精灵 fortwo		2009-2011款 
	smar45002,         //精灵 fortwo		2012-2013款 

	//福田**********45500-45999***********//
	foto45500=45500,   //福田 风景	                2011-2012款 
	foto45501,         //福田 风景	                2009款      
	foto45502,         //福田 蒙派克	                2010-2013款 
	foto45503,         //福田 风景	                2012款      
	foto45504,         //福田 蒙派克E财富快车标准版	2010-2012款     
	foto45505,         //福田 萨普V系列               未知        
	foto45506,   //福田 未知1                   未知      
	foto45507,   //福田 时代领航1/领航2         未知       
	foto45508,   //福田 时代驭菱V1/VQ1          未知       
	foto45509,   //福田 奥铃                    未知      
	foto45510,   //福田 时代轻卡领航            未知       
	foto45511,   //福田 时代小卡之星2           未知       
	foto45512,   //福田 萨普Z系列				2011款       
	foto45513,   //福田 欧曼                    未知      
	foto45514,   //福田 蒙派克E商务标准型		2012款      
	foto45515,   //福田 时代                    未知      
	foto45516,   //福田 欧马可                  未知      
	foto45517,   //福田 时代驭菱V5/VQ5          未知
	foto45518,   //福田 未知                    未知1      //添加的小货************
	foto45519,   //福田 未知                    未知2      //添加的小货************
	foto45520,   //福田 未知                    未知3      //添加的小货************
	//*******************20140825******************//
	foto45521,   //福田 迷笛                    2014款   //中客
	foto45522,	 //福田 欧马可3					未知	 //大货
	foto45523,   //福田 风景快客/海狮             2006款  //中客（面包）

	//前黄牌添加
	foto45900=45900,   //福田 未知   未知1  //大客
	foto45901,         //福田 未知   未知2  //大货
	foto45902,         //福田 未知   未知3  //中客
	foto45903,        //福田  时代
	foto45904,        //福田  Auman
	foto45905,        //福田  福田五星

	//中顺**********46000-46499***********//
	pols46000=46000,   //中顺 世纪1	未知	 1721
	pols46001,         //中顺 世纪2	未知    1722
	pols46002,         //中顺 世纪3	未知    1723
	pols46003,         //中顺 世纪    未知    1724


	//劳斯莱斯**********46500-46999***********//
	rsrc46500=46500,   //劳斯莱斯 古斯特/魅影/幻影  未知 

	//长丰**********47000-47499***********//
	chfg47000=47000,   //长丰 猎豹黑金刚      未知  
	chfg47001,         //长丰 三菱帕杰罗      未知  
	chfg47002,         //长丰 猎豹CS6		  2007款  
	chfg47003,         //长丰 扬子飞系皮卡    未知  
	chfg47004,         //长丰 猎豹飞腾经典版  未知   
	chfg47005,         //长丰 猎豹飞腾时尚版  未知 
	//*******************20140825******************//
	chfg47006,         //长丰 飞扬  2010款  //小货

	//广汽**********47500-47999***********//
	guaq47500=47500,   //广汽 传祺	2012-2014款 

	//金旅**********48000-48499***********//
	gold48000=48000,   //金旅 考斯特	2010款      
	gold48001,         //金旅 海狮	2010款      
	//**********20140722***********//
	gold48002,         //金旅 *** ***

	//前黄牌添加
	gold48400=48400,   //金旅  未知    未知   //大客
	//&&&&&&&
	gold48401,         //金旅  未知    未知   //中客

	//双龙**********48500-48999***********//
	ssan48500=48500,   //双龙 陆帝	2007-2008款 
	ssan48501,         //双龙 未知1	未知        
	ssan48502,         //双龙 主席	2002-2004款 

	//林肯**********49000-49499***********//
	linc49000=49000,   //林肯 领航员	    2004-2005款   
	linc49001,         //林肯 领航员	    2010款        
	linc49002,        //林肯 MKX		2011款

	//五征**********49500-49999***********//
	waw49500=49500,  //五征 未知  未知1   //添加的小货**********
	waw49501,        //五征 未知  未知2   //添加的小货**********
	waw49502,        //五征 未知  未知3   //添加的小货**********

	//前黄牌添加20140820
	waw49900=49900,   //五征 未知 未知

	//解放**********50000-50499***********//
	jief50000=50000,  //解放 未知 未知   //添加的小货***********

	//春兰**********50500-50999***********//
	chnl50500=50500,  //春兰 未知 未知   //添加的小货************

	//日野**********51000-51499***********//
	hino51000=51000,  //日野 未知 未知   //添加的小货***********

	//凯马**********51500-51999***********//
	kama51500=51500,  //凯马 未知 未知1   //添加的小货************
	kama51501,       //凯马 未知 未知2   //添加的小货************

	//前黄牌添加
	kama51900=51900,       //凯马  未知 未知1 //大货
	
/***********************前黄牌添加****LiuDan***********************/

	//中国重汽*******52000-52499**********//
	cnht52000=52000,    //中国重汽 未知 未知1   //大货
	cnht52001,         //中国重汽 HOWO
    cnht52002,         //中国重汽 HOWO 3xx
	cnht52003,         //中国重汽 斯太尔
	cnht52004,         //中国重汽 金王子
	cnht52005,         //中国重汽 黄河少帅
	cnht52006,         //中国重汽              //大客

	//东风柳州********52500-52999*********//
	dflz52500=52500,    //东风柳州  未知 未知1   //大客
	dflz52501,          //东风柳州  未知 未知2   //大货

	//北奔重卡********53000-53499*********//
	bebt53000=53000,    //北奔重卡  未知  未知   //大货
	//20150608
	bebt53001,         //北奔重卡 Actros

	//陕汽重卡********53500-53999*********//
	shcn53500=53500,    //陕汽重卡  未知  未知    //大货
	shcn53501,        //陕汽重卡  F2000/F3000
	shcn53502,        //陕汽重卡  新M3000
	shcn53503,        //陕汽重卡  奥龙 
	shcn53504,        //陕汽重卡  德龙

	//华菱********54000-54499*********//
	camc54000=54000,    //华菱  未知  未知  //大货

	//跃进********54500-54999*********//
	yuji54500=54500,    //跃进  未知   未知   //大货

	//红岩********55000-55499*********//
	hoya55000=55000,    //红岩   未知   未知   //大货

	//王牌********55500-55999*********//
	cdw55500=55500,     //王牌   未知   未知   //大货
	//&&&&&&&&&
	cdw55501,           //王牌   未知   未知

	//曼********56000-56499*********//
	man56000=56000,     //曼  未知    未知   //大客
	//&&&&&&&&&
	man56001,          //曼  未知   未知    //大货

	//日产柴********56500-56999*********//
	ud56500=56500,     //日产柴 未知   未知   //大货

	//徐工********57000-57499*********//
	xcmg57000=57000,    //徐工  未知   未知   //大货

	//华德********57500-57999*********//
	huad57500=57500,    //华德  未知    未知1   //大客 

	//&&&&&&&
	huad57501,    //华德  未知    未知2   //中客 

	//海格********58000-58499*********//
	hige58000=58000,    //海格  未知    未知   //大客

	//&&&&&&&
    hige58001,          //海格  未知    未知   //中客
	hige58002,          //海格  未知    未知   //小货

	//宇通********58500-58999*********//
	yuto58500=58500,    //宇通  未知   未知   //大客

	//青年********59000-59499*********//
	yoma59000=59000,    //青年  未知  未知   //大客

	//江淮汽车********59500-59999*********//
	jahu59500=59500,    //江淮汽车  未知    未知  //大客

	//上海申通********60000-60499*********//
	sulo60000=60000,     //上海申通  未知     未知  //大客

	//中通********60500-60999*********//
	zhto60500=60500,     //中通  未知    未知  //大客

	//亚星客车********61000-61499*********//
	yaxi61000=61000,    //亚星客车  未知    未知   //大客

	//金龙客车********61500-61999*********//
    jinl61500=61500,    //金龙客车  未知    未知   //大客

	//20140820
	jinl61501,          //金龙  未知  未知  //中客
	jinl61502,         //金龙 金威  2014  //中客
	
	//三一********62000-62499*********//                      
	sany62000=62000,    //三一  未知    未知   //大货
	

	//南骏********62500-62999*********//
	njun62500=62500,    //南骏  未知    未知   //大货          
	njun62501,          //南骏  未知    未知   //大客
	//&&&&&&&&
	njun62502,          //南骏  未知   未知   

	//十通********63000-63499*********//
	shto63000=63000,   //十通  未知    未知   //大货

	//斯堪尼亚********63500-63999*********//
	scan63500=63500,   //斯堪尼亚  未知    未知   //大货

	//安凯客车********64000-64499*********//                  
	akai64000=64000,  //安凯客车  未知   未知   //大客

	//牡丹花都********64500-64999*********//                 
	mdhd64500=64500,  //牡丹花都  未知   未知   //大客

	//蜀都公交********65000-65499*********//                   
	shud65000=65000,  //蜀都公交  未知   未知   //大客

	//未知大客********65500-65999*********//                   
	busx65500=65500,   //公交车  ***   ***    //大客


   //&&&&&&&&
	//春兰********66000-66499*********// 
	chnl66000=66000,    //春兰  未知   未知

	//日野********66500-66999*********// 
	hino66500=66500,   //日野  未知   未知

	//飞驰********67000-67499*********// 
	fech67000=67000,   //飞驰  未知   未知

	//联合********67500-67999*********// 
	cc67500=67500,    //联合   未知   未知

	//20140820
	//神野********68000-68499*********//
	shy68000=68000,   //神野  未知 未知

	//唐骏*******68500-68999*********//
	tkng68500=68500,   //唐骏  未知  未知

	//轻骑微卡*******69000-69499*********//
	qngq69000=69000,  //轻骑微车  未知  未知

	//黄海客车*******69500-69999*********//
	hugh69500=69500,  //黄海客车  未知  未知

	//瑞沃*******70000-70499*********//
	rowo70000=70000,  //瑞沃  未知 未知
	rowo70001,      //瑞沃  时代

	//川汽野马*****70500-70999*********//
	chqy70500=70500,  //野马 F10  2011-2012款  //中客（suv）
	//20141204
	chqy70501,        //野马 F12  2012款
	chqy70502,        //野马 F12  2014款

	//新凯********71000-71499**********//
	xk71000=71000,   //新凯  未知  未知      //小货

	//20141204
	//永源********71500-71999**********//
	jonw71500=71500,  //永源  A380   2013款  //suv
	jonw71501,        //永源  猎鹰    2013款  //suv
	jonw71502,        //永源  五星    2012款  //mbc

	//20150114
	//时风
	sfc72000=72000,     //时风 风顺

	//楚风
	cf72500=72500,     //楚风 未知 未知  //大货

	//三环
	thrc73000=73000,    //三环昊龙  未知  未知   //小货
	//20150608
	thrc73001,          //三环 三环征龙

	//百路佳
	blk73500=73500,    //百路佳 未知 未知
	//尼奥普兰
	bfno74000=74000,   //北方尼奥普兰 未知 未知

	OTHERS=200000,              //其他
};

void CBrandSusection::GetCarLabelAndChildSub( UINT32 &uCarBrand,UINT32 &uDetailCarBrand )
{
	//200以下的数字是老式的车标结构
	if(uCarBrand < 200)
		return ;
	//OTHERS=50000,              //其他
	if(uCarBrand == 200000)
		return ;
	//200或以上是新的以子类车标
	UINT32 uCarBasePoint = GetCorrectBasePoint(uCarBrand);
	if(uCarBasePoint == 0)
	{
		return ;
	}
	uDetailCarBrand = uCarBrand % uCarBasePoint;
	uCarBrand = uCarBasePoint;
}

UINT32 CBrandSusection::GetCorrectBasePoint( UINT32 &uCarBrand )
{
	UINT32 uCarBasePoint = 0;
	//奥迪**********200-499***********//
	if((uCarBasePoint = GetCarBasePoint(200,499,uCarBrand)) > 0) return uCarBasePoint;
	//大众**********500-999***********//
	if((uCarBasePoint = GetCarBasePoint(500,999,uCarBrand)) > 0) return uCarBasePoint;
	//宝马**********1000-1499***********// 
	if((uCarBasePoint = GetCarBasePoint(1000,1499,uCarBrand)) > 0) return uCarBasePoint;
	//本田**********1500-1999***********//
	if((uCarBasePoint = GetCarBasePoint(1500,1999,uCarBrand)) > 0) return uCarBasePoint;
	//别克**********2000-2499***********//
	if((uCarBasePoint = GetCarBasePoint(2000,2499,uCarBrand)) > 0) return uCarBasePoint;
	//奔驰**********2500-2999***********//
	if((uCarBasePoint = GetCarBasePoint(2500,2999,uCarBrand)) > 0) return uCarBasePoint;
	//现代**********3000-3499***********//
	if((uCarBasePoint = GetCarBasePoint(3000,3499,uCarBrand)) > 0) return uCarBasePoint;
	//福特**********3500-3999***********//
	if((uCarBasePoint = GetCarBasePoint(3500,3999,uCarBrand)) > 0) return uCarBasePoint;
	//起亚**********4000-4499***********//
	if((uCarBasePoint = GetCarBasePoint(4000,4499,uCarBrand)) > 0) return uCarBasePoint;
	//马自达**********4500-4999***********//
	if((uCarBasePoint = GetCarBasePoint(4500,4999,uCarBrand)) > 0) return uCarBasePoint;
	//日产**********5000-5499***********//
	if((uCarBasePoint = GetCarBasePoint(5000,5499,uCarBrand)) > 0) return uCarBasePoint;
	//标志**********5500-5999***********//
	if((uCarBasePoint = GetCarBasePoint(5500,5999,uCarBrand)) > 0) return uCarBasePoint;

	//丰田**********6000-6499***********//
	if((uCarBasePoint = GetCarBasePoint(6000,6499,uCarBrand)) > 0) return uCarBasePoint;
	//雪佛兰**********6500-6999***********//
	if((uCarBasePoint = GetCarBasePoint(6500,6999,uCarBrand)) > 0) return uCarBasePoint;	
	//雪铁龙**********7000-7499***********//
	if((uCarBasePoint = GetCarBasePoint(7000,7499,uCarBrand)) > 0) return uCarBasePoint;	
	//斯柯达**********7500-7999***********//
	if((uCarBasePoint = GetCarBasePoint(7500,7999,uCarBrand)) > 0) return uCarBasePoint;	
	//沃尔沃**********8000-8499***********//
	if((uCarBasePoint = GetCarBasePoint(8000,8499,uCarBrand)) > 0) return uCarBasePoint;	
	//雷克萨斯**********8500-8999***********//
	if((uCarBasePoint = GetCarBasePoint(8500,8999,uCarBrand)) > 0) return uCarBasePoint;
	//雷诺**********9000-9499***********//
	if((uCarBasePoint = GetCarBasePoint(9000,9499,uCarBrand)) > 0) return uCarBasePoint;	
	//三菱**********9500-9999***********//
	if((uCarBasePoint = GetCarBasePoint(9500,9999,uCarBrand)) > 0) return uCarBasePoint;	
	//比亚迪**********10000-10499***********//
	if((uCarBasePoint = GetCarBasePoint(10000,10499,uCarBrand)) > 0) return uCarBasePoint;	
	//路虎**********10500-10999***********//
	if((uCarBasePoint = GetCarBasePoint(10500,10999,uCarBrand)) > 0) return uCarBasePoint;
	//凯迪拉克**********11000-11499***********//
	if((uCarBasePoint = GetCarBasePoint(11000,11499,uCarBrand)) > 0) return uCarBasePoint;	
	//斯巴鲁**********11500-11999***********//
	if((uCarBasePoint = GetCarBasePoint(11500,11999,uCarBrand)) > 0) return uCarBasePoint;	 
	//克莱斯勒**********12000-12499***********//
	if((uCarBasePoint = GetCarBasePoint(12000,12499,uCarBrand)) > 0) return uCarBasePoint;	
	//皇冠**********12500-12999***********//
	if((uCarBasePoint = GetCarBasePoint(12500,12999,uCarBrand)) > 0) return uCarBasePoint;	
	//菲亚特**********13000-13499***********//
	if((uCarBasePoint = GetCarBasePoint(13000,13499,uCarBrand)) > 0) return uCarBasePoint;

	//英菲尼迪**********13500-13999***********//
	if((uCarBasePoint = GetCarBasePoint(13500,13999,uCarBrand)) > 0) return uCarBasePoint;
	//迷你**********14000-14499***********//
	if((uCarBasePoint = GetCarBasePoint(14000,14499,uCarBrand)) > 0) return uCarBasePoint;	
	//捷豹**********14500-14999***********//
	if((uCarBasePoint = GetCarBasePoint(14500,14999,uCarBrand)) > 0) return uCarBasePoint;	
	//宾利**********15500-15999***********//
	if((uCarBasePoint = GetCarBasePoint(15500,15999,uCarBrand)) > 0) return uCarBasePoint;	
	//吉普**********16000-16499***********//
	if((uCarBasePoint = GetCarBasePoint(16000,16499,uCarBrand)) > 0) return uCarBasePoint;	               
	//莲花**********16500-16999***********//
	if((uCarBasePoint = GetCarBasePoint(16500,16999,uCarBrand)) > 0) return uCarBasePoint;	
	//欧宝**********17000-17499***********//
	if((uCarBasePoint = GetCarBasePoint(17000,17499,uCarBrand)) > 0) return uCarBasePoint;	
	//玛莎拉蒂**********17500-17999***********//
	if((uCarBasePoint = GetCarBasePoint(17500,17999,uCarBrand)) > 0) return uCarBasePoint;	
	//保时捷**********18000-18499***********// 
	if((uCarBasePoint = GetCarBasePoint(18000,18499,uCarBrand)) > 0) return uCarBasePoint;	
	//荣威**********18500-18999***********//
	if((uCarBasePoint = GetCarBasePoint(18500,18999,uCarBrand)) > 0) return uCarBasePoint;	
	//铃木**********19000-19499***********//
	if((uCarBasePoint = GetCarBasePoint(19000,19499,uCarBrand)) > 0) return uCarBasePoint;	
	//名爵**********19500-19999***********//
	if((uCarBasePoint = GetCarBasePoint(19500,19999,uCarBrand)) > 0) return uCarBasePoint;	
	//奇瑞 **********20000-20499***********//
	if((uCarBasePoint = GetCarBasePoint(20000,20499,uCarBrand)) > 0) return uCarBasePoint;	
	//帝豪**********20500-20999***********// 
	if((uCarBasePoint = GetCarBasePoint(20500,20999,uCarBrand)) > 0) return uCarBasePoint;	
	//哈飞**********21000-21499***********//
	if((uCarBasePoint = GetCarBasePoint(21000,21499,uCarBrand)) > 0) return uCarBasePoint;	
	//东南**********21500-21999***********//
	if((uCarBasePoint = GetCarBasePoint(21500,21999,uCarBrand)) > 0) return uCarBasePoint;	
	//宝骏**********22000-22499***********//        
	if((uCarBasePoint = GetCarBasePoint(22000,22499,uCarBrand)) > 0) return uCarBasePoint;	
	//奔腾**********22500-22999***********//
	if((uCarBasePoint = GetCarBasePoint(22500,22999,uCarBrand)) > 0) return uCarBasePoint;	
	//昌河**********23000-23499***********//
	if((uCarBasePoint = GetCarBasePoint(23000,23499,uCarBrand)) > 0) return uCarBasePoint;	
	//大发**********23500-23999***********//
	if((uCarBasePoint = GetCarBasePoint(23500,23999,uCarBrand)) > 0) return uCarBasePoint;	
	//东风**********24000-24499***********//
	if((uCarBasePoint = GetCarBasePoint(24000,24499,uCarBrand)) > 0) return uCarBasePoint;	
	//福迪**********24500-24999***********//
	if((uCarBasePoint = GetCarBasePoint(24500,24999,uCarBrand)) > 0) return uCarBasePoint;

	//传祺**********25500-25999***********//
	if((uCarBasePoint = GetCarBasePoint(25500,25999,uCarBrand)) > 0) return uCarBasePoint;
	//海马**********26000-26499***********//
	if((uCarBasePoint = GetCarBasePoint(26000,26499,uCarBrand)) > 0) return uCarBasePoint;	      
	//中华**********26500-26999***********//
	if((uCarBasePoint = GetCarBasePoint(26500,26999,uCarBrand)) > 0) return uCarBasePoint;	
	//汇众**********27000-27499***********//
	if((uCarBasePoint = GetCarBasePoint(27000,27499,uCarBrand)) > 0) return uCarBasePoint;	
	//吉利**********27500-27999***********//
	if((uCarBasePoint = GetCarBasePoint(27500,27999,uCarBrand)) > 0) return uCarBasePoint;
	//江淮**********28000-28499***********//
	if((uCarBasePoint = GetCarBasePoint(28000,28499,uCarBrand)) > 0) return uCarBasePoint;	
	//江铃**********28500-28999***********//
	if((uCarBasePoint = GetCarBasePoint(28500,28999,uCarBrand)) > 0) return uCarBasePoint;	
	//金杯**********29000-29499***********//
	if((uCarBasePoint = GetCarBasePoint(29000,29499,uCarBrand)) > 0) return uCarBasePoint;	         
	//开瑞**********29500-29999***********//
	if((uCarBasePoint = GetCarBasePoint(29500,29999,uCarBrand)) > 0) return uCarBasePoint;	
	//理念**********30000-30499***********//
	if((uCarBasePoint = GetCarBasePoint(30000,30499,uCarBrand)) > 0) return uCarBasePoint;	
	//力帆**********30500-30999***********//
	if((uCarBasePoint = GetCarBasePoint(30500,30999,uCarBrand)) > 0) return uCarBasePoint;		
	//南京**********31000-31499***********//
	if((uCarBasePoint = GetCarBasePoint(31000,31499,uCarBrand)) > 0) return uCarBasePoint;	
	//启辰**********31500-31999***********//
	if((uCarBasePoint = GetCarBasePoint(31500,31999,uCarBrand)) > 0) return uCarBasePoint;	
	//威麟**********32000-32499***********//
	if((uCarBasePoint = GetCarBasePoint(32000,32499,uCarBrand)) > 0) return uCarBasePoint;	
	//五十铃**********32500-32999***********//
	if((uCarBasePoint = GetCarBasePoint(32500,32999,uCarBrand)) > 0) return uCarBasePoint;	
	//夏利**********33000-33499***********//
	if((uCarBasePoint = GetCarBasePoint(33000,33499,uCarBrand)) > 0) return uCarBasePoint;	
	//羊城**********33500-33999***********//
	if((uCarBasePoint = GetCarBasePoint(33500,33999,uCarBrand)) > 0) return uCarBasePoint;	
	//一汽**********34000-34499***********//
	if((uCarBasePoint = GetCarBasePoint(34000,34499,uCarBrand)) > 0) return uCarBasePoint;	
	//依维柯**********34500-34999***********//
	if((uCarBasePoint = GetCarBasePoint(34500,34999,uCarBrand)) > 0) return uCarBasePoint;	
	//跃进**********35000-35499***********//
	if((uCarBasePoint = GetCarBasePoint(35000,35499,uCarBrand)) > 0) return uCarBasePoint;	
	//长城**********35500-35999***********//
	if((uCarBasePoint = GetCarBasePoint(35500,35999,uCarBrand)) > 0) return uCarBasePoint;	
	//五菱**********36000-36499***********//
	if((uCarBasePoint = GetCarBasePoint(36000,36499,uCarBrand)) > 0) return uCarBasePoint;	
	//中兴**********36500-36999***********//
	if((uCarBasePoint = GetCarBasePoint(36500,36999,uCarBrand)) > 0) return uCarBasePoint;	
	//讴歌**********37000-37499***********//
	if((uCarBasePoint = GetCarBasePoint(37000,37499,uCarBrand)) > 0) return uCarBasePoint;	
	//北汽**********37500-37999***********//
	if((uCarBasePoint = GetCarBasePoint(37500,37999,uCarBrand)) > 0) return uCarBasePoint;	
	//大宇**********38000-38499***********//
	if((uCarBasePoint = GetCarBasePoint(38000,38499,uCarBrand)) > 0) return uCarBasePoint;
	//吉奥**********38500-38999***********//
	if((uCarBasePoint = GetCarBasePoint(38500,38999,uCarBrand)) > 0) return uCarBasePoint;	
	//华泰**********39000-39499***********//
	if((uCarBasePoint = GetCarBasePoint(39000,39499,uCarBrand)) > 0) return uCarBasePoint;	
	//陆风**********39500-39999***********//
	if((uCarBasePoint = GetCarBasePoint(39500,39999,uCarBrand)) > 0) return uCarBasePoint;

	//瑞麒**********40000-40499***********//
	if((uCarBasePoint = GetCarBasePoint(40000,40499,uCarBrand)) > 0) return uCarBasePoint;
	//曙光**********40500-40999***********//
	if((uCarBasePoint = GetCarBasePoint(40500,40999,uCarBrand)) > 0) return uCarBasePoint;
	//双环**********41000-41499***********// 
	if((uCarBasePoint = GetCarBasePoint(41000,41499,uCarBrand)) > 0) return uCarBasePoint;
	//双龙**********41500-41999***********//       
	if((uCarBasePoint = GetCarBasePoint(41500,41999,uCarBrand)) > 0) return uCarBasePoint;
	//华普**********42000-42499***********//
	if((uCarBasePoint = GetCarBasePoint(42000,42499,uCarBrand)) > 0) return uCarBasePoint;
	//众泰**********42500-42999***********//         
	if((uCarBasePoint = GetCarBasePoint(42500,42999,uCarBrand)) > 0) return uCarBasePoint;
	//长安**********43000-43499***********//
	if((uCarBasePoint = GetCarBasePoint(43000,43499,uCarBrand)) > 0) return uCarBasePoint;
	//道奇**********43500-43999***********//
	if((uCarBasePoint = GetCarBasePoint(43500,43999,uCarBrand)) > 0) return uCarBasePoint;   
	//哈弗**********44000-44499***********//
	if((uCarBasePoint = GetCarBasePoint(44000,44499,uCarBrand)) > 0) return uCarBasePoint;
	//纳智捷**********44500-44999***********//
	if((uCarBasePoint = GetCarBasePoint(44500,44999,uCarBrand)) > 0) return uCarBasePoint;
	//精灵**********45000-45499***********//
	if((uCarBasePoint = GetCarBasePoint(45000,45499,uCarBrand)) > 0) return uCarBasePoint;
	//福田**********45500-45999***********//
	if((uCarBasePoint = GetCarBasePoint(45500,45999,uCarBrand)) > 0) return uCarBasePoint;  
	//中顺**********46000-46499***********//
	if((uCarBasePoint = GetCarBasePoint(46000,46499,uCarBrand)) > 0) return uCarBasePoint;
	//劳斯莱斯**********46500-46999***********//
	if((uCarBasePoint = GetCarBasePoint(46500,46999,uCarBrand)) > 0) return uCarBasePoint;
	//长丰**********47000-47499***********//
	if((uCarBasePoint = GetCarBasePoint(47000,47499,uCarBrand)) > 0) return uCarBasePoint;
	//广汽**********47500-47999***********//
	if((uCarBasePoint = GetCarBasePoint(47500,47999,uCarBrand)) > 0) return uCarBasePoint;
	//金旅**********48000-48499***********//
	if((uCarBasePoint = GetCarBasePoint(48000,48499,uCarBrand)) > 0) return uCarBasePoint;
	//双龙**********48500-48999***********//
	if((uCarBasePoint = GetCarBasePoint(48500,48999,uCarBrand)) > 0) return uCarBasePoint;
	//林肯**********49000-49499***********//
	if((uCarBasePoint = GetCarBasePoint(49000,49499,uCarBrand)) > 0) return uCarBasePoint;
	//五征**********49500-49999***********//
	if((uCarBasePoint = GetCarBasePoint(49500,49999,uCarBrand)) > 0) return uCarBasePoint;
	//解放**********50000-50499***********//
	if((uCarBasePoint = GetCarBasePoint(50000,50499,uCarBrand)) > 0) return uCarBasePoint;
	//春兰**********50500-50999***********//
	if((uCarBasePoint = GetCarBasePoint(50500,50999,uCarBrand)) > 0) return uCarBasePoint;
	//日野**********51000-51499***********//
	if((uCarBasePoint = GetCarBasePoint(51000,51499,uCarBrand)) > 0) return uCarBasePoint;
	//凯马**********51500-51999***********//
	if((uCarBasePoint = GetCarBasePoint(51500,51999,uCarBrand)) > 0) return uCarBasePoint;	

	//黄牌车
	//中国重汽*******52000-52499**********//
	if((uCarBasePoint = GetCarBasePoint(52000,52499,uCarBrand)) > 0) return uCarBasePoint;	
	//东风柳州********52500-52999*********//
	if((uCarBasePoint = GetCarBasePoint(52500,52999,uCarBrand)) > 0) return uCarBasePoint;	
	//北奔重卡********53000-53499*********//
	if((uCarBasePoint = GetCarBasePoint(53000,53499,uCarBrand)) > 0) return uCarBasePoint;	
	//陕汽重卡********53500-53999*********//
	if((uCarBasePoint = GetCarBasePoint(53500,53999,uCarBrand)) > 0) return uCarBasePoint;	
	//华菱********54000-54499*********//
	if((uCarBasePoint = GetCarBasePoint(54000,54499,uCarBrand)) > 0) return uCarBasePoint;	
	//跃进********54500-54999*********//
	if((uCarBasePoint = GetCarBasePoint(54500,54999,uCarBrand)) > 0) return uCarBasePoint;	
	//红岩********55000-55499*********//
	if((uCarBasePoint = GetCarBasePoint(55000,55499,uCarBrand)) > 0) return uCarBasePoint;	
	//王牌********55500-55999*********//
	if((uCarBasePoint = GetCarBasePoint(55500,55999,uCarBrand)) > 0) return uCarBasePoint;	
	//曼********56000-56499*********//
	if((uCarBasePoint = GetCarBasePoint(56000,56499,uCarBrand)) > 0) return uCarBasePoint;	
	//日产柴********56500-56999*********//
	if((uCarBasePoint = GetCarBasePoint(56500,56999,uCarBrand)) > 0) return uCarBasePoint;	
	//徐工********57000-57499*********//
	if((uCarBasePoint = GetCarBasePoint(57000,57499,uCarBrand)) > 0) return uCarBasePoint;	
	//华德********57500-57999*********//
	if((uCarBasePoint = GetCarBasePoint(57500,57999,uCarBrand)) > 0) return uCarBasePoint;	
	//海格********58000-58499*********//
	if((uCarBasePoint = GetCarBasePoint(58000,58499,uCarBrand)) > 0) return uCarBasePoint;	
	//宇通********58500-58999*********//
	if((uCarBasePoint = GetCarBasePoint(58500,58999,uCarBrand)) > 0) return uCarBasePoint;	
	//青年********59000-59499*********//
	if((uCarBasePoint = GetCarBasePoint(59000,59499,uCarBrand)) > 0) return uCarBasePoint;	
	//江淮汽车********59500-59999*********//
	if((uCarBasePoint = GetCarBasePoint(59500,59999,uCarBrand)) > 0) return uCarBasePoint;	
	//上海申通********60000-60499*********//
	if((uCarBasePoint = GetCarBasePoint(60000,60499,uCarBrand)) > 0) return uCarBasePoint;	
	//中通********60500-60999*********//
	if((uCarBasePoint = GetCarBasePoint(60500,60999,uCarBrand)) > 0) return uCarBasePoint;	
	//亚星客车********61000-61499*********//
	if((uCarBasePoint = GetCarBasePoint(61000,61499,uCarBrand)) > 0) return uCarBasePoint;	
	//金龙客车********61500-61999*********//
	if((uCarBasePoint = GetCarBasePoint(61500,61999,uCarBrand)) > 0) return uCarBasePoint;	
	//三一********62000-62499*********//                        //修改：将骏马改成三一
	if((uCarBasePoint = GetCarBasePoint(62000,62499,uCarBrand)) > 0) return uCarBasePoint;	
	//南骏********62500-62999*********//
	if((uCarBasePoint = GetCarBasePoint(62500,62999,uCarBrand)) > 0) return uCarBasePoint;	
	//十通********63000-63499*********//
	if((uCarBasePoint = GetCarBasePoint(63000,63499,uCarBrand)) > 0) return uCarBasePoint;	
	//斯堪尼亚********63500-63999*********//
	if((uCarBasePoint = GetCarBasePoint(63500,63999,uCarBrand)) > 0) return uCarBasePoint;	
	//安凯客车********64000-64499*********//                   //修改
	if((uCarBasePoint = GetCarBasePoint(64000,64499,uCarBrand)) > 0) return uCarBasePoint;	
	//牡丹花都********64500-64999*********//                   //修改
	if((uCarBasePoint = GetCarBasePoint(64500,64999,uCarBrand)) > 0) return uCarBasePoint;	
	//蜀都公交********65000-65499*********//                   //修改
	if((uCarBasePoint = GetCarBasePoint(65000,65499,uCarBrand)) > 0) return uCarBasePoint;	
	//未知大客********65500-65999*********//                    //修改
	if((uCarBasePoint = GetCarBasePoint(65500,65999,uCarBrand)) > 0) return uCarBasePoint;	
	//春兰********66000-66499*********// 
	if((uCarBasePoint = GetCarBasePoint(66000,66499,uCarBrand)) > 0) return uCarBasePoint;	
	//日野********66500-66999*********// 
	if((uCarBasePoint = GetCarBasePoint(66500,66999,uCarBrand)) > 0) return uCarBasePoint;	
	//飞驰********67000-67499*********// 
	if((uCarBasePoint = GetCarBasePoint(67000,67499,uCarBrand)) > 0) return uCarBasePoint;	
	//联合********67500-67999*********// 
	if((uCarBasePoint = GetCarBasePoint(67500,67999,uCarBrand)) > 0) return uCarBasePoint;	
	//神野********68000-68499*********//
	if((uCarBasePoint = GetCarBasePoint(68000,68499,uCarBrand)) > 0) return uCarBasePoint;	
	//唐骏*******68500-68999*********//
	if((uCarBasePoint = GetCarBasePoint(68500,68999,uCarBrand)) > 0) return uCarBasePoint;	
	//轻骑微卡*******69000-69499*********//
	if((uCarBasePoint = GetCarBasePoint(69000,69499,uCarBrand)) > 0) return uCarBasePoint;	
	//黄海客车*******69500-69999*********//
	if((uCarBasePoint = GetCarBasePoint(69500,69999,uCarBrand)) > 0) return uCarBasePoint;	
	//瑞沃*******70000-70499*********//
	if((uCarBasePoint = GetCarBasePoint(70000,70499,uCarBrand)) > 0) return uCarBasePoint;	
	//川汽野马*****70500-70999*********//
	if((uCarBasePoint = GetCarBasePoint(70500,70999,uCarBrand)) > 0) return uCarBasePoint;	
	//新凯********71000-71499**********//
	if((uCarBasePoint = GetCarBasePoint(71000,71499,uCarBrand)) > 0) return uCarBasePoint;	
	//永源********71500-71999**********//
	if((uCarBasePoint = GetCarBasePoint(71500,71999,uCarBrand)) > 0) return uCarBasePoint;	
	//时风********72000-72499**********//
	if((uCarBasePoint = GetCarBasePoint(72000,72499,uCarBrand)) > 0) return uCarBasePoint;	
	//楚风********72500-72999**********//
	if((uCarBasePoint = GetCarBasePoint(72500,72999,uCarBrand)) > 0) return uCarBasePoint;	
	//三环********73000-73499**********//
	if((uCarBasePoint = GetCarBasePoint(73000,73499,uCarBrand)) > 0) return uCarBasePoint;	
	//百路佳********73500-73999**********//
	if((uCarBasePoint = GetCarBasePoint(73500,73999,uCarBrand)) > 0) return uCarBasePoint;	

	return uCarBasePoint;
}

UINT32 CBrandSusection::GetCarBasePoint( UINT32 uMin,UINT32 uMax,UINT32 uCarBrand )
{
	if(uCarBrand >= uMin && uCarBrand <= uMax)
	{
		return uMin;
	}
	return 0;
}

string CBrandSusection::GetCarLabelText( UINT32 uCarLabel )
{
	std::string strBrand = "其它";
	switch(uCarLabel)
	{
	case AUDI:
		strBrand = "奥迪"; break;
	case BMW:
		strBrand = "宝马"; break;
	case HYUNDAI:
		strBrand = "现代"; break;
	case BENZ: 
		strBrand = "奔驰"; break;
	case HONDA:
		strBrand = "本田"; break;
	case VW: 
		strBrand = "大众"; break;
	case MAZDA:
		strBrand = "马自达"; break;
	case TOYOTA: 
		strBrand = "丰田"; break;
	case BUICK:
		strBrand = "别克"; break;
	case CHEVROLET:
		strBrand = "雪佛兰"; break;
	case CITERON:
		strBrand = "雪铁龙"; break;
	case PEUGEOT:
		strBrand = "标志"; break;
	case FORD:
		strBrand = "福特"; break;
	case LEXUS:
		strBrand = "凌志"; break;
	case NISSAN:
		strBrand = "尼桑"; break;
	case CHERY:
		strBrand = "奇瑞"; break;
	case BYD:
		strBrand = "比亚迪"; break;
	case KIA:
		strBrand = "起亚"; break;
	case ROWE:
		strBrand = "荣威"; break;
	case MITSUBISHI:
		strBrand = "三菱"; break;
	case SKODA:
		strBrand = "斯柯达"; break;
	case SUZUKI:
		strBrand = "铃木"; break;
	case CHANGHE:
		strBrand = "昌河"; break;
	case FIAT:              
		strBrand = "菲亚特"; break;
	case VOLVO:
		strBrand = "沃尔沃"; break;
	case JEEP:
		strBrand = "吉普"; break;
	case LANDROVER:
		strBrand = "路虎"; break;
	case GMC:
		strBrand = "通用"; break;
	case RedFlags:
		strBrand = "红旗"; break;
	case HUMMER:
		strBrand = "悍马"; break;
	case JINBEI:
		strBrand = "金杯"; break;
	case JAC:
		strBrand = "江淮"; break;
	case JMC:
		strBrand = "江铃"; break;
	case GEELY:
		strBrand = "吉利"; break;
	case LANDWIND:
		strBrand = "陆风"; break;
	case LIFAN:
		strBrand = "力帆"; break;
	case MG:
		strBrand = "名爵"; break;
	case ACURA:
		strBrand = "讴歌"; break;
	case INFINITI:
		strBrand = "英菲尼迪"; break;
	case FLYWITHOUT:
		strBrand = "中华"; break;
	case ZOTYEAUTO:
		strBrand = "众泰"; break;
	case RELY:
		strBrand = "威麟"; break;
	case SUBARU:
		strBrand = "斯巴鲁"; break;
	case SPYKER:
		strBrand = "世爵"; break;
	case SHUANGHUANAUTO:
		strBrand = "双环"; break;
	case SAAB:
		strBrand = "萨博"; break;
	case WIESMANN:
		strBrand = "威兹曼"; break;
	case GLEAGLE:
		strBrand = "全球鹰"; break;
	case GONOW:
		strBrand = "吉奥"; break;
	case HAWTAIAUTOMOBILE:
		strBrand = "华泰"; break;
	case SMA:
		strBrand = "华普"; break;
	case HAFEI:
		strBrand = "哈飞"; break;
	case SOUEAST:
		strBrand = "东南"; break;
	case EMGRANO:
		strBrand = "帝豪"; break;
	case CHANA:
		strBrand = "长安"; break;
	case CHANGFENAMOTOR:        
		strBrand = "长丰"; break;
	case GREATWALL:
		strBrand = "长城"; break;
	case DAEWOO:
		strBrand = "大宇"; break;
	case ISUZU:
		strBrand = "五十铃"; break;
	case DAIHATSU:
		strBrand = "大发"; break;
	case JAGUAR:
		strBrand = "捷豹"; break;
	case OPEL: 
		strBrand = "欧宝"; break;
	case CHRYSLER:  
		strBrand = "克莱斯勒"; break;
	case ALFAROMEO:   
		strBrand = "罗密欧"; break;
	case LINCOLN:  
		strBrand = "林肯"; break;
	case ROLLSROYCE: 
		strBrand = "劳斯莱斯"; break;
	case FERRARI:  
		strBrand = "法拉利"; break;
	case PORSCHE:   
		strBrand = "保时捷"; break;
	case LOTUS:   
		strBrand = "莲花"; break;
	case ASTONMARTIN: 
		strBrand = "阿斯顿马丁"; break;
	case CROWN:    
		strBrand = "皇冠"; break;
	case BESTURN:   
		strBrand = "奔腾"; break;
	case DONGFENG: 
		strBrand = "东风D0"; break;
	case POLARSUN:	
		strBrand = "中顺"; break;
	case FOTON:   
		strBrand = "长安福田"; break;
	case WULING:     
		strBrand = "五菱"; break;
	case CADILLAC:  
		strBrand = "凯迪拉克"; break;
	case MASERATI:	
		strBrand = "玛莎拉蒂M3"; break;
	case XIALI:    
		strBrand = "夏利"; break;
	case RENAULT:     
		strBrand = "雷诺"; break;
	case IVECO:  
		strBrand = "依维柯"; break;
	case BNTLY:   
		strBrand = "宾利"; break;
	case MINI:    
		strBrand = "迷你"; break;
	case SSANGYONG:  
		strBrand = "双龙"; break;
	case HUIZHONG: 
		strBrand = "汇众"; break;
	case YIQI:    
		strBrand = "一汽"; break;
	case KARRY:   
		strBrand = "开瑞"; break;
	case NANQI:  
		strBrand = "南汽"; break;
	case YUEJIN:	
		strBrand = "跃进"; break;
	case FAW:       
		strBrand = "解放"; break;//                  89
	case KINGLONG:     
		strBrand = "金龙"; break;//                   90
	case RANGEROVER:   
		strBrand = "罗福"; break;//                   91
	case ZX:      
		strBrand = "中兴"; break;//                  92
	case RIICH:   
		strBrand = "瑞麒"; break;//                    93
	case SG:     
		strBrand = "曙光"; break;//                    94
	case BEIQI:    
		strBrand = "北汽"; break;//                   95
	case HAIMA:		
		strBrand = "海马郑州"; break;//				96
	case CNHTC:	
		strBrand = "中国重汽"; break;//				97
	case SHACMAN:	
		strBrand = "陕汽重卡"; break;//				98
	case BEIBENTRUCK:
		strBrand = "北奔重卡"; break;//				99
	case YUTONG:
		strBrand = "宇通客车"; break;//				100
	case YCACO: 
		strBrand = "羊城汽车"; break;//             101
	case FUDI:  
		strBrand = "福迪汽车"; break;//              102
	case GUANGQI:  
		strBrand = "广汽"; break;//                  103
	case HUADE:  
		strBrand = "华德"; break;//                   104  
	case CF:	
		strBrand = "楚风"; break;//					105
	case CHUNLAN:   
		strBrand = "春兰"; break;//					106
	case DAYUN:	
		strBrand = "大运"; break;//					107
	case DFLZ:	
		strBrand = "东风柳州"; break;//				108
	case FEICHI:	
		strBrand = "佛山飞驰"; break;//				109
	case HINO:	
		strBrand = "日野"; break;//                  110
	case HONGYAN:	
		strBrand = "红岩"; break;//					111
	case CAMC:	
		strBrand = "华菱"; break;//					112
	case GOLDENDRAGON:
		strBrand = "金旅"; break;//					113
	case CC:		
		strBrand = "联合"; break;//					114
	case MAN:	
		strBrand = "曼"; break;//					115
	case YOUNGMAN:	
		strBrand = "青年"; break;//					116
	case UD:		
		strBrand = "日产"; break;//					117
	case SHENYE:	
		strBrand = "神野"; break;//					118
	case SHITONG:	
		strBrand = "十通"; break;//					119
	case SCANIA:	
		strBrand = "斯堪尼亚"; break;//				120
	case WAW:	
		strBrand = "五征"; break;//					121
	case XCMG:	
		strBrand = "徐工"; break;//					122
	case ZHONGTONG:   
		strBrand = "中通"; break;//					123
	case CDW:		
		strBrand = "王牌"; break;//                124
	case BAOJUN:    
		strBrand = "宝骏"; break;// 125
	case LINIAN:   
		strBrand = "理念"; break;/// 126
	case SHUANGLONG: 
		strBrand = "双龙"; break;// 127
	case QICHEN:  
		strBrand = "启辰"; break; //128
	case CHUANQI:   
		strBrand = "传祺"; break;// 129
	case DODGE:		
		strBrand = "道奇"; break;// 130
	case HAVAL:	
		strBrand = "哈佛"; break;//131
	case LUXGEN:
		strBrand = "纳智捷"; break;//132
	case SMART:		
		strBrand = "斯玛特"; break;//	133
		////////////
	case MUSTANG:  
		strBrand = "野马"; break;//     134
	case LAMBORGHINI: 
		strBrand = "兰博基尼"; break;//  135
	case PLYMOUTH: 
		strBrand = "普利茅斯"; break;//	136
	case EUNOS:   
		strBrand = "俊郎"; break;//	137
	case MERCURY:
		strBrand = "水星"; break;//	138
	case SATURN: 
		strBrand = "土星"; break;//	139
	case LANCIA: 
		strBrand = "蓝西亚"; break;//	140
	case SEAT:   
		strBrand = "西亚特"; break;//	141
	case PONTIAC: 
		strBrand = "庞蒂克"; break;//	142
	case OLDSMOBILE:
		strBrand = "奥士莫比"; break;//	143
	case AUSTIN: 
		strBrand = "奥斯汀"; break;//	144
	case MAYBACH:
		strBrand = "迈巴赫"; break;//	145
	case BUGATTI:
		strBrand = "布加迪"; break;//	146
	case ROVER: 
		strBrand = "中国罗浮"; break;//	147
	case SHIDAI: 
		strBrand = "时代"; break;//	148
	case YINGLUN:
		strBrand = "吉利英伦"; break;//	149
	case ROWOR:	
		strBrand = "瑞沃"; break;//	150
	case HIGER:
		strBrand = "海格"; break;//	151
	case TVR:
		strBrand = "英国"; break;//	152
	case UFO:
		strBrand = "永源"; break;//	153
	case OUGE: 
		strBrand = "讴歌"; break;//     154
	//////////////////////增加车标粗分
	case LEX: 
		strBrand = "雷克萨斯"; break;//     155
	case NANJ: 
		strBrand = "南京"; break;//     156
	case SMAR: 
		strBrand = "精灵"; break;//     157
	case KAMA: 
		strBrand = "凯马"; break;//     158
	case YAXI: 
		strBrand = "亚星客车"; break;//     159
	case SANY: 
		strBrand = "三一"; break;//     160
	case NJUN: 
		strBrand = "南骏"; break;//     161
	case AKAI: 
		strBrand = "安凯客车"; break;//     162
	case MDHD: 
		strBrand = "牡丹花都"; break;//     163
	case SHUD: 
		strBrand = "蜀都公交"; break;//     164
	case TKNG: 
		strBrand = "唐骏"; break;//     165
	case QNGQ: 
		strBrand = "轻骑微卡"; break;//     166
	case HUGH: 
		strBrand = "黄海客车"; break;//     167
	case CHQY: 
		strBrand = "川汽野马"; break;//     168
	case XIKAI: 
		strBrand = "新凯"; break;//     169
	case SIFENG: 
		strBrand = "时风"; break;//     170
	case THRC: 
		strBrand = "三环"; break;//     171
	case BLK: 
		strBrand = "百路佳"; break;//     172
	case BFNO: 
		strBrand = "北方尼奥普兰"; break;//     173
	case SULO:
		strBrand = "上海申通"; break;//     174
		//奥迪**********200-499***********//
	case aud0:
		strBrand = "奥迪(A4 2004-2005款)"; break;            
	case aud1: 
		strBrand = "奥迪(A4 2006-2008款)"; break;            
	case aud2: 
		strBrand = "奥迪(A4L 2009-2012款)"; break;            
	case aud3: 
		strBrand = "奥迪(A4L 2013款)"; break;                 
	case aud4:  
		strBrand = "奥迪(A6 2004款)"; break;                 
	case aud5: 
		strBrand = "奥迪(A6L 2005-2008款)"; break;            
	case aud6:
		strBrand = "奥迪(A6L 2009-2011款)"; break;            
	case aud7: 
		strBrand = "奥迪(A6L 2012-2014款)"; break;            
	case aud8: 
		strBrand = "奥迪(A8L 2004-2010款)"; break;            
	case aud9: 
		strBrand = "奥迪(A8L 2011-2013款)"; break;            
	case aud10: 
		strBrand = "奥迪(Q3 2013-2014款)"; break;            
	case aud11: 
		strBrand = "奥迪(Q5 2010-2013款)"; break;            
	case aud12: 
		strBrand = "奥迪(Q7 2006-2014款)"; break;            
	case aud13: 
		strBrand = "奥迪(A1 2008-2014款)"; break;            
	case aud14: 
		strBrand = "奥迪(A3 2004-2013款)"; break;            
	case aud15: 
		strBrand = "奥迪(A5 2008-2014款)"; break;            
	case aud16: 
		strBrand = "奥迪(A7 2011-2013款)"; break;            
	case aud17: 
		strBrand = "奥迪(TT 2004-2013款)"; break;            
	case aud18:
		strBrand = "奥迪(R8 2007-2014款)"; break;            
	case aud19: 
		strBrand = "奥迪(RS5 2011-2013款)"; break;            
	case aud20: 
		strBrand = "奥迪(RS6 2002:2009款)"; break;            
	case aud21: 
		strBrand = "奥迪(S5 2009-2012款)"; break;            
	case aud22: 
		strBrand = "奥迪(S6 2006-2009款)"; break;            
	case aud23: 
		strBrand = "奥迪(S6 2013款)"; break;                 
	case aud24:
		strBrand = "奥迪(TTS 2008:2011:2013款)"; break;       
	case aud25: 
		strBrand = "奥迪(A4 2009-2012款)"; break;            
	case aud26: 
		strBrand = "奥迪(A6L  未知)"; break;                   
	case aud27: 
		strBrand = "奥迪(A6L 2009-2012款)"; break;            
	case aud28:
		strBrand = "奥迪(A6 2013款)"; break;                 
	case aud29:
		strBrand = "奥迪(A8L 2010款)"; break;                   
	case aud30: 
		strBrand = "奥迪(Q3 2013款)"; break;                 
	case aud31: 
		strBrand = "奥迪(Q5 2009-2011款)"; break;            
	case aud32: 
		strBrand = "奥迪(Q5 2012款)"; break;                 
	case aud33:
		strBrand = "奥迪(Q5 2013款)"; break;                 
	case aud34:
		strBrand = "奥迪(Q7 2006-2007款)"; break;            
	case aud35: 
		strBrand = "奥迪(Q7 2010-2012款)"; break;            
	case aud36:
		strBrand = "奥迪(A7 2011-2013款)"; break;                 
	case aud37:
		strBrand = "奥迪(TT 2013款)"; break;                 
	case aud38:
		strBrand = "奥迪(A8/A8L 2011款)"; break;                
	case aud39: 
		strBrand = "奥迪(A3 2013款)"; break;   
	case aud40:   
		strBrand = "奥迪(*** ***)"; break;
	case aud41:   
		strBrand = "奥迪(RS4  2006款)"; break;       //小客
	case aud42:    
		strBrand = "奥迪(S3   2006,2009款)"; break;  //小客     
	case aud43:    
		strBrand = "奥迪(A3(进口) 2010,2012款)"; break;  
	case aud44:   
		strBrand = "奥迪(A4/A4(进口) 2008款/2003款)"; break;
	case aud45:    
		strBrand = "奥迪(A1 2010,2012-2014款)"; break;  
	case aud46:    
		strBrand = "奥迪(Q3(进口) 2012款)"; break;  
	case aud47:   
		strBrand = "奥迪(A3(进口)/A5 2014款/2012-2014款)"; break;
	case aud48:   
		strBrand = "奥迪(A6/A4 2004款/2004-2005款)"; break; 
	case aud49:   
		strBrand = "奥迪(TT 20011-2012款)"; break; 
	case aud50:   
		strBrand = "奥迪(A5 2012-2014款)"; break; 
	case aud51:   
		strBrand = "奥迪(S4 2008款)"; break;
	case aud52:  
		strBrand = "奥迪(A5 2008-2010款)"; break;
	case aud53:   
		strBrand = "奥迪(TTS 2008款)"; break;
	case aud54:  
		strBrand = "奥迪(A3(进口)      2013款)"; break;
	case aud55:  
		strBrand = "奥迪(Q5/Q5(进口)   2011-2012款/2010款)"; break;	
	case aud56: 
		strBrand = "奥迪(S5 2009-2010款)"; break;
	case aud57: 
		strBrand = "奥迪(TT 2004款)"; break;
	case aud58:  
		strBrand = "奥迪(RS6 2009款)"; break;	
	case aud59:  
		strBrand = "奥迪(Q5/Q5(进口)   2012款/2010,2012款)"; break;
	case aud60:  
		strBrand = "奥迪(A8 2010-2013款)"; break;
	case aud61: 
		strBrand = "奥迪(A8 2005-2009款)"; break;
	case aud62:
		strBrand = "奥迪(S6 2006，2008-2009款)"; break;
		//大众**********500-999***********//
	case vw500: 
		strBrand = "大众(宝来 2006-2007款)"; break;     
	case vw501: 
		strBrand = "大众(宝来 2008-2012款)"; break;     
	case vw502: 
		strBrand = "大众(CC 2013款)"; break;	        
	case vw503: 
		strBrand = "大众(CC 2010-2012款)"; break;     
	case vw504: 
		strBrand = "大众(高尔夫 2004，2005:2008款)"; break;   
	case vw505: 
		strBrand = "大众(宝来 2004-2005款)"; break;        
	case vw506: 
		strBrand = "大众(捷达 2013款)"; break;             
	case vw507: 
		strBrand = "大众(捷达 2010-2012款)"; break;        
	case vw508: 
		strBrand = "大众(甲壳虫 2004-2010款)"; break;         
	case vw509: 
		strBrand = "大众(朗逸 2011款)"; break;             
	case vw510: 
		strBrand = "大众(朗逸 2013款)"; break;             
	case vw511: 
		strBrand = "大众(迈腾 2007-2011款)"; break;        
	case vw512: 
		strBrand = "大众(迈腾 2012-2013款)"; break;        
	case vw513: 
		strBrand = "大众(帕萨特领驭 2005-2007款)"; break;        
	case vw514: 
		strBrand = "大众(帕萨特领驭 2009款)"; break;             
	case vw515: 
		strBrand = "大众(帕萨特 2011-2014款)"; break;        
	case vw516: 
		strBrand = "大众(途锐 2011-2014款)"; break;       
	case vw517: 
		strBrand = "大众(POLO两厢 2004-2009款)"; break;       
	case vw518: 
		strBrand = "大众(POLO三厢 2004-2009款)"; break;       
	case vw519: 
		strBrand = "大众(桑塔纳vista 2008-2010款)"; break;        
	case vw520: 
		strBrand = "大众(POLO两厢 2011-2013款)"; break;       
	case vw521: 
		strBrand = "大众(速腾 2012-2014款)"; break;       
	case vw522: 
		strBrand = "大众(速腾 2007-2011款)"; break;       
	case vw523: 
		strBrand = "大众(普桑塔纳 2004,2007款)"; break;       
	case vw524: 
		strBrand = "大众(桑塔纳2000  未知)"; break;               
	case vw525: 
		strBrand = "大众(桑塔纳3000  未知)"; break;                
	case vw526: 
		strBrand = "大众(桑塔纳vista 2004,2006款)"; break;       
	case vw527: 
		strBrand = "大众(途安 2004-2013款)"; break;      
	case vw528: 
		strBrand = "大众(夏朗 2012-2013款)"; break;      
	case vw529: 
		strBrand = "大众(途观 2013款)"; break;           
	case vw530: 
		strBrand = "大众(途锐 2003,2006-2010款)"; break; 
	case vw531: 
		strBrand = "大众(尚酷 2009-2013款)"; break;      
	case vw532: 
		strBrand = "大众(途观 2008-2012款)"; break;      
	case vw533: 
		strBrand = "大众(帕萨特 2004-2005,2007款)"; break;  
	case vw534: 
		strBrand = "大众(POLO三厢 2010款)"; break;           
	case vw535: 
		strBrand = "大众(宝来 2013-2014款)"; break;      
	case vw536: 
		strBrand = "大众(桑塔纳 2013-2014款)"; break;       
	case vw537: 
		strBrand = "大众(辉腾 2004-2010款)"; break;      
	case vw538: 
		strBrand = "大众(宝来 2013款)"; break;            
	case vw539: 
		strBrand = "大众(宝来自动豪华型 2011-2012款)"; break;       
	case vw540: 
		strBrand = "大众(宝来 2008款)"; break;            
	case vw541: 
		strBrand = "大众(宝来时尚版 2012款)"; break;            
	case vw542:
		strBrand = "大众(高尔夫 2004-2005款)"; break;       
	case vw543:
		strBrand = "大众(高尔夫 2010-2012款)"; break;      
	case vw544:
		strBrand = "大众(捷达 2006-2009款)"; break;      
	case vw545:
		strBrand = "大众(捷达 2010,2012款)"; break;      
	case vw546:
		strBrand = "大众(甲壳虫 2008-2010,2012款)"; break; 
	case vw547:
		strBrand = "大众(迈腾 2010-2011款)"; break;      
	case vw548:
		strBrand = "大众(帕萨特 2005款)"; break;           
	case vw549: 
		strBrand = "大众(帕萨特领驭 2007款)"; break;           
	case vw550: 
		strBrand = "大众(未知 未知)"; break;          
	case vw551: 
		strBrand = "大众(帕萨特 2013款)"; break;           
	case vw552: 
		strBrand = "大众(POLO 2004款)"; break;           
	case vw553: 
		strBrand = "大众(POLO劲取 2009款)"; break;           
	case vw554: 
		strBrand = "大众(POLO劲情 2006款)"; break;           
	case vw555: 
		strBrand = "大众(POLO 2013款)"; break;           
	case vw556: 
		strBrand = "大众(速腾 2009,2011款)"; break;      
	case vw557: 
		strBrand = "大众(速腾 2012款)"; break;           
	case vw558: 
		strBrand = "大众(桑塔纳 2006-2007款)"; break;      
	case vw559: 
		strBrand = "大众(桑塔纳 志俊 2004,2006款)"; break;      
	case vw560: 
		strBrand = "大众(桑塔纳vista 未知)"; break;      
	case vw561: 
		strBrand = "大众(途安 2006,2008款)"; break;      
	case vw562: 
		strBrand = "大众(途安 2011,2013款)"; break;      
	case vw563: 
		strBrand = "大众(途观 2012-2013款)"; break;      
	case vw564: 
		strBrand = "大众(途锐 2013款)"; break;           
	case vw565: 
		strBrand = "大众(桑塔纳 志俊 2010款)"; break;           
	case vw566: 
		strBrand = "大众(POLO劲取 2011款)"; break;           
	case vw567: 
		strBrand = "大众(桑塔纳 2013款)"; break;           
	case vw568: 
		strBrand = "大众(POLO劲取 2009款)"; break;           
	case vw569: 
		strBrand = "大众(POLO劲取 2006款)"; break;           
	case vw570: 
		strBrand = "大众(捷达 2005款)"; break;  
	case vw571:   
		strBrand = "大众(***  ***)"; break;
	case vw572:  
		strBrand = "大众(高尔夫GTI    2010-2011款)"; break;  //小客
	case vw573:  
		strBrand = "大众(宝来经典 2004,2005款)"; break;
	case vw574:  
		strBrand = "大众(宝来 2008,2011，2012款)"; break;
	case vw575:  
		strBrand = "大众(CC 2010,2011,2012款)"; break;
	case vw576: 
		strBrand = "大众(高尔夫 2004,2005，2008款)"; break;
	case vw577:  
		strBrand = "大众(甲壳虫 2004-2006,2008-2010款)"; break;
	case vw578:  
		strBrand = "大众(朗逸/朗行 2013款/2013款)"; break;          //小客/中客
	case vw579:
		strBrand = "大众(迈腾 2007-2009，2010,2011款)"; break;
	case vw580: 
		strBrand = "大众(passat领驭 2009,2011款)"; break;
	case vw581:  
		strBrand = "大众(速腾/高尔夫（进口）2006,2007,2009-2011款/2008款)"; break;   //小客/中客
	case vw582: 
		strBrand = "大众(速腾 2012-2014款)"; break;
	case vw583: 
		strBrand = "大众(桑塔纳经典 2004,2006,2007款)"; break;
	case vw584: 
		strBrand = "大众(桑塔纳志俊 2004,2010款)"; break;
	case vw585: 
		strBrand = "大众(捷达 2013款)"; break;
	case vw586: 
		strBrand = "大众(桑塔纳志俊 2008款)"; break;
	case vw587:
		strBrand = "大众(宝来 2013,2014款)"; break;
	case vw588: 
		strBrand = "大众(尚酷 2009-2011,2013款)"; break;
	case vw589: 
		strBrand = "大众(迈腾（进口）2012款)"; break;       //中客
	case vw590: 
		strBrand = "大众(POLO Cross POLO 2007款)"; break;   //中客
	case vw591: 
		strBrand = "大众(宝来经典 2006款)"; break;
	case vw592: 
		strBrand = "大众(捷达 1994款)"; break;
	case vw593:  
		strBrand = "大众(朗逸 2010款)"; break;
	case vw594: 
		strBrand = "大众(高尔 2004款)"; break;
	case vw595:  
		strBrand = "大众(途安 2004-2006款)"; break;   //中客
	case vw596: 
		strBrand = "大众(POLO Cross POLO 2012,2014款)"; break;  //中客
	case vw597:
		strBrand = "大众(帕萨特 2008款)"; break;
	case vw598:  
		strBrand = "大众(朗行/朗逸/途观  2014款/2014款/2010，2012款)"; break;   //小客/小客/中客
	case vw599:
		strBrand = "大众(POLO Sporty  2009款)"; break;       //中客
	case vw600: 
		strBrand = "大众(朗行/朗逸 2013款/2013款)"; break;   //中客/小客
	case vw601: 
		strBrand = "大众(Tiguan 2012,2014款)"; break;     //中客
	case vw602: 
		strBrand = "大众(途锐 2006款)"; break;   //中客
	case vw603: 
		strBrand = "大众(高尔夫/高尔夫（进口）2010-2012款/2011,2013款/2010-2012款)"; break;   //小客/小客/中客
	case vw604: 
		strBrand = "大众(甲壳虫 2004,2006款)"; break;
	case vw605:  
		strBrand = "大众(甲壳虫 2013,2014款)"; break;
	case vw606:  
		strBrand = "大众(途锐 2007-2010款)"; break;  //中客
	case vw607: 
		strBrand = "大众(高尔夫（进口）2001,2006款)"; break;   //中客
	case vw608: 
		strBrand = "大众(POLO劲取 2011款)"; break;     
	case vw609:  
		strBrand = "大众(途观 2013,2015款)"; break; //中客
	case vw610: 
		strBrand = "大众(迈特威/凯路威 2012,2013款/2014款)"; break;    //中客
	case vw611: 
		strBrand = "大众(夏朗 2012,2013款)"; break;   //中客
	case vw612: 
		strBrand = "大众(捷达 2013款)"; break;  
	case vw613: 
		strBrand = "大众(高尔夫（进口）2011，2012款/2014款)"; break;  //中客/小客
	case vw614:  
		strBrand = "大众(尚酷 2011款)"; break;
	case vw615: 
		strBrand = "大众(高尔夫（进口）2011款)"; break;   //中客
	case vw616: 
		strBrand = "大众(Tiguan 2009款)"; break;   //中客
	case vw617: 
		strBrand = "大众(高尔夫/高尔夫（进口）2014款/2012款)"; break;   //中客
	case vw618: 
		strBrand = "大众(途锐 2011-2014款)"; break;   //中客
	case vw619: 
		strBrand = "大众(迈特威 2008款)"; break;   //中客
		//宝马**********1000-1499***********// 
	case bmw1000:
		strBrand = "宝马(m3 2010-2013款)"; break;   
	case bmw1001:
		strBrand = "宝马(5系GT 2010-2013款)"; break;
	case bmw1002:
		strBrand = "宝马(3系 2009-2012款)"; break;
	case bmw1003:
		strBrand = "宝马(3系 2005-2008款)"; break;
	case bmw1004: 
		strBrand = "宝马(X3 2006-2010款)"; break;
	case bmw1005:
		strBrand = "宝马(5系 2005-2010款)"; break;
	case bmw1006:
		strBrand = "宝马(3系 2013款)"; break;     
	case bmw1007:
		strBrand = "宝马(5系 2011-2014款)"; break;
	case bmw1008: 
		strBrand = "宝马(未知 未知)"; break;
	case bmw1009:
		strBrand = "宝马(m3 2001款)"; break;     
	case bmw1010:
		strBrand = "宝马(7系 2004款)"; break;     
	case bmw1011:
		strBrand = "宝马(7系 2009-2013款)"; break;
	case bmw1012:
		strBrand = "宝马(5系（进口） 2001款)"; break;     
	case bmw1013: 
		strBrand = "宝马(X3 2011-2013款)"; break;
	case bmw1014:
		strBrand = "宝马(5系 1994款)"; break;     
	case bmw1015:
		strBrand = "宝马(X1 2010-2013款)"; break;
	case bmw1016:
		strBrand = "宝马(X5 2004-2013款)"; break;
	case bmw1017:
		strBrand = "宝马(1系 2007-2010款)"; break;
	case bmw1018:
		strBrand = "宝马(X6 2008-2013款)"; break;
	case bmw1019:
		strBrand = "宝马(Z4 2009-2013款)"; break;
	case bmw1020:
		strBrand = "宝马(6系 2004-2007款)"; break;
	case bmw1021: 
		strBrand = "宝马(1系 未知)"; break;
	case bmw1022: 
		strBrand = "宝马(1系 2007款)"; break;     
	case bmw1023:
		strBrand = "宝马(1系 2012款)"; break;     
	case bmw1024:
		strBrand = "宝马(5系 未知)"; break;      
	case bmw1025:
		strBrand = "宝马(3系 2010款)"; break;    
	case bmw1026:
		strBrand = "宝马(3系 2013-2014款)"; break;     
	case bmw1027:
		strBrand = "宝马(5系 2004款)"; break;  
	case bmw1028: 
		strBrand = "宝马(5系 2009-2010款)"; break;     
	case bmw1029:
		strBrand = "宝马(5系 2011-2012款)"; break;     
	case bmw1030:
		strBrand = "宝马(5系 2013款)"; break;  
	case bmw1031:
		strBrand = "宝马(7系 2010款)"; break;  
	case bmw1032:
		strBrand = "宝马(x6 未知)"; break;    
	case bmw1033:
		strBrand = "宝马(x5 2010-2011,2013款)"; break;   
	case bmw1034: 
		strBrand = "宝马(x1 2011-2012款)"; break;
	case bmw1035:
		strBrand = "宝马(x3 2006,2009款)"; break;
	case bmw1036:
		strBrand = "宝马(x3 2011-2012款)"; break;
	case bmw1037: 
		strBrand = "宝马(6系 未知)"; break; 
	case bmw1038:   
		strBrand = "宝马(*** ***)"; break; 
	case bmw1039:   
		strBrand = "宝马(3系2004款)"; break;    //小客
	case bmw1040:  
		strBrand = "宝马(3系(进口) 2011款)"; break;   
	case bmw1041:  
		strBrand = "宝马(5系 2008-2010款)"; break; 
	case bmw1042:  
		strBrand = "宝马(3系（进口）2006,2007,2009，2011款)"; break; 
	case bmw1043:  
		strBrand = "宝马(Z4 2009-2010,2012，2014款)"; break; 
	case bmw1044:  
		strBrand = "宝马(7系 2009，2011款)"; break;  
	case bmw1045:   
		strBrand = "宝马(X5 2008-2010款)"; break;   //中客
	case bmw1046:
		strBrand = "宝马(1系 2012,2013款)"; break;   //中客
	case bmw1047:  
		strBrand = "宝马(3系/3系（进口）2013-2014款/2013-2014款)"; break; 
	case bmw1048: 
		strBrand = "宝马(7系 2013-2014款)"; break; 
	case bmw1049: 
		strBrand = "宝马(6系/M6 2004，2006-2007款/2006款)"; break; 	
	case bmw1050:  
		strBrand = "宝马(3系GT 2013款)"; break; 
	case bmw1051:  
		strBrand = "宝马(5系/5系（进口）2014款/2014款)"; break; 
	case bmw1052:  
		strBrand = "宝马(X5 2011,2013款)"; break;   //中客
	case bmw1053: 
		strBrand = "宝马(X1 2013-2014款)"; break;   //中客
	case bmw1054:  
		strBrand = "宝马(X5 2004,2006款)"; break; //中客
	case bmw1055: 
		strBrand = "宝马(3系（进口）2010-2011款)"; break; 
	case bmw1056: 
		strBrand = "宝马(6系 2010-2013款)"; break; 	
	case bmw1057: 
		strBrand = "宝马(M3 2009-2011，2013款)"; break; 
	case bmw1058: 
		strBrand = "宝马(Z4 2004款)"; break; 
	case bmw1059: 
		strBrand = "宝马(5系（进口）/M5 2006款/1995,2005，2008款)"; break; 
	case bmw1060: 
		strBrand = "宝马(X5 2014款)"; break;   //中客
	case bmw1061:  
		strBrand = "宝马(X5 2011，2013款)"; break;    //中客
	case bmw1062: 
		strBrand = "宝马(X1/X1（进口）2012款/2012款)"; break;   //中客
	case bmw1063: 
		strBrand = "宝马(1系 2010-2012款)"; break; 
	case bmw1064: 
		strBrand = "宝马(1系 2007，2008,2010,2011款)"; break; 
	case bmw1065: 
		strBrand = "宝马(3系 2005-2008款)"; break; 

		//本田**********1500-1999***********//
	case hod1500:
		strBrand = "本田(CRV 2007-2008款)"; break;    
	case hod1501: 
		strBrand = "本田(雅阁 2004-2005款)"; break;     
	case hod1502:
		strBrand = "本田(雅阁 2011-2012款)"; break;     
	case hod1503: 
		strBrand = "本田(艾力绅 2012款)"; break; 
	case hod1504:
		strBrand = "本田(未知1 未知)"; break;	       
	case hod1505: 
		strBrand = "本田(未知2 未知)"; break;  
	case hod1506:
		strBrand = "本田(思域 2008-2009款)"; break;    
	case hod1507: 
		strBrand = "本田(奥德赛 2009,2011款)"; break;     
	case hod1508:
		strBrand = "本田(雅阁 2008-2010款)"; break;     
	case hod1509: 
		strBrand = "本田(CRV 2012-2013款)"; break;     
	case hod1510:
		strBrand = "本田(未知3 未知)"; break;    
	case hod1511:
		strBrand = "本田(奥德赛 2004款)"; break;   
	case hod1512: 
		strBrand = "本田(思域 2012-2013款)"; break;     
	case hod1513:
		strBrand = "本田(飞度 2008款)"; break;  
	case hod1514:
		strBrand = "本田(雅阁 2006-2007款)"; break;     
	case hod1515: 
		strBrand = "本田(奥德赛 2007款)"; break;  
	case hod1516: 
		strBrand = "本田(雅阁 2014款)"; break;  
	case hod1517:
		strBrand = "本田(飞度 2004,2007款)"; break;     
	case hod1518:
		strBrand = "本田(思铂睿 2009款)"; break;  
	case hod1519:
		strBrand = "本田(思迪 2006-2007款)"; break;    
	case hod1520: 
		strBrand = "本田(飞度 2011款)"; break; 
	case hod1521:
		strBrand = "本田(未知4 未知)"; break;
	case hod1522:
		strBrand = "本田(未知5 未知)"; break;
	case hod1523: 
		strBrand = "本田(未知6 未知)"; break;
	case hod1524: 
		strBrand = "本田(未知7 未知)"; break;
	case hod1525: 
		strBrand = "本田(未知8 未知)"; break;
	case hod1526:
		strBrand = "本田(未知9 未知)"; break;
	case hod1527:
		strBrand = "本田(雅阁 2013款)"; break;
	case hod1528: 
		strBrand = "本田(奥德赛 2014款)"; break; 
	case hod1529:
		strBrand = "本田(杰德 2013款)"; break;
	case hod1530:
		strBrand = "本田(未知10 未知)"; break;  
	case hod1531:
		strBrand = "本田(CRV 2005款)"; break;
	case hod1532:
		strBrand = "本田(凌派 2013款)"; break;
	case hod1533: 
		strBrand = "本田(CRV 2004款)"; break;
	case hod1534: 
		strBrand = "本田(未知11 未知)"; break; 
	case hod1535:
		strBrand = "本田(飞度（进口）未知)"; break; 
	case hod1536:
		strBrand = "本田(奥德赛 2004-2005款)"; break;  
	case hod1537: 
		strBrand = "本田(奥德赛 2007-2008款)"; break;  
	case hod1538:
		strBrand = "本田(奥德赛 2009款)"; break;       
	case hod1539:
		strBrand = "本田(CRV 2010款)"; break;       
	case hod1540:
		strBrand = "本田(锋范 未知)"; break;
	case hod1541:
		strBrand = "本田(锋范 2008-2012款)"; break;  
	case hod1542:
		strBrand = "本田(歌诗图 2011-2012款)"; break;  
	case hod1543:
		strBrand = "本田(思域 未知 )"; break; 
	case hod1544:
		strBrand = "本田(雅阁 1990-1991款)"; break;  
	case hod1545:
		strBrand = "本田(雅阁 2004款)"; break;       
	case hod1546:
		strBrand = "本田(雅阁 2005-2007款)"; break;  
	case hod1547:
		strBrand = "本田(雅阁EXL-Navi 2010款)"; break;       
	case hod1548:
		strBrand = "本田(雅阁 2011-2013款)"; break;  
	case hod1549:
		strBrand = "本田(雅阁 2008-2009款)"; break;  
	case hod1550:
		strBrand = "本田(思域 2013款)"; break;  
	case hod1551:
		strBrand = "本田(奥德赛劲秀 2011款)"; break;
	case hod1552: 
		strBrand = "本田(***  ***)"; break;
	case hod1553:  
		strBrand = "本田(锋范 2011款)"; break;   //小客
	case hod1554:  
		strBrand = "本田(思域 2009款)"; break;       	     
	case hod1555: 
		strBrand = "本田(飞度 2004款)"; break;       
	case hod1556: 
		strBrand = "本田(飞度 2011款)"; break;   //中客
	case hod1557: 
		strBrand = "本田(锋范 2011-2012,2014款)"; break; 
	case hod1558: 
		strBrand = "本田(飞度 2007款)"; break;   //中客
	case hod1559: 
		strBrand = "本田(飞度/飞度（进口） 2011款/2009,2013款)"; break; //中客 
	case hod1560: 
		strBrand = "本田(思铂睿 2013款)"; break; 	
	case hod1561: 
		strBrand = "本田(思域 2006,2008,2009款)"; break; 
	case hod1562: 
		strBrand = "本田(雅阁 2004,2006,2007款)"; break;
	case hod1563: 
		strBrand = "本田(思域 2004,2006，2007,2009款)"; break; 
	case hod1564: 
		strBrand = "本田(思域 2012款)"; break; 	
	case hod1565: 
		strBrand = "本田(奥德赛 2013-2014款)"; break;  //中客
	case hod1566: 
		strBrand = "本田(奥德赛 2015款)"; break;  
		//别克**********2000-2499***********//
	case buik2000: 
		strBrand= "别克(凯越 2007款)"; break;    
	case buik2001:
		strBrand= "别克(GL8陆尊 2008款)"; break;      
	case buik2002:
		strBrand= "别克(GL8舒适版/行政版 2011-2014款)"; break; 
	case buik2003:
		strBrand= "别克(林荫大道 2007-2011款)"; break; 
	case buik2004:
		strBrand= "别克(未知  未知)"; break; 	
	case buik2005:
		strBrand= "别克(未知  未知)"; break; 
	case buik2006: 
		strBrand= "别克(GL8豪华商务版 2011-2014款)"; break; 
	case buik2007:
		strBrand= "别克(君威 2002-2005款)"; break; 
	case buik2008:
		strBrand= "别克(未知 未知)"; break; 
	case buik2009: 
		strBrand= "别克(君威 2009-2013款)"; break; 
	case buik2010:
		strBrand= "别克(荣御 2004-2005款)"; break; 
	case buik2011:
		strBrand= "别克(凯越  2008,2011,2013款)"; break;  
	case buik2012:
		strBrand= "别克(凯越 2004-2005款)"; break;
	case buik2013:
		strBrand= "别克(凯越HRV 2005-2006,2008款)"; break;  
	case buik2014:
		strBrand= "别克(君越 2008款)"; break;      
	case buik2015: 
		strBrand= "别克(君越 2009-2012款)"; break;
	case buik2016:
		strBrand= "别克(皇朝 未知)"; break;    
	case buik2017: 
		strBrand= "别克(君越 2013款)"; break;     
	case buik2018: 
		strBrand= "别克(凯越 2007款)"; break;     
	case buik2019: 
		strBrand= "别克(英朗XT 2010-2014款)"; break;
	case buik2020:
		strBrand= "别克(英朗GT 2010-2013款)"; break;
	case buik2021: 
		strBrand= "别克(君越 2006-2007款)"; break;
	case buik2022: 
		strBrand= "别克(未知  未知)"; break;
	case buik2023: 
		strBrand= "别克(昂科拉 2013-2014款)"; break;
	case buik2024: 
		strBrand= "别克(昂科雷 2009-2014款)"; break;
	case buik2025: 
		strBrand= "别克(未知 未知)"; break;
	case buik2026: 
		strBrand= "别克(GL8 2004-2007款)"; break;
	case buik2027: 
		strBrand= "别克(君威 未知)"; break;
	case buik2028: 
		strBrand= "别克(昂科雷 2010-2013款)"; break;
	case buik2029:
		strBrand= "别克(GL8 2004款)"; break;     
	case buik2030:
		strBrand= "别克(GL8 2007款)"; break; 
	case buik2031:
		strBrand= "别克(GL8 2010款)"; break; 
	case buik2032: 
		strBrand= "别克(GL8-CT豪华商务版 2011款)"; break; 
	case buik2033:
		strBrand= "别克(GL8-CT舒适版 2011款)"; break; 
	case buik2034:
		strBrand= "别克(君威 2004-2005款)"; break;    
	case buik2035:
		strBrand= "别克(君威 2010-2012款)"; break;    
	case buik2036:
		strBrand= "别克(君越  2006-2008款)"; break;    
	case buik2037:
		strBrand= "别克(凯越 未知)"; break;   
	case buik2038:
		strBrand= "别克(凯越 2008款)"; break; 
	case buik2039:
		strBrand= "别克(凯越 2004,2007款)"; break;    
	case buik2040:
		strBrand= "别克(凯越 2013款)"; break; 
	case buik2041:
		strBrand= "别克(林荫大道 2011款)"; break; 
	case buik2042:
		strBrand= "别克(赛欧 未知)"; break;   
	case buik2043:
		strBrand= "别克(英朗 2010款)"; break; 
	case buik2044: 
		strBrand= "别克(英朗 2010-2011款)"; break;  
	case buik2045:  
		strBrand= "别克(***  ***)"; break; 
	case buik2046:  
		strBrand= "别克(GL8 2011，2013,2014款)"; break; 
	case buik2047:  
		strBrand= "别克(英朗 2010-2013款)"; break; 
	case buik2048:  
		strBrand= "别克(君威 014款)"; break; 
	case buik2049:  
		strBrand= "别克(昂克威 014款)"; break; 
		//奔驰**********2500-2999***********//
	case benz2500: 
		strBrand = "奔驰(E级 2011-2013款)"; break;
	case benz2501:
		strBrand = "奔驰(S级 2010-2012款)"; break;   
	case benz2502: 
		strBrand = "奔驰(唯雅诺 2010-2014款)"; break;   
	case benz2503: 
		strBrand = "奔驰(C级 2011-2013款)"; break;   
	case benz2504:
		strBrand = "奔驰(E级 未知)"; break;   
	case benz2505:
		strBrand = "奔驰(B级 2009-2010款)"; break;   
	case benz2506:
		strBrand = "奔驰(B级 2012-2013款)"; break;   
	case benz2507:
		strBrand = "奔驰(R级 2006-2007款)"; break;   
	case benz2508:
		strBrand = "奔驰(CLS级 2007-2009款)"; break;
	case benz2509: 
		strBrand = "奔驰(E级 2005-2008款)"; break;
	case benz2510:
		strBrand = "奔驰(R级 2010,2011,2014款)"; break;  
	case benz2511:
		strBrand = "奔驰(GLK级 2008-2012款)"; break;
	case benz2512:
		strBrand = "奔驰(S级 2004款)"; break;     
	case benz2513:
		strBrand = "奔驰(S级  未知)"; break; 	       
	case benz2514:
		strBrand = "奔驰(GL级 2006,2008,2011款)"; break;  
	case benz2515: 
		strBrand = "奔驰(CLK级 2004-2006款)"; break;
	case benz2516:
		strBrand = "奔驰(SLK级 2004-2009款)"; break;
	case benz2517: 
		strBrand = "奔驰(CLS级 2010-2013款)"; break;
	case benz2518:
		strBrand = "奔驰(M级 2005-2010款)"; break;
	case benz2519:
		strBrand = "奔驰(A级 2004,2009,2011款)"; break;  
	case benz2520:
		strBrand = "奔驰(S级 2008-2009款)"; break;
	case benz2521: 
		strBrand = "奔驰(未知1 未知)"; break;
	case benz2522:
		strBrand = "奔驰(A级 2013款)"; break;     
	case benz2523:
		strBrand = "奔驰(A级 2009-2011款)"; break;
	case benz2524:
		strBrand = "奔驰(B级 2009-2010款)"; break;    
	case benz2525: 
		strBrand = "奔驰(C级 标准/经典/优雅 2008,2010-2011,2013款)"; break; 
	case benz2526: 
		strBrand = "奔驰(C级 时尚/运动 2008,2010-2011,2013款)"; break; 
	case benz2527:
		strBrand = "奔驰(CLS3XX 2008-2009款)"; break;    
	case benz2528:
		strBrand = "奔驰(CLS350 2007款)"; break; 
	case benz2529:
		strBrand = "奔驰(E2XX/E3XX级 2006-2008款)"; break;    
	case benz2530:
		strBrand = "奔驰(E2XX/E3XX时尚 2010-2013款)"; break;    
	case benz2531:
		strBrand = "奔驰(E2XX/E3XX优雅 2010-2013款)"; break;    
	case benz2532: 
		strBrand = "奔驰(E级 2006款)"; break; 
	case benz2533:
		strBrand = "奔驰(GL450 4MATIC尊贵 2008款)"; break;      
	case benz2534: 
		strBrand = "奔驰(GL450 4MATIC经典 2008款)"; break;      
	case benz2535: 
		strBrand = "奔驰(GLK300 豪华型 2012款)"; break;      
	case benz2536:
		strBrand = "奔驰(GLK300 时尚/动感 2012-2013款)"; break; 
	case benz2537:
		strBrand = "奔驰(ML3XX 2012款)"; break;      
	case benz2538:
		strBrand = "奔驰(ML3XX/ML5XX 2008,2010款)"; break; 
	case benz2539: 
		strBrand = "奔驰(ML 2007款)"; break;      
	case benz2540: 
		strBrand = "奔驰(ML3XX/ML5XX 2006款)"; break;      
	case benz2541:
		strBrand = "奔驰(R3XX/R5XX 2009-2011款)"; break; 
	case benz2542:
		strBrand = "奔驰(R3XX/R5XX 2006-2007款)"; break; 
	case benz2543: 
		strBrand = "奔驰(S 2006款)"; break;      
	case benz2544: 
		strBrand = "奔驰(SL 2004款)"; break;      
	case benz2545:
		strBrand = "奔驰(SLK 2012款)"; break;      
	case benz2546: 
		strBrand = "奔驰(SLK 2008-2009款)"; break; 
	case benz2547:
		strBrand = "奔驰(S 2012款)"; break;      
	case benz2548:
		strBrand = "奔驰(威霆 2011,2013款)"; break; 
	case benz2549:
		strBrand = "奔驰(唯雅诺/威霆 2010款)"; break;      
	case benz2550:
		strBrand = "奔驰(M级 未知)"; break; 
	case benz2551:
		strBrand = "奔驰(威霆 未知)"; break; 
	case benz2552: 
		strBrand = "奔驰(E级（进口） 未知)"; break; 
	case benz2553: 
		strBrand = "奔驰(E级 2007款)"; break;    
	case benz2554:
		strBrand = "奔驰(M级 2010款)"; break;
	case benz2555: 
		strBrand = "奔驰(唯雅诺 2014款)"; break;    
	case benz2556:
		strBrand = "奔驰(凌特 2012款)"; break;    
	case benz2557:
		strBrand = "奔驰(R级  未知)"; break; 
	case benz2558: 
		strBrand = "奔驰(未知 未知)"; break;
	case benz2559: 
		strBrand = "奔驰(E260L 2014款)"; break;   //小客
	case benz2560: 
		strBrand = "奔驰(A级，2009,2011款)"; break;      //中客
	case benz2561: 
		strBrand = "奔驰(B级，2009款)"; break; 
	case benz2562: 
		strBrand = "奔驰(C级，2011,2013款)"; break; 
	case benz2563:
		strBrand = "奔驰(E级（进口）/E级，2006款/2005款)"; break;     
	case benz2564: 
		strBrand = "奔驰(GLK级，2013，2014款)"; break;      //中客     
	case benz2565: 
		strBrand = "奔驰(M级，2012，2014款)"; break;      //中客    
	case benz2566: 
		strBrand = "奔驰(M级，2010款)"; break;            //中客
	case benz2567:
		strBrand = "奔驰(M级，2007款)"; break;            //中客
	case benz2568: 
		strBrand = "奔驰(M级，2005,2006，2008款)"; break; //中客
	case benz2569: 
		strBrand = "奔驰(R3XX/R5XX/C级（进口），2009-2011，2014款/2011款)"; break;    //小客/中客   
	case benz2570:
		strBrand = "奔驰(S，2004款)"; break;        
	case benz2571: 
		strBrand = "奔驰(SLK/CLS级/CLS级 2011款/2013款/2012款)"; break;  //小客/中客/小客       
	case benz2572: 
		strBrand = "奔驰(SLK 2004，2009-2010款)"; break;    
	case benz2573:
		strBrand = "奔驰(S，2006,2008-2010款)"; break;    
	case benz2574: 
		strBrand = "奔驰(CLS级，2012款)"; break;        
	case benz2575: 
		strBrand = "奔驰(威霆，2011，2013款)"; break;    
	case benz2576:
		strBrand = "奔驰(E级AMG， 2007款)"; break;    
	case benz2577:
		strBrand = "奔驰(C级（进口） 2004款)"; break;
	case benz2578: 
		strBrand = "奔驰(E级（进口），1988款)"; break; 
	case benz2579: 
		strBrand = "奔驰(S级，1993款)"; break; 
	case benz2580:  strBrand = "奔驰(E级（进口），2010,2011款)"; break;   
	case benz2581: 
		strBrand = "奔驰(S级，2014款)"; break;        
	case benz2582: 
		strBrand = "奔驰(唯雅诺/唯雅诺（进口） 2012-2014款/2011款)"; break;  //小客/中客      
	case benz2583:
		strBrand = "奔驰(E级 2014-2015款)"; break;    
	case benz2584:
		strBrand = "奔驰(GL级，2014款)"; break;    //中客
	case benz2585: 
		strBrand = "奔驰(C级（进口）/S级，1993款/2008款)"; break;        
	case benz2586:
		strBrand = "奔驰(GLK级/GLK级（进口），2012款/2008款)"; break;    //中客
	case benz2587:
		strBrand = "奔驰(C级AMG，2008-2011款/2011款)"; break;  //小客/中客    
	case benz2588: 
		strBrand = "奔驰(C级/C级（进口）2011,2013款/2011款)"; break;  //小客/中客
	case benz2589:
		strBrand = "奔驰(C级/C级（进口）2008,2010款/2007款)"; break;
	case benz2590:
		strBrand = "奔驰(G级/G级AMG，2004，2007款/2007款)"; break;   //中客
	case benz2591:
		strBrand = "奔驰(C级，2013款)"; break;        
	case benz2592: 
		strBrand = "奔驰(S级 2008，2010-2012款)"; break;      
	case benz2593:
		strBrand = "奔驰(R级 2007款)"; break;      //中客 
	case benz2594: 
		strBrand = "奔驰(GL级，2011款)"; break;    //中客
	case benz2595:
		strBrand = "奔驰(唯雅诺（进口）/唯雅诺，	2010款/2011款)"; break;     //中客      
	case benz2596: 
		strBrand = "奔驰(R级，2006款)"; break;    //中客
	case benz2597: 
		strBrand = "奔驰(S级AMG，2010-2011，2012款)"; break;     
	case benz2598:
		strBrand = "奔驰(C级/C级（进口） 2008,2010款/2007，2008款)"; break;  //小客
	case benz2599: 
		strBrand = "奔驰(G级/G级AMG，2009-2011，2013款/2009-2010款)"; break;   //中客
	case benz2600:
		strBrand = "奔驰(E级(进口)，2012款)"; break;        
	case benz2601: 
		strBrand = "奔驰(C级/C级（进口） 2010款/2010款)"; break;  //小客/中客   
	case benz2602: 
		strBrand = "奔驰(GL级,2006,2008款)"; break;			//中客
	case benz2603: 
		strBrand = "奔驰(CLS级,2008-2009款)"; break;			//小客
	case benz2604: 
		strBrand = "奔驰(CLS级，2007款)"; break;
	case benz2900: 
		strBrand = "奔驰(未知 未知)"; break;   //中客
	case benz2901:
		strBrand = "奔驰(未知 未知)"; break;   //大客
		//现代**********3000-3499***********//
	case hyd3000: 
		strBrand = "北京现代(ix35 2010,2012款)"; break;   
	case hyd3001: 
		strBrand = "现代(伊兰特 2004-2005款)"; break;      
	case hyd3002: 
		strBrand = "现代(未知1 未知)"; break;     
	case hyd3003: 
		strBrand = "现代(悦动 2008,2010款)"; break;     
	case hyd3004: 
		strBrand = "现代(领翔 2009款)"; break;   
	case hyd3005: 
		strBrand = "现代(名驭 2009款)"; break;   
	case hyd3006: 
		strBrand = "现代(索纳塔八 2011,2013-2014款)"; break;   
	case hyd3007: 
		strBrand = "现代(朗动 2012-2013款)"; break;  
	case hyd3008: 
		strBrand = "现代(劳恩斯-酷派 2009-2010款)"; break; 
	case hyd3009: 
		strBrand = "现代(索纳塔 2004,2006,2008款)"; break;   
	case hyd3010: 
		strBrand = "现代(新胜达 2006款)"; break;       
	case hyd3011: 
		strBrand = "现代(瑞纳 2010-2014款)"; break; 
	case hyd3012: 
		strBrand = "现代(伊兰特 2011款)"; break;      
	case hyd3013: 
		strBrand = "现代(途胜 2006,2009款)"; break; 
	case hyd3014: 
		strBrand = "现代(未知2 未知)"; break;
	case hyd3015: 
		strBrand = "现代(美佳 2005款)"; break;      
	case hyd3016: 
		strBrand = "现代(名途 2014款)"; break;      
	case hyd3017: 
		strBrand = "现代(圣达菲 2004款)"; break;      
	case hyd3018: 
		strBrand = "现代(酷派 2006款)"; break;      
	case hyd3019: 
		strBrand = "现代(全新胜达 2013款)"; break;      
	case hyd3020: 
		strBrand = "现代(途胜 2013款)"; break;      
	case hyd3021:
		strBrand = "北京现代(ix35 2013款)"; break;      
	case hyd3022: 
		strBrand = "现代(御翔 2005款)"; break;  
	case hyd3023: 
		strBrand = "现代(未知3 未知)"; break;
	case hyd3024:
		strBrand = "现代(雅科仕 2009,2012款)"; break;
	case hyd3025:
		strBrand = "现代(雅尊 2011款)"; break;      
	case hyd3026: 
		strBrand = "现代(i20 2009款)"; break;      
	case hyd3027:
		strBrand = "现代(伊兰特 2007款)"; break;      
	case hyd3028:
		strBrand = "现代(新胜达 2011-2012款)"; break; 
	case hyd3029:
		strBrand = "现代(悦动 2011款)"; break;      
	case hyd3030:
		strBrand = "现代(雅绅特 2006,2008款)"; break;
	case hyd3031: 
		strBrand = "现代(酷派 2004款)"; break;      
	case hyd3032:
		strBrand = "北京现代(i30 2009款)"; break;      
	case hyd3033:
		strBrand = "现代(全新胜达 2007款)"; break;      
	case hyd3034:
		strBrand = "现代(全新胜达 2011-2012款)"; break; 
	case hyd3035:
		strBrand = "现代(索纳塔 2004-2006款)"; break; 
	case hyd3036:
		strBrand = "现代(索纳塔八 2010-2014款)"; break; 
	case hyd3037:
		strBrand = "现代(途胜 2006-2009款)"; break; 
	case hyd3038:
		strBrand = "现代(维拉克斯 2007-2012款)"; break; 
	case hyd3039:
		strBrand = "北京现代(ix35 2010-2012款)"; break; 
	case hyd3040:
		strBrand = "现代(悦动 2008-2010款)"; break; 
	case hyd3041:
		strBrand = "现代(伊兰特 2007-2011款)"; break; 
	case hyd3042:
		strBrand = "现代(雅绅特 2006-2008款)"; break; 
	case hyd3043:
		strBrand = "现代(雅绅特 2011款)"; break;      
	case hyd3044:
		strBrand = "现代(雅尊 2006-2010款)"; break; 
	case hyd3045:
		strBrand = "现代(H-1辉翼 2011款)"; break;  
	case hyd3046:
		strBrand = "现代(酷派 未知)"; break;
	case hyd3047:   
		strBrand = "现代(***  ***)"; break;
	case hyd3048:  
		strBrand = "现代(索纳塔，2004款)"; break; 
	case hyd3049:  
		strBrand = "现代(瑞纳，2014款)"; break; 
	case hyd3050:  
		strBrand = "现代(索纳塔八, 2013-2014款)"; break; 
	case hyd3051:   
		strBrand = "现代(维拉克斯,2007,2009款)"; break;
	case hyd3052:   
		strBrand = "现代(Santafe 未知)"; break;
	case hyd3400:
		strBrand = "现代(未知 未知)"; break;  //中客
		//福特**********3500-3999***********//
	case ford3500: 
		strBrand = "福特(福克斯三厢经典 2009-2012款)"; break;       
	case ford3501: 
		strBrand = "福特(福克斯两厢经典 2006-2012款)"; break;    
	case ford3502: 
		strBrand = "福特(Windstar 未知)"; break;   
	case ford3503: 
		strBrand = "福特(福克斯三厢 2012款)"; break; 
	case ford3504: 
		strBrand = "福特(嘉年华 2004-2006款)"; break;    
	case ford3505: 
		strBrand = "福特(福克斯两厢 2012款)"; break; 
	case ford3506: 
		strBrand = "福特(蒙迪欧-制胜 2007-2010款)"; break;    
	case ford3507: 
		strBrand = "福特(全顺 2009,2013款)"; break;   
	case ford3508: 
		strBrand = "福特(蒙迪欧 2004-2006款)"; break;    
	case ford3509: 
		strBrand = "福特(全新新时代全顺 2013款)"; break; 
	case ford3510: 
		strBrand = "福特(嘉年华两厢 2009-2014款)"; break;    
	case ford3511: 
		strBrand = "福特(嘉年华三厢 2009,2011款)"; break;   
	case ford3512: 
		strBrand = "福特(蒙迪欧 2013款)"; break; 
	case ford3513: 
		strBrand = "福特(嘉年华三厢 2013款)"; break; 
	case ford3514: 
		strBrand = "福特(麦柯斯 2007-2008款)"; break;    
	case ford3515: 
		strBrand = "福特(翼虎 2013款)"; break;  
	case ford3516: 
		strBrand = "福特(锐界 2011-2012款)"; break;    
	case ford3517: 
		strBrand = "福特(翼博  2013款)"; break; 
	case ford3518: 
		strBrand = "福特(福克斯三厢 2005-2007款)"; break;    
	case ford3519: 
		strBrand = "福特(福克斯 2005-2007款)"; break;    
	case ford3520: 
		strBrand = "福特(福克斯 2009,2011款)"; break;   
	case ford3521: 
		strBrand = "福特(福克斯 2012款)"; break; 
	case ford3522: 
		strBrand = "福特(福克斯 2013款)"; break;
	case ford3523: 
		strBrand = "福特(嘉年华 2009-2011款)"; break;    
	case ford3524: 
		strBrand = "福特(蒙迪欧 2004款)"; break; 
	case ford3525: 
		strBrand = "福特(经典全顺 2009,2013款)"; break;   
	case ford3526: 
		strBrand = "福特(未知 未知)"; break;   
	case ford3527: 
		strBrand = "福特(蒙迪欧 2006款)"; break; 
	case ford3528: 
		strBrand = "福特(蒙迪欧-致胜 2008,2010款)"; break;   
	case ford3529: 
		strBrand = "福特(致胜 2013款)"; break; 
	case ford3530: 
		strBrand = "福特(嘉年华 2014款)"; break; 
	case ford3531: 
		strBrand = "福特(新世代全顺 2009,2013款)"; break;   
	case ford3532: 
		strBrand = "福特(福克斯(进口) 1998款)"; break; 
	case ford3533: 
		strBrand = "福特(福瑞斯 2014款)"; break; 
	case ford3534: 
		strBrand = "福特(征服者 2012,2015款)"; break;
	case ford3535:   
		strBrand = "福特(***  ***)"; break;
	case ford3536:  
		strBrand = "福特(探险者 2011-2013款)"; break;			//中客
	case ford3537:   
		strBrand = "福特(赛拉图 2010款)"; break;   
	case ford3538:
		strBrand = "福特(嘉年华 运动型 2009-2012款)"; break;			//小客
	case ford3539:	
		strBrand = "福特(福克斯 两厢 2013款)"; break;				//小客
	case ford3540:
		strBrand = "福特(蒙迪欧-致胜 运动版	2007-2008,2010款)"; break;	//小客
	case ford3900:
		strBrand = "福特(未知  未知)"; break;     //中客
		//起亚**********4000-4499***********//
	case kia4000: 
		strBrand = "起亚(索兰托 2009,2010,2012款)"; break;      
	case kia4001: 
		strBrand = "起亚(赛拉图 2005-2012款)"; break;   
	case kia4002: 
		strBrand = "起亚(福瑞迪 2009,2011,2012款)"; break;     
	case kia4003: 
		strBrand = "起亚(智跑 2011-2012款)"; break;   
	case kia4004: 
		strBrand = "起亚(K5  2011-2012款)"; break;   
	case kia4005: 
		strBrand = "起亚(K2三厢 2011-2012款)"; break;   
	case kia4006: 
		strBrand = "起亚(狮跑 2007-2012款)"; break;   
	case kia4007: 
		strBrand = "起亚(速迈 2010,2011,2013款)"; break; 
	case kia4008: 
		strBrand = "起亚(K3 2013款)"; break;    
	case kia4009: 
		strBrand = "起亚(凯尊 2011-2012款)"; break;
	case kia4010: 
		strBrand = "起亚(千里马 2004-2006款)"; break;       
	case kia4011: 
		strBrand = "起亚(欧菲莱斯 2007-2008款)"; break;      
	case kia4012: 
		strBrand = "起亚(嘉华 2004,2006款)"; break;      
	case kia4013: 
		strBrand = "起亚(佳乐 2013款)"; break;   
	case kia4014: 
		strBrand = "起亚(佳乐 2005款)"; break;   
	case kia4015: 
		strBrand = "起亚(佳乐 2007,2011款)"; break;      
	case kia4016: 
		strBrand = "起亚(狮跑 2013款)"; break;       
	case kia4017: 
		strBrand = "起亚(锐欧 2005-2007款)"; break;  
	case kia4018: 
		strBrand = "起亚(赛拉图欧风 2008款)"; break;       
	case kia4019: 
		strBrand = "起亚(远舰 2005款)"; break;       
	case kia4020: 
		strBrand = "起亚(智跑 2014款)"; break;       
	case kia4021: 
		strBrand = "起亚(索兰托 2013款)"; break;       
	case kia4022: 
		strBrand = "起亚(未知1 未知)"; break; 	      
	case kia4023: 
		strBrand = "起亚(K5 2011-2014款)"; break;  
	case kia4024: 
		strBrand = "起亚(VQ 2006款)"; break;      
	case kia4025: 
		strBrand = "起亚(佳乐 2007款)"; break;    
	case kia4026: 
		strBrand = "起亚(佳乐 2011款)"; break;    
	case kia4027: 
		strBrand = "起亚(嘉华 2004款)"; break;    
	case kia4028: 
		strBrand = "起亚(嘉华 2006款)"; break;    
	case kia4029: 
		strBrand = "起亚(千里马MT 2004款)"; break;    
	case kia4030: 
		strBrand = "起亚(锐欧 2007款)"; break;    
	case kia4031: 
		strBrand = "起亚(赛拉图 2005款)"; break;     
	case kia4032: 
		strBrand = "起亚(赛拉图 2007,2010款)"; break;  
	case kia4033: 
		strBrand = "起亚(赛拉图 2008,2012款)"; break;  
	case kia4034: 
		strBrand = "起亚(狮跑 2009,2011款)"; break;  
	case kia4035: 
		strBrand = "起亚(狮跑 2012-2013款)"; break;   
	case kia4036: 
		strBrand = "起亚(索兰托 2010款)"; break;    
	case kia4037:
		strBrand = "起亚(索兰托 2004款)"; break;    
	case kia4038: 
		strBrand = "起亚(索兰托 2009款 2012款)"; break;     
	case kia4039: 
		strBrand = "起亚(秀尔 2010款)"; break;
	case kia4040: 
		strBrand = "起亚(秀尔 2012-2013款)"; break;   
	case kia4041: 
		strBrand = "起亚(智跑 2011-2014款)"; break;   
	case kia4042: 
		strBrand = "起亚(未知2 未知)"; break;	 
	case kia4043: 
		strBrand = "起亚(Picanto 2008款)"; break;
	case kia4044: 
		strBrand = "起亚(未知3 未知)"; break; 	 
	case kia4045: 
		strBrand = "起亚(未知4 未知)"; break;  
	case kia4046: 
		strBrand = "起亚(未知5 未知)"; break; 	
	case kia4047: 
		strBrand = "起亚(凯尊 2013款)"; break;
	case kia4048: 
		strBrand = "起亚(未知6 未知)"; break;
	case kia4049:
		strBrand = "起亚(*** ***)"; break;
	case kia4050:  
		strBrand = "起亚(狮跑 2007款)"; break;   //中客
	case kia4051:  
		strBrand = "起亚(赛拉图 2010款)"; break;		//小客
	case kia4052:  
		strBrand = "起亚(福瑞迪	2014款)"; break;		//小客
	case kia4053:  
		strBrand = "起亚(K5	2014款)"; break;		//小客
		//马自达**********4500-4999***********//
	case mzd4500: 
		strBrand = "马自达(马6 2004-2013款 9)"; break;
	case mzd4501: 
		strBrand = "马自达(马3 2006-2012款)"; break; 
	case mzd4502: 
		strBrand = "马自达(马6（进口）Wagon基本型 2009,2011款)"; break;   
	case mzd4503: 
		strBrand = "马自达(马2 2007-2012款)"; break;
	case mzd4504: 
		strBrand = "马自达(未知1 未知)"; break; 
	case mzd4505: 
		strBrand = "马自达(马8 2011,2013款)"; break;
	case mzd4506: 
		strBrand = "马自达(323 1998-2003款)"; break; 
	case mzd4507: 
		strBrand = "马自达(马5 2011-2013款)"; break;    
	case mzd4508: 
		strBrand = "马自达(马5 2008,2010款)"; break;   
	case mzd4509: 
		strBrand = "马自达(CX-5 2013-2014款)"; break;    
	case mzd4510: 
		strBrand = "马自达(PREMACY 2000-2001款)"; break;
	case mzd4511: 
		strBrand = "马自达(CX-72008 2010-2011款)"; break;   
	case mzd4512: 
		strBrand = "马自达(未知2 未知)"; break;	       
	case mzd4513: 
		strBrand = "马自达(未知3 未知)"; break;	       
	case mzd4514: 
		strBrand = "马自达(未知4 未知)"; break;	       
	case mzd4515: 
		strBrand = "马自达(马3星骋 2011-2013款)"; break;
	case mzd4516: 
		strBrand = "马自达(马2劲翔 2008,2011款)"; break;       
	case mzd4517: 
		strBrand = "马自达(未知 未知)"; break;	       
	case mzd4518: 
		strBrand = "马自达(马2 2007-2009,2011款)"; break;  
	case mzd4519: 
		strBrand = "马自达(马3 2007,2009款)"; break;       
	case mzd4520: 
		strBrand = "马自达(马3 2010,2012款)"; break;       
	case mzd4521: 
		strBrand = "马自达(马6 2004,2006-2008款)"; break;  
	case mzd4522: 
		strBrand = "马自达(马6 2011-2014款)"; break;
	case mzd4523: 
		strBrand = "马自达(睿翼 2009,2010款)"; break;      
	case mzd4524: 
		strBrand = "马自达(睿翼 2011,2012款)"; break;      
	case mzd4525: 
		strBrand = "马自达(马3 2006款)"; break;
	case mzd4526: 
		strBrand = "马自达(马6 未知)"; break;	 
	case mzd4527: 
		strBrand = "马自达(睿翼 未知)"; break;			 
	case mzd4528:
		strBrand = "马自达(未知5 未知)"; break;  
	case mzd4529: 
		strBrand = "马自达(未知6 未知)"; break;	 
	case mzd4530:
		strBrand = "马自达(马3昂克赛拉/马6阿特兹 2014款)"; break;
	case mzd4531: 
		strBrand = "马自达(CX-7（进口） 2010,2011款)"; break;  
	case mzd4532:
		strBrand = "马自达(未知7 未知)"; break;	 
	case mzd4533:
		strBrand = "马自达(未知8 未知)"; break; 
	case mzd4534:   
		strBrand = "马自达(***  ***)"; break; 
	case mzd4535:  
		strBrand = "马自达(马3（进口两厢）2008款)"; break;    //小客
	case mzd4536:  
		strBrand = "马自达(睿翼	2012款)"; break; 		//小客
		//日产**********5000-5499***********//
	case nis5000:
		strBrand = "日产(蓝鸟 未知)"; break;	  
	case nis5001: 
		strBrand = "日产(西玛 2004款)"; break;    
	case nis5002:
		strBrand = "日产(NV200 2010-2014款)"; break;       
	case nis5003:
		strBrand = "日产(R50 未知)"; break;       
	case nis5004:
		strBrand = "日产(骊威 2007-2010款)"; break;       
	case nis5005: 
		strBrand = "日产(蓝鸟 未知)"; break;       
	case nis5006:
		strBrand = "日产(天籁 2005-2007款)"; break;       
	case nis5007: 
		strBrand = "日产(颐达 2005-2006款)"; break;       
	case nis5008:
		strBrand = "日产(奇骏 2008,2010,2012款)"; break; 
	case nis5009:
		strBrand = "日产(天籁 2013-2014款)"; break;       
	case nis5010:
		strBrand = "日产(D22 未知)"; break;       
	case nis5011: 
		strBrand = "日产(D22 未知)"; break; 
	case nis5012: 
		strBrand = "日产(骊威 2013款)"; break;
	case nis5013:
		strBrand = "日产(骐达 2008款)"; break;
	case nis5014: 
		strBrand = "日产(阳光 2011-2014款)"; break;   
	case nis5015: 
		strBrand = "日产(轩逸 2006-2008款)"; break;	
	case nis5016:
		strBrand = "日产(天籁 2008款)"; break;
	case nis5017: 
		strBrand = "日产(逍客 2008-2013款)"; break;   
	case nis5018: 
		strBrand = "日产(轩逸 2009款)"; break;
	case nis5019: 
		strBrand = "日产(骐达 2005-2006款)"; break;   
	case nis5020:
		strBrand = "日产(玛驰 2010款)"; break;
	case nis5021:
		strBrand = "日产(骐达 2011-2013款)"; break;   
	case nis5022: 
		strBrand = "日产(风度 2004款)"; break;       
	case nis5023: 
		strBrand = "日产(颐达 2008款)"; break;
	case nis5024:
		strBrand = "日产(天籁 2011-2012款)"; break;   
	case nis5025:
		strBrand = "日产(奥丁 2007-2013款)"; break;  
	case nis5026:
		strBrand = "日产(阳光 2004-2005款)"; break;   
	case nis5027:
		strBrand = "日产(轩逸 2012-2014款)"; break;   
	case nis5028: 
		strBrand = "日产(蓝鸟 2004款)"; break;       
	case nis5029: 
		strBrand = "日产(阳光 未知)"; break;  
	case nis5030: 
		strBrand = "日产(帕拉丁 2004-2006款)"; break; 
	case nis5031:
		strBrand = "日产(D50 2012-2014款)"; break;  
	case nis5032:
		strBrand = "日产(御轩 未知)"; break; 
	case nis5033:
		strBrand = "日产(未知1 未知)"; break;	
	case nis5034: 
		strBrand = "日产(未知2 未知)"; break;       
	case nis5035:
		strBrand = "日产(ZN/D22 2012款/2011,2013款)"; break;
	case nis5036:
		strBrand = "日产(骏逸 2006款)"; break;     
	case nis5037:
		strBrand = "日产(蓝鸟至尊 2004款)"; break;    
	case nis5038:
		strBrand = "日产(骊威 2007-2008款)"; break;      
	case nis5039:
		strBrand = "日产(骊威 2009款)"; break;    
	case nis5040: 
		strBrand = "日产(骊威 2010款)"; break;    
	case nis5041:
		strBrand = "日产(骊威 2013款)"; break;     
	case nis5042:
		strBrand = "日产(帕拉丁 2004,2006,2013款)"; break; 
	case nis5043: 
		strBrand = "日产(奇骏 2010款)"; break;     
	case nis5044:
		strBrand = "日产(奇骏 2012款)"; break;     
	case nis5045:
		strBrand = "日产(天籁 2004,2006,2007款)"; break; 
	case nis5046:
		strBrand = "日产(逍客 2008,2010款)"; break;  
	case nis5047:
		strBrand = "日产(逍客 2011-2013款)"; break;   
	case nis5048:
		strBrand = "日产(阳光 2004款)"; break;
	case nis5049:
		strBrand = "日产(阳光 2005款)"; break;
	case nis5050:
		strBrand = "日产(阳光 2011款)"; break;
	case nis5051:
		strBrand = "日产(ZN厢式车 2012款)"; break;     
	case nis5052: 
		strBrand = "日产(蓝鸟自动旗舰型 2004款)"; break;     
	case nis5053: 
		strBrand = "日产(贵士 2005款)"; break;     
	case nis5054:
		strBrand = "日产(贵士 2006款)"; break;     
	case nis5055:
		strBrand = "日产(玛驰(海外) 2011款)"; break;     
	case nis5056:
		strBrand = "日产(逍客 未知)"; break;       
	case nis5057:
		strBrand = "日产(骏逸 未知)"; break;
	case nis5058:
		strBrand = "日产(未知 未知)"; break;
	case nis5059:   
		strBrand = "日产(***  ***)"; break;
	case nis5060: 
		strBrand = "日产(楼兰 2011-2013款)"; break;  //中客
	case nis5061: 
		strBrand = "日产(NP300 2013款)"; break;
	case nis5062:  
		strBrand = "日产(阳光 2014款)"; break;
	case nis5063:  
		strBrand = "日产(逍客（带保险杠）2011-2013款)"; break;
	case nis5064: 
		strBrand = "日产(奇骏（带保险杠）2012款)"; break;   //中客
	case nis5065: 
		strBrand = "日产(未知 未知)"; break;    //中客
	case nis5066: 
		strBrand = "日产(风雅 2005-2007款)"; break;
	case nis5067: 
		strBrand = "日产(风度 1998款)"; break;
	case nis5068: 
		strBrand = "日产(奇骏 2014款)"; break;
	case nis5069: 
		strBrand = "日产(蓝鸟 2014款)"; break;
	case nis5070: 
		strBrand = "日产(天籁荣耀版 2011-2012款)"; break;
	case nis5400:
		strBrand = "日产尼桑(未知 未知)"; break;   //大货
		//标志**********5500-5999***********//
	case peu5500: 
		strBrand = "标致(207 2009-2011,2013款)"; break; 
	case peu5501:
		strBrand = "标致(206 2004-2008款)"; break;   
	case peu5502:
		strBrand = "标致(408 2011-2012款)"; break;   
	case peu5503:
		strBrand = "标致(307 2004-2007款)"; break;   
	case peu5504:
		strBrand = "标致(307 2008-2013款)"; break;   
	case peu5505:
		strBrand = "标致(308 2012-2014款)"; break;   
	case peu5506:
		strBrand = "标致(408 2013-2014款)"; break;   
	case peu5507:
		strBrand = "标致(508 2011-2014款)"; break;    
	case peu5508:
		strBrand = "标致(3008 2013-2014款)"; break;    
	case peu5509: 
		strBrand = "标致(308 2012款)"; break; 
	case peu5510: 
		strBrand = "标致(未知 未知)"; break;	   
	case peu5511: 
		strBrand = "标致(未知 未知)"; break;   
	case peu5512: 
		strBrand = "标致(DS DS5 DS4进口 2012款 )"; break; 
	case peu5513: 
		strBrand = "标致(207 2009-2010款)"; break;    
	case peu5514: 
		strBrand = "标致(307 2004-2006款)"; break;    
	case peu5515: 
		strBrand = "标致(307 2009,2010,2012款)"; break; 
	case peu5516: 
		strBrand = "标致(408 2010-2013款)"; break;       
	case peu5517: 
		strBrand = "标致(3008（进口） 2011款)"; break;    
	case peu5518: 
		strBrand = "标致(3008 2013款)"; break;    
	case peu5519: 
		strBrand = "标致(207 未知)"; break;     
	case peu5520: 
		strBrand = "标致(408 未知)"; break;     
	case peu5521: 
		strBrand = "标致(207 2011,2013款)"; break;  
	case peu5522:   
		strBrand = "标致(***  ***)"; break; 
	case peu5523:  
		strBrand = "标致(标致301 2014款)"; break; 			//小客
	case peu5524:  
		strBrand = "标致(标致207（进口）2011-2013款)"; break; 		//小客
	case peu5525:  
		strBrand = "标致(标致2008 2014款)"; break;           //中客
	case peu5526:  
		strBrand = "标致(标致307CROSS 2011-2013款)"; break; 		//小客
		//丰田**********6000-6499***********//
	case toy6000:
		strBrand = "丰田(rav4（5594） 2013款)"; break;      
	case toy6001:
		strBrand = "丰田(未知1 未知)"; break;	
	case toy6002:
		strBrand = "丰田(未知2 未知)"; break;    
	case toy6003:
		strBrand = "丰田(汉兰达 2011,2013款)"; break;     
	case toy6004:
		strBrand = "丰田(雅力士 2008,2009,2011款)"; break;
	case toy6005: 
		strBrand = "丰田(未知3 未知)"; break;    
	case toy6006: 
		strBrand = "丰田(rav4 2009-2012款)"; break;    
	case toy6007:
		strBrand = "丰田(逸致 2011-2014款)"; break;     
	case toy6008:
		strBrand = "丰田(普瑞维亚 2006-2007款)"; break;     
	case toy6009:
		strBrand = "丰田(未知4 未知)"; break;    
	case toy6010:
		strBrand = "丰田(威驰 2006款)"; break;  
	case toy6011:
		strBrand = "丰田(威驰 2008-2014款)"; break;     
	case toy6012:
		strBrand = "丰田(卡罗拉 2011-2013款)"; break;     
	case toy6013:
		strBrand = "丰田(花冠 2013款)"; break;  
	case toy6014:
		strBrand = "丰田(凯美瑞 2006-2011款)"; break;     
	case toy6015:
		strBrand = "丰田(普拉多 2010款)"; break;       
	case toy6016:
		strBrand = "丰田(未知5  未知)"; break; 
	case toy6017:
		strBrand = "丰田(凯美瑞进口 2005款)"; break;       
	case toy6018:
		strBrand = "丰田(凯美瑞进口 2010款)"; break;       
	case toy6019:
		strBrand = "丰田(锐志 2013款)"; break;       
	case toy6020:
		strBrand = "丰田(威驰 2014款)"; break;     
	case toy6021:
		strBrand = "丰田(卡罗拉进口 2009款)"; break;     
	case toy6022:
		strBrand = "丰田(锐志 2012款)"; break;       
	case toy6023:
		strBrand = "丰田(锐志 2007-2009款)"; break;  
	case toy6024: 
		strBrand = "丰田(花冠 2007款)"; break;       
	case toy6025: 
		strBrand = "丰田(凯美瑞 2012款)"; break;       
	case toy6026: 
		strBrand = "丰田(花冠 2010-2011款)"; break;  
	case toy6027: 
		strBrand = "丰田(皇冠 2005款)"; break;       
	case toy6028: 
		strBrand = "丰田(卡罗拉 2007-2009款)"; break;  
	case toy6029: 
		strBrand = "丰田(锐志 2005-2006款)"; break;  
	case toy6030: 
		strBrand = "丰田(sienna 2013款)"; break;      
	case toy6031: 
		strBrand = "丰田(凯美瑞 2005款)"; break;       
	case toy6032: 
		strBrand = "丰田(YARiS 2007-2009款)"; break;
	case toy6033: 
		strBrand = "丰田(FT-86 2013款)"; break;      
	case toy6034: 
		strBrand = "丰田(汉兰达 2012款)"; break;       
	case toy6035:
		strBrand = "丰田(未知6 未知)"; break; 
	case toy6036:
		strBrand = "丰田(威驰 2004-2005款)"; break;  
	case toy6037:
		strBrand = "丰田(86进口 2012-2014款)"; break;   
	case toy6038: 
		strBrand = "丰田(未知7 未知)"; break; 
	case toy6039: 
		strBrand = "丰田(埃尔法 2011款)"; break;       
	case toy6040: 
		strBrand = "丰田(AVALON 未知)"; break; 
	case toy6041:
		strBrand = "丰田(未知8 未知)"; break; 
	case toy6042:
		strBrand = "丰田(卡罗拉 未知)"; break;
	case toy6043: 
		strBrand = "丰田(普锐斯 2006款)"; break;      
	case toy6044:
		strBrand = "丰田(未知9 未知)"; break; 
	case toy6045: 
		strBrand = "丰田(埃尔法 2011款)"; break;       
	case toy6046:
		strBrand = "丰田(雅力士 2008-2011款)"; break;  
	case toy6047:
		strBrand = "丰田(普拉多进口 2014款)"; break;
	case toy6048:
		strBrand = "丰田(RAV4进口 2004款)"; break;       
	case toy6049:
		strBrand = "丰田(HIACE 2011款)"; break;      
	case toy6050: 
		strBrand = "丰田(未知10 未知)"; break; 
	case toy6051:
		strBrand = "丰田(汉兰达 2012款)"; break;       
	case toy6052:
		strBrand = "丰田(普锐斯 2013款)"; break;       
	case toy6053:
		strBrand = "丰田(普锐斯 2012款)"; break;       
	case toy6054:
		strBrand = "丰田(普瑞维亚 2004款)"; break;       
	case toy6055:
		strBrand = "丰田(凯美瑞 2012款)"; break;       
	case toy6056:
		strBrand = "丰田(锐志 2010-2012款)"; break;  
	case toy6057:
		strBrand = "丰田(锐志 2010款)"; break;       
	case toy6058:
		strBrand = "丰田(花冠 2004-2007款)"; break;  
	case toy6059: 
		strBrand = "丰田(RAV4 2010款)"; break;      
	case toy6060:
		strBrand = "丰田(RAV4 2012-2013款)"; break; 
	case toy6061:
		strBrand = "丰田(埃尔法 2011-2012款)"; break;   
	case toy6062:
		strBrand = "丰田(汉兰达 2009-2011款)"; break;   
	case toy6063:
		strBrand = "丰田(汉兰达 2012-2013款)"; break;   
	case toy6064:
		strBrand = "丰田(花冠 2004款)"; break;      
	case toy6065:
		strBrand = "丰田(花冠 2007-2009款)"; break; 
	case toy6066:
		strBrand = "丰田(凯美瑞 2006-2008款)"; break; 
	case toy6067:
		strBrand = "丰田(凯美瑞 2009-2012款)"; break; 
	case toy6068:
		strBrand = "丰田(凯美瑞case 2012-2013款)"; break; 
	case toy6069:
		strBrand = "丰田(兰德酷路泽 2007-2012款)"; break; 
	case toy6070:
		strBrand = "丰田(普拉多 2004-2006款)"; break; 
	case toy6071:
		strBrand = "丰田(普拉多 2010款)"; break;     
	case toy6072:
		strBrand = "丰田(普瑞维亚 2006-2007,2012款)"; break;  
	case toy6073:
		strBrand = "丰田(锐志 2010-2012款)"; break;
	case toy6074:
		strBrand = "丰田(雅力士 2008-2009款)"; break;
	case toy6075:
		strBrand = "丰田(雅力士 2011款)"; break; 
	case toy6076:
		strBrand = "丰田(威驰 2008款)"; break; 
	case toy6077:
		strBrand = "丰田(威驰 2004款)"; break; 
	case toy6078:
		strBrand = "丰田(威驰 2005-2006款)"; break;    
	case toy6079:
		strBrand = "丰田(Sienna 2011-2013款)"; break;    
	case toy6080:
		strBrand = "丰田(RAV4 2009,2011款)"; break;   
	case toy6081:
		strBrand = "丰田(花冠 2004款)"; break; 
	case toy6082:
		strBrand = "丰田(Verso 2013-2014款)"; break; 
	case toy6083:  
		strBrand = "丰田(***  ***)"; break; 
	case toy6084:  
		strBrand = "丰田(YARiS	2009款)"; break;    //小客
	case toy6085: 
		strBrand = "丰田(RAV4 特享版/炫装版（带保险杠）2012-2013)"; break; 		//中客
	case toy6086: 
		strBrand = "丰田(凯美瑞（海外）2005款)"; break; 			//小客
	case toy6087: 
		strBrand = "丰田(未知 未知)"; break; 
	case toy6088: 
		strBrand = "丰田(凯美瑞	未知)"; break; 			//小客	
	case toy6089:  
		strBrand = "丰田(锐志 风度版 2010款)"; break; 			//小客
	case toy6090:  
		strBrand = "丰田(Avensis 2009款)"; break; 			//小客
	case toy6091:  
		strBrand = "丰田(威驰 2011-2013款)"; break; 		//小客
	case toy6092: 
		strBrand = "丰田(普拉多	2014款)"; break; 			//中客
	case toy6093:  
		strBrand = "丰田(凯美瑞骏瑞	2012款)"; break; 			//小客
	case toy6094:  
		strBrand = "丰田(普锐斯	未知)"; break; 			//小客
	case toy6095:  
		strBrand = "丰田(卡罗拉（海外）未知)"; break; 			//小客
	case toy6096:   
		strBrand = "丰田(普锐斯	2005-2006款)"; break; 		//小客
	case toy6097:  
		strBrand = "丰田(凯美瑞2.0\2.5 2012-2013款)"; break; 		//小客
	case toy6098:  
		strBrand = "丰田(RAV4 未知)"; break; 			//中客
	case toy6099:  
		strBrand = "丰田(普瑞维亚 未知)"; break; 			//小客
	case toy6100:  
		strBrand = "丰田(锐志（海外）基本型	2010款)"; break; 			//小客
	case toy6101:  
		strBrand = "丰田(锐志 风尚版 2010款)"; break; 			//小客
	case toy6102:  
		strBrand = "丰田(RAV4 2013款)"; break; 			//中客
	case toy6103:  
		strBrand = "丰田(雷凌 2014款)"; break; 			//
	case toy6104:  
		strBrand = "丰田(卡罗拉 2011-2013款)"; break; 			//
	case toy6105:  
		strBrand = "丰田(兰德酷路泽 2012款)"; break; 			//
	case toy6106:  
		strBrand = "丰田(卡罗拉 2014款)"; break; 			//
	case toy6400:   
		strBrand = "丰田(未知 未知)"; break;    //中客
	case toy6401:       
		strBrand = "丰田(未知 未知)"; break;    //大客

		//雪佛兰**********6500-6999***********//
	case che6500:
		strBrand = "雪佛兰(景程 2005-2006款)"; break;    
	case che6501:
		strBrand = "雪佛兰(赛欧 2010-2013款)"; break;     
	case che6502: 
		strBrand = "雪佛兰(景程 2005-2006款)"; break;     
	case che6503:
		strBrand = "雪佛兰(景程 2011-2012款)"; break;     
	case che6504:
		strBrand = "雪佛兰(科鲁兹 2011,2014款)"; break;     
	case che6505: 
		strBrand = "雪佛兰(科鲁兹 2012款)"; break;  
	case che6506:
		strBrand = "雪佛兰(景程 2010款)"; break;  
	case che6507: 
		strBrand = "雪佛兰(科帕奇 2012-2014款)"; break;     
	case che6508: 
		strBrand = "雪佛兰(乐风 2006-2008款)"; break;     
	case che6509:
		strBrand = "雪佛兰(爱唯欧 2013款)"; break;  
	case che6510:
		strBrand = "雪佛兰(乐聘 2008款)"; break;  
	case che6511:
		strBrand = "雪佛兰(爱唯欧 2011款)"; break;  
	case che6512:
		strBrand = "雪佛兰(迈瑞宝 2012-2014款)"; break;     
	case che6513: 
		strBrand = "雪佛兰(未知1 未知)"; break;	 
	case che6514: 
		strBrand = "雪佛兰(赛欧 2005款)"; break; 
	case che6515: 
		strBrand = "雪佛兰(乐聘 2005款)"; break; 
	case che6516: 
		strBrand = "雪佛兰(赛欧 2005款)"; break; 
	case che6517: 
		strBrand = "雪佛兰(赛欧 2004款)"; break; 
	case che6518: 
		strBrand = "雪佛兰(未知2 未知)"; break;  
	case che6519: 
		strBrand = "雪佛兰(未知3 未知)"; break;  
	case che6520: 
		strBrand = "雪佛兰(未知4 未知)"; break;	 
	case che6521: 
		strBrand = "雪佛兰(科鲁兹 2013款)"; break;       
	case che6522: 
		strBrand = "雪佛兰(爱唯欧 2011,2013款)"; break;  
	case che6523: 
		strBrand = "雪佛兰(景程舒适/豪华 2007-2012款)"; break; 
	case che6524: 
		strBrand = "雪佛兰(科鲁兹 2009,2011-2014款)"; break;   
	case che6525: 
		strBrand = "雪佛兰(乐骋 2008,2010款)"; break;
	case che6526: 
		strBrand = "雪佛兰(乐风 2009-2010款)"; break; 
	case che6527: 
		strBrand = "雪佛兰(赛欧 2004-2005款)"; break; 
	case che6528: 
		strBrand = "雪佛兰(赛欧 2010,2011,2013款)"; break;   
	case che6529: 
		strBrand = "雪佛兰(迈瑞宝 未知)"; break;    
	case che6530: 
		strBrand = "雪佛兰(景程致真版/行政版 2007-2012款)"; break; 
	case che6531: 
		strBrand = "雪佛兰(科帕奇 未知)"; break;   
	case che6532:  
		strBrand = "雪佛兰(***  ***)"; break;
	case che6533:  
		strBrand = "雪佛兰(景程 2013款)"; break;
	case che6534: 
		strBrand = "雪佛兰(赛欧 未知)"; break;					//小客
	case che6535:  
		strBrand = "雪佛兰(科鲁兹 2009，2011-2013款)"; break;		//小客
	case che6536:
		strBrand = "雪佛兰(斯帕可 2011款)"; break;					//小客
	case che6537: 
		strBrand = "雪佛兰(科鲁兹 未知)"; break;					//小客
	case che6538: 
		strBrand = "雪佛兰(科迈罗 2012款)"; break;					//小客
		//雪铁龙**********7000-7499***********//
	case cit7000:
		strBrand = "雪铁龙(未知 未知)"; break;	  
	case cit7001:
		strBrand = "雪铁龙(世嘉 2010款)"; break; 
	case cit7002:
		strBrand = "雪铁龙(C5 2010-2012款)"; break;   
	case cit7003:
		strBrand = "雪铁龙(凯旋 2006-2010款)"; break;   
	case cit7004:
		strBrand = "雪铁龙(C4L 2013-2014款)"; break;  
	case cit7005:
		strBrand = "雪铁龙(世嘉 2011-2013款)"; break;    
	case cit7006:
		strBrand = "雪铁龙(C2 2006-2013款)"; break;  
	case cit7007: 
		strBrand = "雪铁龙(未知 未知)"; break; 	  
	case cit7008: 
		strBrand = "雪铁龙(爱丽舍 2008-2013款)"; break;    
	case cit7009: 
		strBrand = "雪铁龙(未知 未知)"; break;    
	case cit7010: 
		strBrand = "雪铁龙(世嘉 2014款)"; break; 
	case cit7011:
		strBrand = "雪铁龙(富康 2004-2007款)"; break;   
	case cit7012: 
		strBrand = "雪铁龙(塞纳 2004款)"; break; 
	case cit7013:
		strBrand = "雪铁龙(未知 未知)"; break;    
	case cit7014:
		strBrand = "雪铁龙(C4 2006,2008款)"; break;  
	case cit7015:
		strBrand = "雪铁龙(C5 2013-2014款)"; break;       
	case cit7016:
		strBrand = "雪铁龙(爱丽舍 2004-2005,2007款)"; break; 
	case cit7017: 
		strBrand = "雪铁龙(世嘉 2012-2013款)"; break;	       
	case cit7018: 
		strBrand = "雪铁龙(毕加索 2007款)"; break;    
	case cit7019:
		strBrand = "雪铁龙(塞纳 2004-2005款)"; break;   
	case cit7020:
		strBrand = "雪铁龙(世嘉 2008-2011款)"; break;       
	case cit7021: 
		strBrand = "雪铁龙(塞纳 未知)"; break; 	   
	case cit7022: 
		strBrand = "雪铁龙(C4Aircross 2012-2013款)"; break;  
	case cit7023:   
		strBrand = "雪铁龙(***  ***)"; break;  
	case cit7024: 
		strBrand = "雪铁龙(爱丽舍 2014款)"; break;  
	case cit7025: 
		strBrand = "雪铁龙(富康 2005,2007款)"; break;  		//小客
	case cit7026: 
		strBrand = "雪铁龙(富康 2004款)"; break;  			//小客
	case cit7027: 
		strBrand = "雪铁龙(毕加索 2007款)"; break;  			//小客
		//斯柯达**********7500-7999***********//
	case sko7500: 
		strBrand = "斯柯达(野帝 2013-2014款)"; break;  
	case sko7501: 
		strBrand = "斯柯达(昕锐 2013款)"; break;   
	case sko7502: 
		strBrand = "斯柯达(晶锐 2008-2013款)"; break;       
	case sko7503: 
		strBrand = "斯柯达(昊锐 2009-2013款)"; break;  
	case sko7504: 
		strBrand = "斯柯达(明锐 2010-2014款)"; break;     
	case sko7505: 
		strBrand = "斯柯达(明锐 2007-2009款)"; break;     
	case sko7506: 
		strBrand = "斯柯达(昊锐 2009,2010,2012款)"; break; 
	case sko7507: 
		strBrand = "斯柯达(晶锐 2008,2009,2011款)"; break; 
	case sko7508: 
		strBrand = "斯柯达(晶锐 2012款)"; break;     
	case sko7509: 
		strBrand = "斯柯达(明锐 2010,2013款)"; break;       
	case sko7510: 
		strBrand = "斯柯达(未知  未知)"; break; 	
	case sko7511: 
		strBrand = "斯柯达(野帝 2014款)"; break;  
	case sko7512:  
		strBrand = "斯柯达(***  ***)"; break; 
	case sko7513:  
		strBrand = "斯柯达(晶锐 2014款)"; break; 	//小客
	case sko7514:  
		strBrand = "斯柯达(Yeti（进口）	2013款)"; break; 	//中客
	case sko7515:  
		strBrand = "斯柯达(晶锐 晶致版 2012款)"; break; 	//小客
	case sko7516:  
		strBrand = "斯柯达(明锐 RS 2010款)"; break; 	//小客
	case sko7517:  
		strBrand = "斯柯达(明锐 RS 未知)"; break; 	//小客
		//沃尔沃**********8000-8499***********//
	case volo8000: 
		strBrand = "沃尔沃(S80L 2009-2014款)"; break;
	case volo8001:
		strBrand = "沃尔沃(S40 2007-2011款)"; break;    
	case volo8002: 
		strBrand = "沃尔沃(C70 2008款)"; break; 
	case volo8003: 
		strBrand = "沃尔沃(XC60 2009-2014款)"; break;    
	case volo8004: 
		strBrand = "沃尔沃(S60 2009-2014款)"; break;    
	case volo8005: 
		strBrand = "沃尔沃(XC90 2006-2013款)"; break;    
	case volo8006:
		strBrand = "沃尔沃(C30 2006-2013款)"; break;    
	case volo8007: 
		strBrand = "沃尔沃(S80 2004款)"; break; 
	case volo8008:
		strBrand = "沃尔沃(S40 2004-2006款)"; break;    
	case volo8009: 
		strBrand = "沃尔沃(C30 2006,2008,2010款)"; break;   
	case volo8010: 
		strBrand = "沃尔沃(C30 2011-2013款)"; break; 
	case volo8011:
		strBrand = "沃尔沃(C70 2004款)"; break;	    
	case volo8012:
		strBrand = "沃尔沃(C70 2010款)"; break;      
	case volo8013: 
		strBrand = "沃尔沃(S40 2006款)"; break;      
	case volo8014:
		strBrand = "沃尔沃(S40 2007,2008,2010款)"; break;   
	case volo8015:
		strBrand = "沃尔沃(S40 2011,2012款)"; break; 
	case volo8016: 
		strBrand = "沃尔沃(S80 2006-2007款)"; break; 
	case volo8017: 
		strBrand = "沃尔沃(S80 2009-2012款)"; break; 
	case volo8018: 
		strBrand = "沃尔沃(V60 2011-2013款)"; break; 
	case volo8019:
		strBrand = "沃尔沃(XC90 2006,2007,2009款)"; break;   
	case volo8020: 
		strBrand = "沃尔沃(XC90 2010-2013款)"; break; 
	case volo8021:
		strBrand = "沃尔沃(未知 未知)"; break;	
	case volo8022:
		strBrand = "沃尔沃(V40 2013款)"; break;  
	case volo8023:   
		strBrand = "沃尔沃(未知	未知)"; break;
	case volo8024:  
		strBrand = "沃尔沃(***  ***)"; break;
	case volo8025:  
		strBrand = "沃尔沃(S80L	2014款)"; break;
	case volo8026: 
		strBrand = "沃尔沃(V40	2014款)"; break;
	case volo8400:  
		strBrand = "沃尔沃(未知 未知)"; break;   //大客
	case volo8401:  
		strBrand = "沃尔沃(未知 未知)"; break; //大货
		//雷克萨斯**********8500-8999***********//
	case lex8500: 
		strBrand = "雷克萨斯(ES240 2010,2012款)"; break;   
	case lex8501: 
		strBrand = "雷克萨斯(ES 2013款)"; break; 
	case lex8502: 
		strBrand = "雷克萨斯(GS 2005-2011款)"; break;    
	case lex8503: 
		strBrand = "雷克萨斯(LX 2007-2013款)"; break;    
	case lex8504:
		strBrand = "雷克萨斯(RX 2009-2011款)"; break;    
	case lex8505:
		strBrand = "雷克萨斯(CT 2011-2014款)"; break;    
	case lex8506: 
		strBrand = "雷克萨斯(IS200 2004款)"; break;	       
	case lex8507:
		strBrand = "雷克萨斯(IS 2009款)"; break; 
	case lex8508: 
		strBrand = "雷克萨斯(RX350 未知)"; break;  
	case lex8509: 
		strBrand = "雷克萨斯(GX460 2010款)"; break; 
	case lex8510: 
		strBrand = "雷克萨斯(GS250 2012-2014款)"; break;    
	case lex8511: 
		strBrand = "雷克萨斯(LS600hL 2007:2010款)"; break;    
	case lex8512: 
		strBrand = "雷克萨斯(RX400h 2007款)"; break; 
	case lex8513: 
		strBrand = "雷克萨斯(LS430 2004-2005款)"; break;    
	case lex8514: 
		strBrand = "雷克萨斯(IS300 2006-2008款)"; break;    
	case lex8515: 
		strBrand = "雷克萨斯(ES	1993款)"; break; 
	case lex8516: 
		strBrand = "雷克萨斯(ES豪华版 2006款)"; break;
	case lex8517: 
		strBrand = "雷克萨斯(ES 2010,2012款)"; break;   
	case lex8518: 
		strBrand = "雷克萨斯(GS 2004款)"; break;    
	case lex8519: 
		strBrand = "雷克萨斯(GS 2005款)"; break;    
	case lex8520: 
		strBrand = "雷克萨斯(GS 2008-2011款)"; break;       
	case lex8521: 
		strBrand = "雷克萨斯(GX 2010,2012款)"; break;      
	case lex8522: 
		strBrand = "雷克萨斯(IS 2009-2010款)"; break;       
	case lex8523: 
		strBrand = "雷克萨斯(LS 2004-2005款)"; break;       
	case lex8524: 
		strBrand = "雷克萨斯(LS 2006,2007款)"; break;      
	case lex8525: 
		strBrand = "雷克萨斯(LX 2004款)"; break;    
	case lex8526: 
		strBrand = "雷克萨斯(LX 2005款)"; break;    
	case lex8527: 
		strBrand = "雷克萨斯(LX 2007,2009款)"; break;      
	case lex8528: 
		strBrand = "雷克萨斯(LX 2012-2013款)"; break;       
	case lex8529: 
		strBrand = "雷克萨斯(RX 2004款)"; break;  
	case lex8530: 
		strBrand = "雷克萨斯(RX 2007款)"; break;  
	case lex8531: 
		strBrand = "雷克萨斯(RX 2009-2011款)"; break;     
	case lex8532: 
		strBrand = "雷克萨斯(RX 2012-2013款)"; break;     
	case lex8533: 
		strBrand = "雷克萨斯(IS 2004款)"; break;  
	case lex8534: 
		strBrand = "雷克萨斯(LS	1993款)"; break;  
	case lex8535: 
		strBrand = "雷克萨斯(LS 未知)"; break; 	 
	case lex8536:   
		strBrand = "雷克萨斯(*** ***)"; break; 
	case lex8537:  
		strBrand = "雷克萨斯(未知 未知)"; break; 
	case lex8538:  
		strBrand = "雷克萨斯(GS 2004-2005,2008-2009款)"; break; 
	case lex8539:  
		strBrand = "雷克萨斯(CT F-Sport	2012款)"; break;           
	case lex8540:  
		strBrand = "雷克萨斯(IS	2009-2010款)"; break;           
	case lex8541:  
		strBrand = "雷克萨斯(LS600hL 2010款)"; break;      
	case lex8542:  
		strBrand = "雷克萨斯(IS	2006,2008款)"; break;      
	case lex8543:  
		strBrand = "雷克萨斯(CT 200h 2014款)"; break;           
	case lex8544:  
		strBrand = "雷克萨斯(LS 430	2004-2005款)"; break;           
	case lex8545:  
		strBrand = "雷克萨斯(RX	未知)"; break;              //中客
		//雷诺**********9000-9499***********//
	case ren9000: 
		strBrand = "雷诺(科雷傲 2009-2014款)"; break; 
	case ren9001: 
		strBrand = "雷诺(风朗 2011,2013款)"; break;    
	case ren9002: 
		strBrand = "雷诺(梅甘娜 2006款)"; break;  
	case ren9003: 
		strBrand = "雷诺(维度 2013款)"; break;  
	case ren9004: 
		strBrand = "雷诺(风景 未知)"; break;	    
	case ren9005: 
		strBrand = "雷诺(风景 2004款)"; break;  
	case ren9006: 
		strBrand = "雷诺(风景 2011-2012款)"; break;     
	case ren9007: 
		strBrand = "雷诺(科雷傲 2009-2010款)"; break;     
	case ren9008: 
		strBrand = "雷诺(科雷傲 2012-2013款)"; break;     
	case ren9009: 
		strBrand = "雷诺(维度 2011款)"; break;  
	case ren9010: 
		strBrand = "雷诺(未知1 未知)"; break;    
	case ren9011: 
		strBrand = "雷诺(科雷傲 2014款)"; break;  
	case ren9012: 
		strBrand = "雷诺(风朗 2013款)"; break; 
	case ren9013:  
		strBrand = "雷诺(***  ***)"; break; 
	case ren9014:   
		strBrand = "雷诺(拉古那		2011款)"; break;       
	case ren9015:  
		strBrand = "雷诺(风朗		2011款)"; break;       
	case ren9400:
		strBrand = "雷诺(未知 未知)"; break;  //大货
		//三菱**********9500-9999***********//
	case mit9500:
		strBrand = "三菱(伊柯丽斯 2008-2009款)"; break;    
	case mit9501: 
		strBrand = "三菱(翼神 2010-2013款)"; break;    
	case mit9502:
		strBrand = "三菱(劲炫ASX 2011-2014款)"; break;     
	case mit9503: 
		strBrand = "三菱(风迪思 2013款)"; break;  
	case mit9504:
		strBrand = "三菱(蓝瑟 2006-2012款)"; break;     
	case mit9505: 
		strBrand = "三菱(君阁 2008,2011款)"; break;   
	case mit9506: 
		strBrand = "三菱(菱帅 2004-2005款)"; break;    
	case mit9507: 
		strBrand = "三菱(帕杰罗进口 2007-2014款)"; break;    
	case mit9508:
		strBrand = "三菱(欧蓝德 2007-2012款)"; break;	   
	case mit9509:
		strBrand = "三菱(V5 2012款)"; break; 
	case mit9510:
		strBrand = "三菱(菱绅 2004-2006款)"; break;    
	case mit9511:
		strBrand = "三菱(帕杰罗 2004-2011款)"; break;    
	case mit9512:
		strBrand = "三菱(戈蓝 2007,2009,2012款)"; break; 
	case mit9513: 
		strBrand = "三菱(格蓝迪 2004-2009款)"; break;       
	case mit9514:
		strBrand = "三菱(欧蓝德 2004-2005款)"; break;    
	case mit9515:
		strBrand = "三菱(东南DN6473 未知)"; break;     
	case mit9516:
		strBrand = "三菱(欧蓝德 2013款)"; break; 
	case mit9517:
		strBrand = "三菱(未知 未知)"; break;     
	case mit9518: 
		strBrand = "三菱(Lancer 2008款)"; break;
	case mit9519:
		strBrand = "三菱(翼神 2010-2011款)"; break;   
	case mit9520: 
		strBrand = "三菱(伊柯力斯 2009款)"; break;
	case mit9521:
		strBrand = "三菱(戈蓝 2007,2009款)"; break;    
	case mit9522: 
		strBrand = "三菱(格蓝迪 2004,2006款)"; break;    
	case mit9523: 
		strBrand = "三菱(格蓝迪 2007款)"; break;  
	case mit9524: 
		strBrand = "三菱(劲炫ASX 2013款)"; break;  
	case mit9525:
		strBrand = "三菱(蓝瑟 2006款)"; break;  
	case mit9526: 
		strBrand = "三菱(蓝瑟 2007-2008:2010款)"; break;  
	case mit9527: 
		strBrand = "三菱(蓝瑟 2012款)"; break;    
	case mit9528:
		strBrand = "三菱(菱绅 未知)"; break;       
	case mit9529: 
		strBrand = "三菱(菱绅 2006款)"; break;    
	case mit9530:
		strBrand = "三菱(菱绅 2004-2005款)"; break;     
	case mit9531: 
		strBrand = "三菱(欧蓝德（进口） 2007-2009款)"; break;     
	case mit9532: 
		strBrand = "三菱(欧蓝德（进口） 2010-2012款)"; break;       
	case mit9533:
		strBrand = "三菱(帕杰罗 未知)"; break;  
	case mit9534: 
		strBrand = "三菱(帕杰罗 2004-2005:2008:2011款)"; break; 
	case mit9535: 
		strBrand = "三菱(帕杰罗进口 未知)"; break; 
	case mit9536:
		strBrand = "三菱(帕杰罗进口 2004款)"; break;      
	case mit9537:
		strBrand = "三菱(帕杰罗进口 2008-2012款)"; break; 
	case mit9538:
		strBrand = "三菱(帕杰罗进口 2014款)"; break; 
	case mit9539:
		strBrand = "三菱(帕杰罗速跑 2004款)"; break;
	case mit9540:
		strBrand = "三菱(ASX劲炫（进口) 2012款)"; break;      
	case mit9541:
		strBrand = "三菱(帕杰罗劲畅（进口） 2011款)"; break; 
	case mit9542:   
		strBrand = "三菱(菱利 未知)"; break;
	case mit9543:  
		strBrand = "三菱(***  ***)"; break; 
	case mit9544:  
		strBrand = "三菱(帕杰罗（进口)   2007-2010款)"; break; 
	case mit9545:  
		strBrand = "三菱(Lancer	2006款)"; break;  
	case mit9546:  
		strBrand = "三菱(帕杰罗劲畅（带保险杠）2013-2014款)"; break;    //中客           
	case mit9547:  
		strBrand = "三菱(帕杰罗劲畅 2013-2014款)"; break;     //中客        
	case mit9548:  
		strBrand = "三菱(未知 未知)"; break;       //中客           
	case mit9549: 
		strBrand = "三菱(格蓝迪	2009款)"; break;   
	case mit9550: 
		strBrand = "三菱(欧蓝德	2006款)"; break;    
		//比亚迪**********10000-10499***********//
	case byd10000: 
		strBrand = "比亚迪(F0 2008-2013款)"; break;      
	case byd10001:
		strBrand = "比亚迪(F3 2005-2013款)"; break;     
	case byd10002: 
		strBrand = "比亚迪(G3 2010-2013款)"; break;     
	case byd10003:
		strBrand = "比亚迪(速瑞 2012-2014款)"; break;     
	case byd10004:
		strBrand = "比亚迪(L3 2010-2013款)"; break;     
	case byd10005: 
		strBrand = "比亚迪(F6 2008,2009,2011款)"; break;   
	case byd10006:
		strBrand = "比亚迪(S6 2011-2014款)"; break; 
	case byd10007:
		strBrand = "比亚迪(M6 2010,2011,2013款)"; break;   
	case byd10008:
		strBrand = "比亚迪(G6 2011-2013款)"; break; 
	case byd10009:
		strBrand = "比亚迪(F3R 2007-2011款)"; break;       
	case byd10010: 
		strBrand = "比亚迪(F3 2010，2012:2013款)"; break; 
	case byd10011:
		strBrand = "比亚迪(F3R 2008:2009，2011款)"; break; 
	case byd10012:
		strBrand = "比亚迪(福莱尔 2003款)"; break;     
	case byd10013:
		strBrand = "比亚迪(福莱尔豪华型 2005款)"; break;     
	case byd10014:
		strBrand = "比亚迪(S6 2011-2013款)"; break;       
	case byd10015: 
		strBrand = "比亚迪(未知 未知)"; break;  
	case byd10016:  
		strBrand = "比亚迪(F3 2007-2010款)"; break;
	case byd10017:   
		strBrand = "比亚迪(秦 2014款)"; break; 
		//路虎**********10500-10999***********//
	case land10500:
		strBrand = "路虎(揽胜运动 2012-2013款)"; break;    
	case land10501:
		strBrand = "路虎(第四代发现者 2010-2014款)"; break;    
	case land10502:
		strBrand = "路虎(神行者 2011-2014款)"; break;    
	case land10503:
		strBrand = "路虎(神行者 2007-2010款)"; break;    
	case land10504:
		strBrand = "路虎(揽胜极光 2012-2014款)"; break;    
	case land10505: 
		strBrand = "路虎(揽胜 2005-2012款)"; break;    
	case land10506: 
		strBrand = "路虎(揽胜Vogue 2013款)"; break;    
	case land10507: 
		strBrand = "路虎(发现者 未知)"; break;    
	case land10508: 
		strBrand = "路虎(发现者 2011-2013款)"; break;   
	case land10509:
		strBrand = "路虎(揽胜 2007款)"; break;
	case land10510: 
		strBrand = "路虎(揽胜  未知)"; break;   
	case land10511: 
		strBrand = "路虎(揽胜运动版 2010,2013款)"; break;  
	case land10512: 
		strBrand = "路虎(神行者 2003,2004款)"; break;  
	case land10513:
		strBrand = "路虎(神行者 2010款)"; break;
	case land10514:
		strBrand = "路虎(神行者 2011-2013款)"; break;   
	case land10515: 
		strBrand = "路虎(揽胜极光 2011款)"; break;
	case land10516: 
		strBrand = "路虎(揽胜 2010款)"; break;
	case land10517:
		strBrand = "路虎(揽胜 2012,2013款)"; break;  
	case land10518:
		strBrand = "路虎(未知 未知)"; break;   
	case land10519:
		strBrand = "路虎(路虎 揽胜 2010-2012款)"; break;  //中客     
	case land10520:
		strBrand = "路虎(第四代发现者 2014款)"; break; //中客
	case land10521:
		strBrand = "路虎(揽胜运动版	2014款)"; break;   //中客
		//凯迪拉克**********11000-11499***********//
	case cad11000: 
		strBrand = "凯迪拉克(SRX 2010-2014款)"; break; 
	case cad11001: 
		strBrand = "凯迪拉克(CTS 2008-2010款)"; break;     
	case cad11002: 
		strBrand = "凯迪拉克(XTS 2013-2014款)"; break;     
	case cad11003: 
		strBrand = "凯迪拉克(凯雷德Hybrid 2009-2010款)"; break;     
	case cad11004: 
		strBrand = "凯迪拉克(CTS 2005-2006款)"; break;	    
	case cad11005: 
		strBrand = "凯迪拉克(SLS 2007-2012款)"; break;     
	case cad11006: 
		strBrand = "凯迪拉克(SLS赛威 2007款)"; break;  
	case cad11007:
		strBrand = "凯迪拉克(SLS赛威 2010-2012款)"; break;     
	case cad11008:
		strBrand = "凯迪拉克(SRX 2013款)"; break;  
	case cad11009:
		strBrand = "凯迪拉克(SRX 2010-2012款)"; break;     
	case cad11010: 
		strBrand = "凯迪拉克(BLS 2008款)"; break;  
	case cad11011: 
		strBrand = "凯迪拉克(XTS 未知)"; break; 
	case cad11012:   
		strBrand = "凯迪拉克(*** ***)"; break; 
	case cad11013:  
		strBrand = "凯迪拉克(ATS（进口）2014款)"; break; 
	case cad11014:  
		strBrand = "凯迪拉克(ATS-L 2014款)"; break; 
		//斯巴鲁**********11500-11999***********//
	case sub11500: 
		strBrand = "斯巴鲁(森林人 2008-2012款)"; break;     
	case sub11501:
		strBrand = "斯巴鲁(森林人 2006,2007款)"; break;   
	case sub11502: 
		strBrand = "斯巴鲁(傲虎 2010-2014款)"; break;   
	case sub11503:
		strBrand = "斯巴鲁(傲虎 2006款)"; break;
	case sub11504:
		strBrand = "斯巴鲁(XV 2011-2014款)"; break;  
	case sub11505:
		strBrand = "斯巴鲁(力狮 2010-2014款)"; break;   
	case sub11506: 
		strBrand = "斯巴鲁(翼豹两厢 2007-2011款)"; break;	
	case sub11507:
		strBrand = "斯巴鲁(森林人 2013款)"; break;     
	case sub11508: 
		strBrand = "斯巴鲁(BRZ 2013款)"; break;    
	case sub11509: 
		strBrand = "斯巴鲁(XV 2012款)"; break;    
	case sub11510:
		strBrand = "斯巴鲁(傲虎 2005款)"; break;
	case sub11511:
		strBrand = "斯巴鲁(傲虎 2010-2012款)"; break;   
	case sub11512:
		strBrand = "斯巴鲁(傲虎 2013款)"; break;
	case sub11513:
		strBrand = "斯巴鲁(驰鹏 2008,2011款)"; break;   
	case sub11514:
		strBrand = "斯巴鲁(力狮 2004,2005款)"; break;   
	case sub11515:
		strBrand = "斯巴鲁(力狮 2006款)"; break;
	case sub11516:
		strBrand = "斯巴鲁(力狮 2010款)"; break;
	case sub11517:
		strBrand = "斯巴鲁(森林人 2008,2010款)"; break;  
	case sub11518:
		strBrand = "斯巴鲁(森林人 2011,2012款)"; break;  
	case sub11519: 
		strBrand = "斯巴鲁(翼豹 2007,2008款)"; break;      
	case sub11520: 
		strBrand = "斯巴鲁(森林人 未知)"; break;  
	case sub11521: 
		strBrand = "斯巴鲁(XV 未知)"; break;
	case sub11522: 
		strBrand = "斯巴鲁(*** ***)"; break;  
	case sub11523:  
		strBrand = "斯巴鲁(驰鹏 2007款)"; break;
	case sub11524:  
		strBrand = "斯巴鲁(力狮 2013-2014款)"; break;           
	case sub11525:  
		strBrand = "斯巴鲁(森林人 2013-2014款)"; break;   //中客               
	case sub11526:  
		strBrand = "斯巴鲁(未知 未知)"; break;
	case sub11527:	
		strBrand = "斯巴鲁( XV 2012,2014款)"; break;	 //中客
		//克莱斯勒**********12000-12499***********//
	case chr12000: 
		strBrand = "克莱斯勒(铂锐 2008款)"; break;
	case chr12001:    
		strBrand = "克莱斯勒(未知1 未知)"; break;   
	case chr12002:    
		strBrand = "克莱斯勒(300C 2006款)"; break;
	case chr12003:    
		strBrand = "克莱斯勒(大捷龙 2012款)"; break;
	case chr12004:    
		strBrand = "克莱斯勒(300C_SRT 2008,2010款)"; break;   
	case chr12005:    
		strBrand = "克莱斯勒(PT_漫步者 2007款)"; break;
	case chr12006:    
		strBrand = "克莱斯勒(Town&Country 2011款)"; break;
		//皇冠**********12500-12999***********//
	case crow12500:
		strBrand = "皇冠(未知 未知)"; break; 	      
	case crow12501: 
		strBrand = "皇冠(皇冠 2005-2009款)"; break;
	case crow12502: 
		strBrand = "皇冠(皇冠 2010-2011款)"; break;       
	case crow12503: 
		strBrand = "皇冠(皇冠 2012款)"; break;    
	case crow12504:
		strBrand = "皇冠(V6 2011款)"; break;    
	case crow12505: 
		strBrand = "皇冠(V6 2010款)"; break;      
	case crow12506:
		strBrand = "皇冠(V6 2012款)"; break;      
	case crow12507:
		strBrand = "皇冠(皇冠 1991-1999款)"; break; 
	case crow12508: 
		strBrand = "皇冠(皇冠 2004款)"; break;       
	case crow12509:  
		strBrand = "皇冠(V8/V6 2010款)"; break; 
	case crow12510:  
		strBrand = "皇冠(皇冠 2012款)"; break;  
		//菲亚特**********13000-13499***********//
	case fiat13000:
		strBrand = "菲亚特(周末风 2004-2006款)"; break;       
	case fiat13001:    
		strBrand = "菲亚特(菲翔 2012-2014款)"; break;   
	case fiat13002:    
		strBrand = "菲亚特(博悦 2008,2009,2011款)"; break; 
	case fiat13003:     
		strBrand = "菲亚特(菲跃 2012-2013款)"; break;       
	case fiat13004:
		strBrand = "菲亚特(派朗 2006款)"; break;    
	case fiat13005: 
		strBrand = "菲亚特(500 2011-2012款)"; break;       
	case fiat13006: 
		strBrand = "菲亚特(派力奥/西耶那/周末风 2004-2005款)"; break;
	case fiat13007: 
		strBrand = "菲亚特(派力奥/西耶那/周末风 2005-2006款)"; break;
	case fiat13008:
		strBrand = "菲亚特(博悦 2011款)"; break;    
	case fiat13009:
		strBrand = "菲亚特(Doblo 2010款)"; break;    
	case fiat13010:
		strBrand = "菲亚特(菲亚特500 2010-2012款)"; break;    
	case fiat13011:
		strBrand = "菲亚特(ottimo致悦 2014款)"; break;    
		//英菲尼迪**********13500-13999***********//
	case infty13500: 
		strBrand = "英菲尼迪(未知1 未知)"; break;	     
	case infty13501:     
		strBrand = "英菲尼迪(G25 2010-2013款)"; break;  
	case infty13502:      
		strBrand = "英菲尼迪(FX35 2009-2012款)"; break;      
	case infty13503: 
		strBrand = "英菲尼迪(M25 2011,2012款)"; break; 
	case infty13504: 
		strBrand = "英菲尼迪(EX25 2011-2013款)"; break;      
	case infty13505:
		strBrand = "英菲尼迪(M35 2008,2009款)"; break; 
	case infty13506: 
		strBrand = "英菲尼迪(FX34/FX45 2004,2007款)"; break;  
	case infty13507:
		strBrand = "英菲尼迪(FX30d/FX35/FX50/FX37 2009-2011款)"; break;  
	case infty13508:
		strBrand = "英菲尼迪(G25/G37 2010,2012,2013款)"; break;    
	case infty13509: 
		strBrand = "英菲尼迪(QX50/EX系/M35 2008-2013款)"; break;   
	case infty13510: 
		strBrand = "英菲尼迪(G35/G37 2007,2009款)"; break;  
	case infty13511:
		strBrand = "英菲尼迪(Q70L/M系 2011-2013款)"; break;   
	case infty13512:
		strBrand = "英菲尼迪(FX37/FX/FX35 2012,2013款)"; break;
	case infty13513:
		strBrand = "英菲尼迪(M35 2007-2009款)"; break;
	case infty13514:
		strBrand = "英菲尼迪(G37 2010-2012款)"; break;
		//迷你**********14000-14499***********//
	case mini14000: 
		strBrand = "迷你(MINI 2004款)"; break;     
	case mini14001:       
		strBrand = "迷你(COUNTRYMAN 2011款)"; break; 
	case mini14002:      
		strBrand = "迷你(COUNTRYMAN 2012,2013款)"; break;   
	case mini14003: 
		strBrand = "迷你(CLUBMAN 2007-2011款)"; break;
	case mini14004: 
		strBrand = "迷你(MINI 2004,2007,2009-2011,2013款)"; break;       
	case mini14005: 
		strBrand = "迷你(COUNTRYMAN 2011,2013款)"; break;
	case mini14006: 
		strBrand = "迷你(CLUBMAN 2011-2013款)"; break;
	case mini14007: 
		strBrand = "迷你(COUNTRYMAN滑雪板 2013款)"; break;     
	case mini14008: 
		strBrand = "迷你(PACEMAN 2014款)"; break;     
	case mini14009: 
		strBrand = "迷你(COUPE 2012款)"; break;     
	case mini14010:
		strBrand = "迷你(CLUBMAN 2012款)"; break;  
	case mini14011:
		strBrand = "迷你(未知 未知)"; break;  
	case mini14012:
		strBrand = "迷你(COOPER FUN	2007款 )"; break;                    
	case mini14013:
		strBrand = "迷你(COOPER	未知)"; break;                          
	case mini14014:
		strBrand = "迷你(COUNTRYMAN	2012款)"; break;         
	case mini14015:
		strBrand = "迷你(COUNTRYMAN 2013款)"; break;                          
	case mini14016:
		strBrand = "迷你(ROADSTER 2012款)"; break;     
		//捷豹**********14500-14999***********//
	case jag14500: 
		strBrand = "捷豹(XJ 2010-2014款)"; break;     
	case jag14501:   
		strBrand = "捷豹(XF 2012-2014款)"; break;     
	case jag14502:    
		strBrand = "捷豹(S-Type 2004款)"; break;  
	case jag14503:
		strBrand = "捷豹(XJ 2004,2005款)"; break;
	case jag14504: 
		strBrand = "捷豹(X-Type 2004款)"; break;      
	case jag14505: 
		strBrand = "捷豹(XJ 1968款)"; break;      
	case jag14506: 
		strBrand = "捷豹(XF 2008-2011,2013-2014款)"; break; 
		//宾利**********15500-15999***********//
	case bntly15500: 
		strBrand = "宾利(慕尚 2011-2013款)"; break;
	case bntly15501:    
		strBrand = "宾利(飞驰 2005-2012款)"; break;
	case bntly15502:    
		strBrand = "宾利(Continental 2004,2007-2010,2012-2013款)"; break;       
		//吉普**********16000-16499***********//
	case jeep16000:
		strBrand = "吉普(牧马人	1993,2000-2012款)"; break;    
	case jeep16001: 
		strBrand = "吉普(北京Jeep 2007款)"; break;   
	case jeep16002:  
		strBrand = "吉普(切诺基 2004-2010款)"; break;  
	case jeep16003: 
		strBrand = "吉普(切诺基 2011-2013款)"; break;      
	case jeep16004: 
		strBrand = "吉普(未知 未知)"; break;  
	case jeep16005: 
		strBrand = "吉普(大切诺基 2007,2008,2010款)"; break;       
	case jeep16006: 
		strBrand = "吉普(大切诺基 2004,2005款)"; break;     
	case jeep16007:
		strBrand = "吉普(指挥官 2007,2008款)"; break;     
	case jeep16008: 
		strBrand = "吉普(指南者 2011-2014款)"; break;      
	case jeep16009: 
		strBrand = "吉普(大切诺基 2011-2013款)"; break;  
	case jeep16010: 
		strBrand = "吉普(切诺基 1997款)"; break;   
	case jeep16011: 
		strBrand = "吉普(牧马人 2011款)"; break;   
	case jeep16012: 
		strBrand = "吉普(牧马人 2008-2014款)"; break;      
	case jeep16013: 
		strBrand = "吉普(大切诺基 未知)"; break;     
	case jeep16014: 
		strBrand = "吉普(大切诺基 2014款)"; break;       
	case jeep16015: 
		strBrand = "吉普(指南者 2013款)"; break;  
	case jeep16016:    
		strBrand = "吉普(大切诺基(进口) 2008,2010款)"; break;  
	case jeep16017:  
		strBrand = "吉普(大切诺基(进口) 2007款)"; break; 
	case jeep16018:  
		strBrand = "吉普(大切诺基(进口) 2014款)"; break; 
	case jeep16019:  
		strBrand = "吉普(自由客 2011-2014款)"; break; 
	case jeep16020:  
		strBrand = "吉普(北京Jeep 2004-2005款)"; break;  
		//莲花**********16500-16999***********//
	case lot16500:
		strBrand = "莲花(L5 2011,2012款)"; break;     
	case lot16501: 
		strBrand = "莲花(竞悦/L3 2009,2010款)"; break;	    
	case lot16502: 
		strBrand = "莲花(L3 2009,2010,2013款)"; break;	  
	case lot16503:       
		strBrand = "莲花(L3 2013款)"; break;	//小客
	case lot16504:        
		strBrand = "莲花(未知 未知)"; break;		//小客
		//欧宝**********17000-17499***********//
	case ope17000: 
		strBrand = "欧宝(安德拉 2011-2013款)"; break;  
	case ope17001:      
		strBrand = "欧宝(雅特 2004款)"; break; 
	case ope17002:      
		strBrand = "欧宝(雅特舒适型 2005款)"; break; 
	case ope17003:       
		strBrand = "欧宝(安德拉 2008,2010款)"; break;   
	case ope17004: 
		strBrand = "欧宝(威达 2004款)"; break;     
	case ope17005:
		strBrand = "欧宝(赛飞利 2010 2013款)"; break;
	case ope17006:
		strBrand = "欧宝(雅特 2007款)"; break;   
	case ope17007: 
		strBrand = "欧宝(欧美佳 1997款)"; break;   
	case ope17008: 
		strBrand = "欧宝(雅特 1997,1999款)"; break;       
	case ope17009: 
		strBrand = "欧宝(威达 1998,1999款)"; break;       
	case ope17010: 
		strBrand = "欧宝(赛飞利 2011,2013款)"; break;   
	case ope17011:
		strBrand = "欧宝(雅特 2004-2005,2007,2010款)"; break;
	case ope17012: 
		strBrand = "欧宝(威达 2006款)"; break;
	case ope17013: 
		strBrand = "欧宝(雅特 2006-2007,2010款)"; break;
	case ope17014: 
		strBrand = "欧宝(赛飞利 2004款)"; break;
	case ope17015: 
		strBrand = "欧宝(英速亚 2013款)"; break;		//小客
		//玛莎拉蒂**********17500-17999***********//
	case msrt17500: 
		strBrand = "玛莎拉蒂(总裁 2008-2011款)"; break;  
		//保时捷**********18000-18499***********// 
	case por18000: 
		strBrand = "保时捷(Panamera 2010-2013款)"; break;      
	case por18001:  
		strBrand = "保时捷(卡宴 2011-2014款)"; break;    
	case por18002:  
		strBrand = "保时捷(Panamera 2014款)"; break; 
	case por18003:   
		strBrand = "保时捷(卡宴 2010,2011,2014款)"; break;  
	case por18004:  
		strBrand = "保时捷(卡宴Turbo 2006款)"; break;	     
	case por18005: 
		strBrand = "保时捷(卡宴 2007款)"; break;   
	case por18006: 
		strBrand = "保时捷(卡宴 2008,2009款)"; break;	     
	case por18007: 
		strBrand = "保时捷(Boxster 2004,2006,2009-2011,2013-2014款)"; break; 
	case por18008: 
		strBrand = "保时捷(卡宴-Cayenne 2007款)"; break;
	case por18009:  
		strBrand = "保时捷(卡宴-Cayenne-S 2006款)"; break;
	case por18010:  
		strBrand = "保时捷(卡宴-Cayenne-S 2007,2009款)"; break;
	case por18011:  
		strBrand = "保时捷(卡宴-Cayenne-Turbo 未知)"; break;
	case por18012:  
		strBrand = "保时捷(*** ***)"; break;
	case por18013:      
		strBrand = "保时捷(卡宴 2006款)"; break;
	case por18014:  
		strBrand = "保时捷(Boxster 2013款)"; break;		//小客
	case por18015: 
		strBrand = "保时捷(Boxster 2009-2011款)"; break;	//小客
	case por18016:  
		strBrand = "保时捷(Cayman 2009-2012款)"; break;	//小客
	case por18017:  
		strBrand = "保时捷(卡宴 2007-2009款)"; break;
	case por18018:  
		strBrand = "保时捷(Macan 2014款)"; break;
		//荣威**********18500-18999***********//
	case row18500:
		strBrand = "荣威(350 2010-2013款)"; break;  
	case row18501: 
		strBrand = "荣威(550 2008-2014款)"; break;  
	case row18502: 
		strBrand = "荣威(750 2006-2010款)"; break;  
	case row18503:  
		strBrand = "荣威(750 2011-2012款)"; break;  
	case row18504:
		strBrand = "荣威(W5 2011-2014款)"; break;  
	case row18505:
		strBrand = "荣威(未知	 未知)"; break; 	 
	case row18506: 
		strBrand = "荣威(950 2012,2014款)"; break; 
	case row18507: 
		strBrand = "荣威(E50 2013款)"; break;       
	case row18508: 
		strBrand = "荣威(350 2010款)"; break;       
	case row18509:
		strBrand = "荣威(350 2011-2014款)"; break;   
	case row18510:
		strBrand = "荣威(750 2006-2012款)"; break;  
	case row18511: 
		strBrand = "荣威(750 2007-2008款)"; break;  
	case row18512: 
		strBrand = "荣威(950 2012款)"; break;       
	case row18513:
		strBrand = "荣威(w5 2011-2013款)"; break;  
	case row18514:
		strBrand = "荣威(罗孚75 2003-2005款)"; break;  
	case row18515:
		strBrand = "荣威(750 未知)"; break; 			//小客
	case row18516:
		strBrand = "荣威(550 2003-2005款)"; break; 		//小客 
	case row18517:
		strBrand = "荣威(W5 2014款)"; break; 			//中客

		//"铃木**********19000-19499***********//
	case suzk19000:
		strBrand = "铃木(雨燕 2013款)"; break;  
	case suzk19001:
		strBrand = "铃木(雨燕 2005-2012款)"; break;     
	case suzk19002: 
		strBrand = "铃木(天语SX4 2006-2010款)"; break;     
	case suzk19003:
		strBrand = "铃木(利亚纳 2006-2012款)"; break;     
	case suzk19004:
		strBrand = "铃木(天语SX4 2011-2013款)"; break;       
	case suzk19005:
		strBrand = "铃木(羚羊 2004款)"; break;  
	case suzk19006: 
		strBrand = "铃木(奥拓 2009,2010款)"; break;
	case suzk19007:
		strBrand = "铃木(奥拓 2013款)"; break;  
	case suzk19008: 
		strBrand = "铃木(利亚纳 2005款)"; break;  
	case suzk19009: 
		strBrand = "铃木(未知1 未知)"; break; 
	case suzk19010:
		strBrand = "铃木(未知2 未知)"; break; 
	case suzk19011:
		strBrand = "铃木(奥拓 2001,2006款)"; break;		    
	case suzk19012:
		strBrand = "铃木(奥拓 2009,2010,2012款)"; break;	
	case suzk19013:
		strBrand = "铃木(奥拓快乐王子 2006款)"; break;	    
	case suzk19014: 
		strBrand = "铃木(北斗星 2004,2009,2012款)"; break;	    
	case suzk19015:
		strBrand = "铃木(北斗星 2005,2007,2008,2011款)"; break;     
	case suzk19016:
		strBrand = "铃木(北斗星 2010款)"; break;	
	case suzk19017:
		strBrand = "铃木(雨燕 2007-2009款)"; break;	    
	case suzk19018: 
		strBrand = "铃木(雨燕 2005,2008,2009,2011款)"; break; 
	case suzk19019: 
		strBrand = "铃木(雨燕 2005,2010-2012款)"; break;	    
	case suzk19020:
		strBrand = "铃木(天语SX4 2006款)"; break;	
	case suzk19021:
		strBrand = "铃木(天语SX4 2007-2011款)"; break;	    
	case suzk19022:
		strBrand = "铃木(天语SX4 2009,2010款)"; break;	    
	case suzk19023:
		strBrand = "铃木(天语SX4-运动版 2011款)"; break;	
	case suzk19024:
		strBrand = "铃木(天语尚悦 2011,2012款)"; break;	    
	case suzk19025:
		strBrand = "铃木(利亚纳 2005-2006,2008,2011-2012款)"; break;	
	case suzk19026: 
		strBrand = "铃木(利亚纳 2011-2013款)"; break;	   
	case suzk19027:
		strBrand = "铃木(羚羊 2004,2011款)"; break;	   
	case suzk19028: 
		strBrand = "铃木(羚羊 2007,2009款)"; break;	   
	case suzk19029: 
		strBrand = "铃木(吉姆尼 2007-2011款)"; break;	   
	case suzk19030: 
		strBrand = "铃木(浪迪 2007,2010款)"; break;	
	case suzk19031: 
		strBrand = "铃木(超级维特拉 2007,2008,2011款)"; break;	
	case suzk19032: 
		strBrand = "铃木(天语SX4 2012款)"; break;	    
	case suzk19033: 
		strBrand = "铃木(凯泽西 2010,2011款)"; break;	
	case suzk19034:
		strBrand = "铃木(吉姆尼 2012款)"; break;	
	case suzk19035:   
		strBrand = "铃木(*** ***)"; break;
	case suzk19036:   
		strBrand = "铃木(雨燕 2007-2009款)"; break;
	case suzk19037:  
		strBrand = "铃木(超级维特拉 2012款)"; break;
	case suzk19038:  
		strBrand = "铃木(锋驭 2014款)"; break;  //中客
	case suzk19039:	 
		strBrand = "铃木(天语SX4 2013款)"; break;	//中客
	case suzk19040:	 
		strBrand = "铃木(羚羊 2011款)"; break;	//中客
	case suzk19041:	 
		strBrand = "铃木(羚羊 2012款)"; break;	//中客
	case suzk19042:	 
		strBrand = "铃木(北斗星 2012-2013款)"; break;	//中客
		//名爵**********19500-19999***********//
	case mg19500: 
		strBrand = "名爵(未知 未知)"; break; 	   
	case mg19501:
		strBrand = "名爵(MG6 2010-2014款)"; break;    
	case mg19502: 
		strBrand = "名爵(MG3 2013-2014款)"; break;
	case mg19503:
		strBrand = "名爵(MG5 2012,2014款)"; break;
	case mg19504: 
		strBrand = "名爵(MG3 2011款)"; break;     
	case mg19505: 
		strBrand = "名爵(Mg3SW 2008,2009款)"; break;
	case mg19506: 
		strBrand = "名爵(Mg3 2010-2013款)"; break;
	case mg19507: 
		strBrand = "名爵(Mg7 2007-2010款)"; break;
	case mg19508:
		strBrand = "名爵(Mg7自动加长 2007-2009款)"; break;    
		//奇瑞 **********20000-20499***********//
	case chry20000: 
		strBrand = "奇瑞(瑞虎 2010-2013款)"; break;    
	case chry20001:
		strBrand = "奇瑞(瑞虎 2005-2009款)"; break;    
	case chry20002:
		strBrand = "奇瑞(东方之子 2004-2007款)"; break;    
	case chry20003:
		strBrand = "奇瑞(旗云2 2012款)"; break; 
	case chry20004: 
		strBrand = "奇瑞(A3 2009款)"; break;   
	case chry20005: 
		strBrand = "奇瑞(旗云 2006-2007款)"; break;      
	case chry20006:
		strBrand = "奇瑞(风云2两厢 2010款)"; break;       
	case chry20007:
		strBrand = "奇瑞(旗云 2004款)"; break;   
	case chry20008:
		strBrand = "奇瑞(A5 2006-2009款)"; break;      
	case chry20009:
		strBrand = "奇瑞(未知 未知)"; break;	 
	case chry20010:
		strBrand = "奇瑞(QQ3 2004-2012款)"; break;      
	case chry20011: 
		strBrand = "奇瑞(旗云 2008款)"; break;   
	case chry20012:
		strBrand = "奇瑞(未知 未知)"; break; 	 
	case chry20013: 
		strBrand = "奇瑞(A3 2010-2012款)"; break;      
	case chry20014:
		strBrand = "奇瑞(风云2掀背 2010款)"; break;       
	case chry20015:
		strBrand = "奇瑞(风云2掀背 2013款)"; break;       
	case chry20016:
		strBrand = "奇瑞(旗云1 2010-2012款)"; break;      
	case chry20017: 
		strBrand = "奇瑞(QQ 2013款)"; break;   
	case chry20018:
		strBrand = "奇瑞(QQ3运动版 2012款)"; break;       
	case chry20019: 
		strBrand = "奇瑞(旗云3 2010款)"; break;       
	case chry20020:
		strBrand = "奇瑞(E5 2011,2012款)"; break;     
	case chry20021:
		strBrand = "奇瑞(QQ6 2007款)"; break;   
	case chry20022:
		strBrand = "奇瑞(未知 未知)"; break;	 
	case chry20023:
		strBrand = "奇瑞(未知 未知)"; break;	 
	case chry20024:
		strBrand = "奇瑞(东方之子Cross 2006-2009款)"; break;  
	case chry20025:
		strBrand = "奇瑞(东方之子 2012款)"; break;   
	case chry20026:
		strBrand = "奇瑞(A5 2006-2007,2009款)"; break;
	case chry20027: 
		strBrand = "奇瑞(瑞虎 2005款)"; break;   
	case chry20028:
		strBrand = "奇瑞(A3 2008-2010,2012款)"; break;
	case chry20029: 
		strBrand = "奇瑞(风云 2005款)"; break;   
	case chry20030: 
		strBrand = "奇瑞(瑞虎 2007,2009款)"; break;     
	case chry20031:
		strBrand = "奇瑞(E5 2011-2012,2014款)"; break;
	case chry20032:
		strBrand = "奇瑞(旗云 2004，2006-2008款)"; break;
	case chry20033:
		strBrand = "奇瑞(开瑞优雅  2007款)"; break;   
	case chry20034: 
		strBrand = "奇瑞(东方之子 2004-2006款)"; break;      
	case chry20035:
		strBrand = "奇瑞(旗云2 2010款)"; break;       
	case chry20036: 
		strBrand = "奇瑞(A1 2007,2009,2011款)"; break;
	case chry20037: 
		strBrand = "奇瑞(开瑞优翼 2007款)"; break;      
	case chry20038:
		strBrand = "奇瑞(旗云1 2010款)"; break;   
	case chry20041:
		strBrand = "奇瑞(艾瑞泽7 2013-2014款)"; break; 		//小客
	case chry20042:
		strBrand = "奇瑞(QQ 未知)"; break; 			//小客
	case chry20043:
		strBrand = "奇瑞(旗云1 2012款)"; break; 			//小客
	case chry20044:
		strBrand = "奇瑞(东方之子 2007款)"; break; 			//小客
	case chry20045:
		strBrand = "奇瑞(瑞虎5 2014款)"; break; 			//中客
		//帝豪**********20500-20999***********// 
	case emg20500: 
		strBrand = "帝豪(EC7 2009,2012款)"; break;    
	case emg20501:
		strBrand = "帝豪(EC7 2013款)"; break;  
	case emg20502:  
		strBrand = "帝豪(未知 未知)"; break;    
	case emg20503:  
		strBrand = "帝豪(EC7 2009,2012-2013款)"; break;     
	case emg20504:
		strBrand = "帝豪(EC7 2010,2012款)"; break;  
	case emg20505: 
		strBrand = "帝豪(EC8 2011款)"; break;  
	case emg20506:        
		strBrand = "帝豪(EC7 2009、2010、2012、2013款)"; break;   //小客
		//哈飞**********21000-21499***********//
	case hafe21000: 
		strBrand = "哈飞(未知 未知)"; break;	       
	case hafe21001:   
		strBrand = "哈飞(小霸王 2010款)"; break;     
	case hafe21002:    
		strBrand = "哈飞(未知 未知)"; break;	       
	case hafe21003:    
		strBrand = "哈飞(民意金牛版 2008款)"; break;      
	case hafe21004:   
		strBrand = "哈飞(路宝 2004款)"; break;      
	case hafe21005:    
		strBrand = "哈飞(路宝 2008款)"; break;      
	case hafe21006:     
		strBrand = "哈飞(民意超值版 2008款)"; break;      
	case hafe21007:    
		strBrand = "哈飞(民意 2005款)"; break;      
	case hafe21008:   
		strBrand = "哈飞(中意 2000-2002款)"; break; 
	case hafe21009:     
		strBrand = "哈飞(赛马 2004款)"; break;      
	case hafe21010:   
		strBrand = "哈飞(赛马 2007款)"; break;      
	case hafe21011:   
		strBrand = "哈飞(松花江 2004款)"; break;      
	case hafe21012:  
		strBrand = "哈飞(路尊大霸王 2011款)"; break;      
	case hafe21013:  
		strBrand = "哈飞(赛马 2009款)"; break;      
	case hafe21014:  
		strBrand = "哈飞(骏意 2010款)"; break;     
	case hafe21015:  
		strBrand = "哈飞(中意V5 2013款)"; break; 
	case hafe21016:  
		strBrand = "哈飞(民意 2012款)"; break; 
		//东南**********21500-21999***********//
	case soue21500: 
		strBrand = "东南(得利卡 2014款)"; break;   
	case soue21501:    
		strBrand = "东南(V3菱悦 2008-2014款)"; break;      
	case soue21502:    
		strBrand = "东南(V5菱致 2012-2014款)"; break;      
	case soue21503:     
		strBrand = "东南(希旺 2013款)"; break;   
	case soue21504:     
		strBrand = "东南(得利卡 2008款)"; break;   
	case soue21505: 
		strBrand = "东南(未知1 未知)"; break;	    
	case soue21506: 
		strBrand = "东南(未知2 未知)"; break;	    
	case soue21507:
		strBrand = "东南(未知3 未知)"; break;	    
	case soue21508:
		strBrand = "东南(V6菱仕 2012-2014款)"; break;     
	case soue21509:
		strBrand = "东南(菱帅 2004-2005款)"; break;     
	case soue21510:
		strBrand = "东南(未知4 未知)"; break;	    
	case soue21511: 
		strBrand = "东南(未知5 未知)"; break;     
	case soue21512:
		strBrand = "东南(富利卡 2003款)"; break;  
	case soue21513: 
		strBrand = "东南(富利卡 2009款)"; break;  
	case soue21514:
		strBrand = "东南(希旺 2011款)"; break;  
	case soue21515:
		strBrand = "东南(菱帅 2004款)"; break;  
	case soue21516:
		strBrand = "东南(菱利 2006款)"; break;  
	case soue21517: 
		strBrand = "东南(V3菱悦 2010-2011款)"; break;     
	case soue21518: 
		strBrand = "东南(V3菱悦 2008-2009款)"; break;     
	case soue21519:
		strBrand = "东南(V3菱悦 2012款)"; break;  
	case soue21520:
		strBrand = "东南(富利卡 2001款)"; break;  
	case soue21521:
		strBrand = "东南(得利卡 2002款)"; break;  
	case soue21522:
		strBrand = "东南(富利卡 2003款)"; break; 
	case soue21523:   
		strBrand = "东南(V6凌仕 2013-2014款)"; break; 		//小客
	case soue21900:    
		strBrand = "东南(未知 未知)"; break;    //中客
		//宝骏**********22000-22499***********//
	case baoj22000: 
		strBrand = "宝骏(630 2011-2013款)"; break;
	case baoj22001:     
		strBrand = "宝骏(未知 2013-2014款)"; break;
	case baoj22002:     
		strBrand = "宝骏(乐驰 2009-2012款)"; break;
	case baoj22003:     
		strBrand = "宝骏(730 2014款)"; break;
		//奔腾**********22500-22999***********//
	case best22500: 
		strBrand = "奔腾(B70 2010-2011款)"; break;     
	case best22501:    
		strBrand = "奔腾(B50 2009,2011款)"; break;  
	case best22502:    
		strBrand = "奔腾(B70 2006-2009款)"; break;   
	case best22503:    
		strBrand = "奔腾(未知1 未知)"; break;	  
	case best22504:     
		strBrand = "奔腾(B70 2010款)"; break;    
	case best22505:     
		strBrand = "奔腾(B50 2010款)"; break;
	case best22506:     
		strBrand = "奔腾(X80 2013款)"; break; 
	case best22507:
		strBrand = "奔腾(未知 未知)"; break; 
	case best22508:
		strBrand = "奔腾(未知 未知)"; break;   //中客
	case best22509:
		strBrand = "奔腾(B70 2014-2015款)"; break;   //中客
		//昌河**********23000-23499***********//
	case chah23000: 
		strBrand = "昌河(未知1 未知)"; break;       
	case chah23001:     
		strBrand = "昌河(福瑞达 2011款)"; break;      
	case chah23002:    
		strBrand = "昌河(爱迪尔 2004款)"; break;      
		//大发**********23500-23999***********//
	case daih23500:
		strBrand = "大发(森雅 2007-2008款)"; break;      
	case daih23501:    
		strBrand = "大发(特锐 2003款)"; break;   
	case daih23502:     
		strBrand = "大发(CUORE 1997款)"; break;   
		//东风**********24000-24499***********//
	case dofe24000:
		strBrand = "东风(风行菱智/菱智V3 2007,2012-2014款)"; break;     
	case dofe24001:   
		strBrand = "东风(风行/M3 2010-2011,2013-2014款)"; break;    
	case dofe24002:   
		strBrand = "东风(风行景逸/景逸SUV 2007-2014款)"; break;   
	case dofe24003:   
		strBrand = "东风(风行菱智M5 2012-2014款)"; break;     
	case dofe24004: 
		strBrand = "东风(小康K07/K17/K07II 2006-2013款)"; break; 
	case dofe24005: 
		strBrand = "东风(风行景逸X5 2013款)"; break;  
	case dofe24006: 
		strBrand = "东风(未知1 未知)"; break;	    
	case dofe24007: 
		strBrand = "东风(风神H30 2010-2014款)"; break; 
	case dofe24008: 
		strBrand = "东风(小康C37 2012款)"; break;  
	case dofe24009:
		strBrand = "东风(小康V27/V29/V07S 2011,2012款)"; break;    
	case dofe24010:
		strBrand = "东风(风神S30 2009-2012款)"; break; 
	case dofe24011: 
		strBrand = "东风(雪铁龙 未知)"; break;
	case dofe24012: 
		strBrand = "东风(风神A60 2012,2014款)"; break;
	case dofe24013: 
		strBrand = "东风(小康风光 2013款)"; break;  
	case dofe24014: 
		strBrand = "东风(景逸  2007款,2009-2012款,2014款)"; break;	
	case dofe24015: 
		strBrand = "东风(小康K17 2009款)"; break;	    
	case dofe24016: 
		strBrand = "东风(锐骐 2010款)"; break;      
	case dofe24017:
		strBrand = "东风(菱智 2007-2008款,2010-2011款)"; break;     
	case dofe24018: 
		strBrand = "东风(菱智  2013款)"; break;      
	case dofe24019: 
		strBrand = "东风(菱智 2010款,2012-2014款)"; break;	 
	case dofe24020: 
		strBrand = "东风(风神H30/S30 2012款)"; break;	     
	case dofe24021: 
		strBrand = "东风(福瑞卡 2010款)"; break;	     
	case dofe24022: 
		strBrand = "东风(东风劲诺  2009款)"; break;       
	case dofe24023: 
		strBrand = "东风(信天游皮卡 2002款)"; break;       
	case dofe24024:
		strBrand = "东风(帅客  2010-2013款)"; break;       
	case dofe24025: 
		strBrand = "东风(菱智 2013-2014款)"; break;	      
	case dofe24026: 
		strBrand = "东风(东风小霸王 2006款)"; break;	  
	case dofe24027: 
		strBrand = "东风(东风小霸王  2012款)"; break;	      
	case dofe24028: 
		strBrand = "东风(奥丁 2007款)"; break;	  
	case dofe24029:
		strBrand = "东风(御轩 2009款)"; break;
	case dofe24030: 
		strBrand = "东风(环卫设备系列 未知)"; break;       
	case dofe24031: 
		strBrand = "东风(小康V 2011款)"; break;	      
	case dofe24032:
		strBrand = "东风(菱智 2012-2014款)"; break;   
	case dofe24033:
		strBrand = "东风(景逸  2011-2012款,2014款)"; break;
	case dofe24034:
		strBrand = "东风(小康C35/C37 2013款，2012款)"; break;  
	case dofe24035:
		strBrand = "东风(东风小康V29 2012款)"; break;     
	case dofe24036: 
		strBrand = "东风(虎视 2008款)"; break;     
	case dofe24037: 
		strBrand = "东风(东风乘龙 2012款)"; break; 
	case dofe24038:
		strBrand = "东风(东风金刚  2005款)"; break;     
	case dofe24039: 
		strBrand = "东风(劲诺 2011款)"; break;	
	case dofe24040:
		strBrand = "东风(未知 未知1)"; break;	
	case dofe24041:
		strBrand = "东风(未知 未知2)"; break;	
	case dofe24042:
		strBrand = "东风(本田 思铭 2012款)"; break;	
	case dofe24043:  
		strBrand = "东风(小康K0711  2013款)"; break;
	case dofe24044: 
		strBrand = "东风(小康K17    2009款)"; break;
	case dofe24045: 
		strBrand = "东风(锐骐皮卡  2013款)"; break;   //小货
	case dofe24046: 
		strBrand = "东风(风神H30  2013，2014款)"; break;	//中客
	case dofe24047: 
		strBrand = "东风(风行CM7  2014款)"; break;			//中客
	case dofe24048: 
		strBrand = "东风(风神S30  2013-2014款)"; break;	//小客
	case dofe24049: 
		strBrand = "东风(小康K07  2013款)"; break;			//中客
	case dofe24050: 
		strBrand = "东风(俊风cv03  2012款 )"; break;        //中客  
	case dofe24051: 
		strBrand = "东风(御风  2012-2014款 )"; break;        //
	case dofe24052: 
		strBrand = "东风(景逸S50  2014款 )"; break;        //
	case dofe24400:   
		strBrand = "东风(未知 未知)"; break; //大货
	case dofe24401:   
		strBrand = "东风(未知 未知)"; break; //大客
		//福迪**********24500-24999***********//
	case fudi24500: 
		strBrand = "福迪(雄狮 2012款)"; break;     
	case fudi24501:
		strBrand = "福迪(探索者6 2010款)"; break;     
	case fudi24502: 
		strBrand = "福迪(雄狮 2009款)"; break;     
	case fudi24503:  
		strBrand = "福迪(小超人  2012款)"; break;     
	case fudi24504: 
		strBrand = "福迪(雄狮F16 2012款)"; break;  
	case fudi24505:       
		strBrand = "福迪(未知 未知)"; break;
		//传祺**********25500-25999***********//
	case chuaq25500: 
		strBrand = "传祺(GA5 2011-2012款)"; break;      
	case chuaq25501:       
		strBrand = "传祺(GS5 2012-2014款)"; break; 
	case chuaq25502:
		strBrand = "传祺(GA3	  2013-2014款)"; break; 
		//海马**********26000-26499***********//
	case haim26000: 
		strBrand = "海马(福美来 2011-2014款)"; break;   
	case haim26001:      
		strBrand = "海马(M3 2013-2014款)"; break;   
	case haim26002:      
		strBrand = "海马(海福星 2007-2010款)"; break;   
	case haim26003:     
		strBrand = "海马(未知1 未知)"; break; 	 
	case haim26004:   
		strBrand = "海马(海马3 2007-2010款)"; break;   
	case haim26005:
		strBrand = "海马(未知2 未知)"; break; 	  
	case haim26006:
		strBrand = "海马(丘比特 2010-2013款)"; break;   
	case haim26007: 
		strBrand = "海马(骑士 2010-2013款)"; break;   
	case haim26008: 
		strBrand = "海马(普力马 2006款)"; break;
	case haim26009: 
		strBrand = "海马(福美来 2008-2010款)"; break;   
	case haim26010:
		strBrand = "海马(福美来 2006款)"; break;
	case haim26011:
		strBrand = "海马(海福星 2011-2012款)"; break;   
	case haim26012: 
		strBrand = "海马(普力马 2013款)"; break;
	case haim26013: 
		strBrand = "海马(S7 2013款)"; break;
	case haim26014:
		strBrand = "海马(福美来 2006-2007款)"; break;   
	case haim26015:
		strBrand = "海马(普力马 2007款)"; break;
	case haim26016: 
		strBrand = "海马(普力马 2010款 2012款)"; break; 
	case haim26017: 
		strBrand = "海马(欢动 2009-2010款)"; break;   
	case haim26018:
		strBrand = "海马(福美来 2011款)"; break;
	case haim26019:
		strBrand = "海马(骑士 2012款)"; break;
	case haim26020:
		strBrand = "海马(丘比特 2010-2012款)"; break;   
	case haim26021:
		strBrand = "海马(福仕达鸿达 2009款)"; break;      
	case haim26022: 
		strBrand = "海马(S3 2010款)"; break;
	case haim26023:
		strBrand = "海马(福美来 2012-2014款)"; break; 
	case haim26024:   
		strBrand = "海马(福仕达鸿达/腾达 2012款)"; break;
	case haim26025:    
		strBrand = "海马(普力马（电动版/自动座）2010,2014款)"; break;
	case haim26026:    
		strBrand = "海马(M3 2014款)"; break;
	case haim26027:    
		strBrand = "海马(福仕达荣达 2012款)"; break;		//中客
	case haim26028:    
		strBrand = "海马(海马王子 2010款)"; break;		//小客
	case haim26029:    
		strBrand = "海马(福美来M5 2014款)"; break;		//
	case haim26030:    
		strBrand = "海马(S5 2014款)"; break;		//
		//中华**********26500-26999***********//
	case flyw26500: 
		strBrand = "中华(骏捷 2006-2010款)"; break;   
	case flyw26501: 
		strBrand = "中华(骏捷FSV 2009-2011款)"; break;   
	case flyw26502:   
		strBrand = "中华(未知1 未知)"; break; 	  
	case flyw26503:  
		strBrand = "中华(骏捷Cross/骏捷FRV 2008-2010款)"; break;   
	case flyw26504:  
		strBrand = "中华(530 2011-2012款)"; break;   
	case flyw26505: 
		strBrand = "中华(尊驰 2004-2008款)"; break;    
	case flyw26506: 
		strBrand = "中华(V5 2012,2014款)"; break;   
	case flyw26507:
		strBrand = "中华(骏捷 2011-2012款)"; break;    
	case flyw26508:
		strBrand = "中华(H230 2012款)"; break; 
	case flyw26509: 
		strBrand = "中华(尊驰 2004款)"; break; 
	case flyw26510:
		strBrand = "中华(骏捷FSV 2011款)"; break; 
	case flyw26511: 
		strBrand = "中华(骏捷FRV 2008-2009款)"; break;    
	case flyw26512:
		strBrand = "中华(H530 2011-2012款)"; break;    
	case flyw26513:
		strBrand = "中华(骏捷FRV 2010款)"; break; 
	case flyw26514:
		strBrand = "中华(中华尊驰 2004款 2007-2008款)"; break;  
	case flyw26515:
		strBrand = "中华(骏捷FSV 2009款)"; break;      
	case flyw26516:
		strBrand = "中华(骏捷CROSS 2009-2010款)"; break; 
	case flyw26517: 
		strBrand = "中华(中华酷宝 2007款)"; break;    
	case flyw26518:  
		strBrand = "中华(H330 2013款)"; break;   
	case flyw26519: 
		strBrand = "中华(骏捷 2011-2012款)"; break;   	//小客
		//汇众**********27000-27499***********//
	case huiz27000: 
		strBrand = "汇众(伊思坦纳 2013款)"; break;     
	case huiz27001: 
		strBrand = "汇众(伊斯坦纳 2008款)"; break;     
	case huiz27002:  
		strBrand = "汇众(伊斯坦纳 2005款)"; break;     
	case huiz27003:   
		strBrand = "汇众(大通 2011款)"; break;     
	case huiz27004:  
		strBrand = "汇众(伊斯坦纳救护车 2005款)"; break;  
	case huiz27400:
		strBrand = "汇众(未知  未知)";  break;   //中客
		//吉利**********27500-27999***********//
	case geely27500: 
		strBrand = "全球鹰(自由舰 2011-2012款)"; break;       
	case geely27501:  
		strBrand = "全球鹰(熊猫 2009-2011款)"; break;   
	case geely27502:  
		strBrand = "全球鹰(GX7 2012-2014款)"; break;   
	case geely27503:  
		strBrand = "全球鹰(远景 2006-2013款)"; break;   
	case geely27504: 
		strBrand = "吉利(金刚 2006-2010,2013款)"; break;     
	case geely27505: 
		strBrand = "吉利(SC6 2012款)"; break;
	case geely27506: 
		strBrand = "全球鹰(全球鹰 GC718 2013款)"; break;
	case geely27507: 
		strBrand = "吉利(未知1 未知)"; break; 	      
	case geely27508: 
		strBrand = "吉利(优利欧 2004-2005款)"; break;  
	case geely27509: 
		strBrand = "全球鹰(GX2 2011-2012款)"; break;  
	case geely27510: 
		strBrand = "吉利(未知2 未知)"; break; 	  
	case geely27511:
		strBrand = "吉利(未知3 未知)"; break; 	  
	case geely27512:
		strBrand = "吉利(未知4 未知)"; break; 	  
	case geely27513: 
		strBrand = "吉利(自由舰 2005-2010款)"; break;   
	case geely27514:
		strBrand = "吉利(远景 2004款,2009-2010款)"; break;   
	case geely27515: 
		strBrand = "吉利(金刚/金鹰 2009-2010款,2013款，2008款,2010款)"; break; 
	case geely27516: 
		strBrand = "吉利(海晏 2010-2013款)"; break;	       
	case geely27517: 
		strBrand = "吉利(金刚 2006-2007款)"; break;
	case geely27518: 
		strBrand = "全球鹰(熊猫 2009-2011款,2013款)"; break;
	case geely27519:
		strBrand = "全球鹰(远景 2011-2013款)"; break;
	case geely27520: 
		strBrand = "吉利(美日/优利欧 2004款2004-2005款)"; break;
	case geely27521:
		strBrand = "吉利(豪情 2004款)"; break;     
	case geely27522: 
		strBrand = "吉利(自由舰 2007款)"; break;     
	case geely27523:
		strBrand = "吉利(美日 2006款)"; break;     
	case geely27524:
		strBrand = "吉利(豪情 2004-2006款)"; break;
	case geely27525: 
		strBrand = "全球鹰(GC7 2012-2013款)"; break;       
	case geely27526: 
		strBrand = "全球鹰(GX7 2012-2013款)"; break;	   
	case geely27527: 
		strBrand = "吉利(金刚 2010款)"; break;	
	case geely27528:
		strBrand = "吉利(美人豹 未知)"; break;  
	case geely27529:  
		strBrand = "吉利(SX7 2013款)"; break;	 //中客
		//江淮**********28000-28499***********//
	case jac28000: 
		strBrand = "江淮(瑞风 2007款)"; break;     
	case jac28001:   
		strBrand = "江淮(和悦RS 2010-2012款)"; break;
	case jac28002:    
		strBrand = "江淮(和悦 2010-2012款)"; break;
	case jac28003:     
		strBrand = "江淮(瑞风 未知)"; break;
	case jac28004:
		strBrand = "江淮(瑞风政采版 2011款)"; break; 
	case jac28005: 
		strBrand = "江淮(未知1 未知)"; break;	  
	case jac28006: 
		strBrand = "江淮(瑞风M5 2012-2014款)"; break;   
	case jac28007: 
		strBrand = "江淮(同悦 2008-2012款)"; break;   
	case jac28008: 
		strBrand = "江淮(星锐 2011款)"; break;
	case jac28009: 
		strBrand = "江淮(和悦RS 2013款)"; break;
	case jac28010: 
		strBrand = "江淮(瑞风S5 2013款)"; break;       
	case jac28011:
		strBrand = "江淮(瑞风 2011款)"; break;       
	case jac28012: 
		strBrand = "江淮(威铃 未知)"; break;  
	case jac28013: 
		strBrand = "江淮(瑞风 2007款 2011款 2012款)"; break;  
	case jac28014: 
		strBrand = "江淮(瑞鹰 2007-2010款)"; break;	 
	case jac28015: 
		strBrand = "江淮(瑞风M5 2012-2013款)"; break;  
	case jac28016: 
		strBrand = "江淮(瑞风 2007款,2011款)"; break;	     
	case jac28017: 
		strBrand = "江淮(好运M系 2010款)"; break;	     
	case jac28018: 
		strBrand = "江淮(好运 未知)"; break;	     
	case jac28019:
		strBrand = "江淮(好运W系 2010款)"; break;       
	case jac28020: 
		strBrand = "江淮(大好运 未知)"; break;       
	case jac28021:
		strBrand = "江淮(宾悦 2008-2009款)"; break;  
	case jac28022: 
		strBrand = "江淮(和悦A13RS/同悦 2014款 2008-2012款)"; break;   
	case jac28023: 
		strBrand = "江淮(瑞玲 2011-2012款)"; break;  
	case jac28024: 
		strBrand = "江淮(好运N系 2010款)"; break;       
	case jac28025: 
		strBrand = "江淮(帅铃N系 2013款)"; break;       
	case jac28026: 
		strBrand = "江淮(瑞鹰 2011-2013款)"; break; 
	case jac28027:
		strBrand = "江淮(未知 未知)"; break; 
	case jac28028:   
		strBrand = "江淮(威铃2中卡    未知)"; break;        
	case jac28029:   
		strBrand = "江淮(威铃中卡     未知)"; break;        
	case jac28030:    
		strBrand = "江淮(瑞驰K5      2014款)"; break;    
	case jac28031:   
		strBrand = "江淮(宾悦      2011-2012款)"; break; 	//小客 
	case jac28032:   
		strBrand = "江淮(凌铃      2014款)"; break; 			//小货
	case jac28033: 
		strBrand = "江淮(悦悦      2009-2012款)"; break;  	//小客
	case jac28034: 
		strBrand = "江淮(瑞风S5      2013-2014款)"; break;  	//
	case jac28035: 
		strBrand = "江淮(悦悦CROSS      2012款)"; break;  	//
	case jac28400:   
		strBrand = "江淮(未知 未知1)"; break;   //大货*******
	case jac28401:    
		strBrand = "江淮(未知 未知2)"; break;   //中客********
	case jac28402:   
		strBrand = "江淮(未知 未知3)"; break;  //大客*****
	case jac28403:   
		strBrand = "江淮(威铃)"; break;  //大客*****
	case jac28404:   
		strBrand = "江淮(帅铃)"; break;  //大客*****
	case jac28405:   
		strBrand = "江淮(好运)"; break;  //大客*****
		//江铃**********28500-28999***********//
	case jmc28500:  
		strBrand = "江铃(全顺 未知)"; break; 
	case jmc28501: 
		strBrand = "江铃(宝威 2005,2009款)"; break; 
	case jmc28502: 
		strBrand = "江铃(顺达 未知 )"; break; 
	case jmc28503:   
		strBrand = "江铃(宝典 2007款)"; break;       
	case jmc28504: 
		strBrand = "江铃(宝典汽油版 2009款)"; break;      
	case jmc28505:  
		strBrand = "江铃(凯运 2010款)"; break;     
	case jmc28506: 
		strBrand = "江铃(宝典柴油版 2009款)"; break;      
	case jmc28507:
		strBrand = "江铃(未知1  未知)"; break;
	case jmc28508:  
		strBrand = "江铃(驭胜 2011-2012款)"; break; 
	case jmc28509: 
		strBrand = "江铃(宝威 2009款)"; break;      
	case jmc28510:  
		strBrand = "江铃(宝典 2013款)"; break;      
	case jmc28511: 
		strBrand = "江铃(宝威 2005款)"; break; 
	case jmc28512:    
		strBrand = "江铃(未知 未知)"; break;
	case jmc28513:
		strBrand = "江铃(凯锐800 未知)"; break;		//大货
	case jmc28514: 
		strBrand = "江铃(驭胜 2013款)"; break;	//中客
	case jmc28515: 
		strBrand = "江铃(驭胜 未知)"; break;	
	case jmc28900:    
		strBrand = "江铃(未知 未知)"; break; //大货********
	case jmc28901:    
		strBrand = "江铃(凯运)"; break; //大货********
		//金杯**********29000-29499***********//
	case jinb29000:
		strBrand = "金杯(大海狮 2011-2013款)"; break; 
	case jinb29001:  
		strBrand = "金杯(未知1 未知)"; break;
	case jinb29002:    
		strBrand = "金杯(阁瑞斯 2008款)"; break;      
	case jinb29003:    
		strBrand = "金杯(未知2 未知)"; break;
	case jinb29004:
		strBrand = "金杯(海星A7/A9 2011款)"; break;      
	case jinb29005: 
		strBrand = "金杯(海狮 2011,2014款)"; break;
	case jinb29006: 
		strBrand = "金杯(勤务兵/快运 2005款，2008款)"; break;    
	case jinb29007:
		strBrand = "金杯(海狮 2011款)"; break;   
	case jinb29008: 
		strBrand = "金杯(阁瑞斯 2007款,2010款)"; break;    
	case jinb29009: 
		strBrand = "金杯(海星A7/A9/T22 2011-2012款)"; break; 
	case jinb29010: 
		strBrand = "金杯(阁瑞斯 2008款,2013款)"; break;       
	case jinb29011: 
		strBrand = "金杯(金典007 2009款)"; break;      
	case jinb29012: 
		strBrand = "金杯(大力神 2009款)"; break; 
	case jinb29013:
		strBrand = "金杯(未知 未知)"; break;
	case jinb29400:
		strBrand = "金杯(未知 未知)";  break;    //中客********
	case jinb29401:
		strBrand = "金杯(未知 未知)";   //大货********
		//开瑞**********29500-29999***********//
	case karr29500: 
		strBrand = "开瑞(优雅2代 2013款)"; break;  
	case kary29501: 
		strBrand = "开瑞(优雅 2007款,2012款)"; break;   
	case kary29502: 
		strBrand = "开瑞(优劲 2012款)"; break;  
	case kary29503: 
		strBrand = "开瑞(优翼 2007款)"; break;  
	case kary29504:   
		strBrand = "开瑞(优胜2代 2010款)"; break;  //中客
	case kary29505:   
		strBrand = "开瑞(未知 未知)"; break;    //中客
	case kary29506:   
		strBrand = "开瑞(优优 2012款)"; break;    //中客
	case kary29507:   
		strBrand = "开瑞(优优2代 2013款)"; break;    //中客
		//理念**********30000-30499***********//
	case lini30000:
		strBrand = "理念(S1 2011-2012款)"; break;
	case lini30001:
		strBrand = "理念(S1 2014款)"; break;
		//力帆**********30500-30999***********//
	case lfan30500: 
		strBrand = "力帆(620 2008-2012款)"; break;  
	case lfan30501:  
		strBrand = "力帆(X60 2011-2012款)"; break;  
	case lfan30502:   
		strBrand = "力帆(320 2009-2012款)"; break;  
	case lfan30503:  
		strBrand = "力帆(520 2007款)"; break;       
	case lfan30504: 
		strBrand = "力帆(风顺 2011款)"; break;       
	case lfan30505:  
		strBrand = "力帆(520 2008-2011款)"; break;  
	case lfan30506: 
		strBrand = "力帆(520 2011款)"; break;       
	case lfan30507: 
		strBrand = "力帆(320 2009-2013款)"; break;  
	case lfan30508: 
		strBrand = "力帆(丰顺 2011款)"; break;   
	case lfan30509:  
		strBrand = "力帆(X60(发现版)  2012款)"; break; 
	case lfan30510:   
		strBrand = "力帆(X60		2012-2013款)"; break;    //中客
	case lfan30511:  
		strBrand = "力帆(720		2013-2014款)"; break;    //小客
	case lfan30512: 
		strBrand = "力帆(T21        2013款)"; break;      //中客
		//南京**********31000-31499***********//
	case nanj31000: 
		strBrand = "南京(未知1 未知)"; break; 
		//启辰**********31500-31999***********//
	case qich31500:
		strBrand = "启辰(R50 2012-2014款)"; break;   
	case qich31501: 
		strBrand = "启辰(D50 2012-2014款)"; break;   
		//威麟**********32000-32499***********//
	case rely32000: 
		strBrand = "威麟(V5 2009款)"; break;       
	case rely32001: 
		strBrand = "威麟(X5 2010-2011款)"; break;  
	case rely32002:	
		strBrand = "威麟(V5 2009-2012款)"; break;  
		//五十铃**********32500-32999***********//
	case isuz32500: 
		strBrand = "五十铃(Redeo 未知)"; break;   
	case isuz32501:   
		strBrand = "五十铃(100P轻型商用车  未知)"; break;   
	case isuz32502:   
		strBrand = "五十铃(庆铃T系列 2009款)"; break; 
	case isuz32503:    
		strBrand = "五十铃(600P轻型商用车  未知)"; break;   
	case isuz32504:   
		strBrand = "五十铃(未知1 未知)"; break;   
	case isuz32505: 
		strBrand = "五十铃(庆铃N系列 2009款)"; break; 
	case isuz32506:
		strBrand = "五十铃(未知 未知)"; break; 
	case isuz32507:
		strBrand = "五十铃(皮卡 2009款)"; break; 
	case isuz32508:
		strBrand = "五十铃(FRR中卡 未知)"; break; 
	case isuz32900:   
		strBrand = "五十铃(未知 未知)"; break;   //大货
		//夏利**********33000-33499***********//
	case xial33000:
		strBrand = "夏利(未知1 未知)"; break;   
	case xial33001:   
		strBrand = "夏利(未知2 未知)"; break;    
	case xial33002:  
		strBrand = "夏利(未知3 未知)"; break;    
	case xial33003:  
		strBrand = "夏利(夏利N3三厢 2004-2005款)"; break; 
	case xial33004:  
		strBrand = "夏利(夏利N3三厢 2008款)"; break;      
	case xial33005: 
		strBrand = "夏利(夏利A+ 2006,2010,2011款)"; break;  
	case xial33006: 
		strBrand = "夏利(未知 	未知)"; break;
		//羊城**********33500-33999***********//
	case ycac33500:
		strBrand = "羊城(骏铃  未知)"; break;      
	case ycac33501:   
		strBrand = "羊城(未知1 未知)"; break;      
		//一汽**********34000-34499***********//
	case yiqi34000: 
		strBrand = "一汽(佳宝V52 2011款)"; break;  
	case yiqi34001:   
		strBrand = "一汽(森雅M80 2009,2011款)"; break;    
	case yiqi34002:    
		strBrand = "一汽(威乐 2004款)"; break; 
	case yiqi34003:    
		strBrand = "一汽(威志三厢 2007-2011款)"; break;    
	case yiqi34004: 
		strBrand = "一汽(威志V2 2010,2012款)"; break;      
	case yiqi34005: 
		strBrand = "一汽(N1	未知)"; break;      
	case yiqi34006:
		strBrand = "一汽(夏利N7 2013款)"; break;    
	case yiqi34007: 
		strBrand = "一汽(夏利N5 2010-2014款)"; break;       
	case yiqi34008:
		strBrand = "一汽(森雅S80 2011,2013款)"; break; 
	case yiqi34009:
		strBrand = "一汽(夏利N5	未知)"; break; 
	case yiqi34010: 
		strBrand = "一汽(奔腾B50 2009-2013款)"; break;  
	case yiqi34011:
		strBrand = "一汽(奔腾B70 2006-2008款)"; break;  
	case yiqi34012:
		strBrand = "一汽(奔腾B70 2009-2011款)"; break;  
	case yiqi34013:
		strBrand = "一汽(未知1 未知)"; break; 
	case yiqi34014: 
		strBrand = "一汽(未知2 未知)"; break; 
	case yiqi34015: 
		strBrand = "一汽(奔腾B79 2012款)"; break;       
	case yiqi34016: 
		strBrand = "一汽(未知3 未知)"; break; 
	case yiqi34017:
		strBrand = "一汽(小解放 未知)"; break;
	case yiqi34018:
		strBrand = "一汽(一汽解放1  未知)"; break; 
	case yiqi34019:
		strBrand = "一汽(一汽501  未知)"; break;
	case yiqi34020: 
		strBrand = "一汽(森雅M80 2011款)"; break;       
	case yiqi34021: 
		strBrand = "一汽(霸铃 未知)"; break;
	case yiqi34022:
		strBrand = "一汽(威志 2006-2009款)"; break;  
	case yiqi34023: 
		strBrand = "一汽(威姿 2004,2011款)"; break; 
	case yiqi34024:
		strBrand = "一汽(佳宝T57 2011款)"; break;       
	case yiqi34025: 
		strBrand = "一汽(自由风 2005-2010款)"; break;  
	case yiqi34026:
		strBrand = "一汽(威志 2011款)"; break;       
	case yiqi34027:
		strBrand = "一汽(佳宝V70 2011款)"; break;       
	case yiqi34028:
		strBrand = "一汽(威志V5 2012-2013款)"; break;  
	case yiqi34029: 
		strBrand = "一汽(一汽解放2  未知)"; break; 
	case yiqi34030:
		strBrand = "一汽(未知 未知1)"; break;
	case yiqi34031:
		strBrand = "一汽(未知 未知2)"; break;
	case yiqi34032: 
		strBrand = "一汽(未知 未知3)"; break;
	case yiqi34033:   
		strBrand = "一汽(吉林佳星T51 2011款)"; break;
	case yiqi34034:   
		strBrand = "一汽(坤程 2011款)"; break;   //小货
	case yiqi34035:   
		strBrand = "一汽(威志V2 2010、2011款)"; break;   //中客
	case yiqi34036:   
		strBrand = "一汽(佳宝V80 2013、2014款)"; break;  //中客
	case yiqi34037:   
		strBrand = "一汽(奔腾B70 2014款)"; break;  
	case yiqi34038:   
		strBrand = "一汽(奔腾B90 2013-2014款)"; break;  
	case yiqi34400:   
		strBrand = "一汽(未知 未知4)"; break;  //大客
	case yiqi34401:
		strBrand = "一汽(未知 未知5)"; break;  //大货
		//依维柯**********34500-34999***********//
	case ivec34500: 
		strBrand = "依维柯(得意 2009,2012款)"; break;   
	case ivec34501:   
		strBrand = "依维柯(都灵 2009款)"; break;
	case ivec34502:   
		strBrand = "依维柯(康果 2003-2004款)"; break;   
	case ivec34503:   
		strBrand = "依维柯(得意 2009款)"; break;
	case ivec34504:  
		strBrand = "依维柯(未知1 未知)"; break;
	case ivec34505:  
		strBrand = "依维柯(宝迪 2009,2012款)"; break;   
	case ivec34900:
		strBrand = "依维柯(未知  未知)"; break;  //中客
		//跃进**********35000-35499***********//
	case yuej35000: 
		strBrand = "跃进(未知1 未知)"; break;  
	case yuej35001:   
		strBrand = "跃进(未知 未知)"; break; 
	case yuej35002:   
		strBrand = "跃进(小福星S50 未知)"; break;   //小货
		//长城**********35500-35999***********//
	case grtw35500:
		strBrand = "长城(赛影 2007款)"; break;
	case grtw35501:  
		strBrand = "长城(酷熊 2009-2010款)"; break;   
	case grtw35502:  
		strBrand = "长城(C20R 2011,2013款)"; break;  
	case grtw35503: 
		strBrand = "长城(M1 2009-2010款)"; break;   
	case grtw35504:
		strBrand = "长城(赛弗 2003-2004款)"; break;   
	case grtw35505:
		strBrand = "长城(C50 2012-2013款)"; break;     
	case grtw35506:
		strBrand = "长城(M2 2010款)"; break;  
	case grtw35507: 
		strBrand = "长城(风骏3 2011款)"; break;  
	case grtw35508:
		strBrand = "长城(嘉誉 2008-2009款)"; break;     
	case grtw35509:
		strBrand = "长城(H5 2010-2013款)"; break;     
	case grtw35510:
		strBrand = "长城(H6 2011-2014款)"; break;     
	case grtw35511: 
		strBrand = "长城(凌傲 2010-2011款)"; break;     
	case grtw35512:
		strBrand = "长城(M4 2012-2013款)"; break; 
	case grtw35513: 
		strBrand = "长城(H3 2005-2012款)"; break; 
	case grtw35514: 
		strBrand = "长城(C30 2010-2013款)"; break; 
	case grtw35515:
		strBrand = "长城(未知1 未知)"; break;
	case grtw35516: 
		strBrand = "长城(哈弗H6 2011-2012款)"; break; 
	case grtw35517:
		strBrand = "长城(哈弗H3锐意版 2009-2012款)"; break; 
	case grtw35518:
		strBrand = "长城(金迪尔 2008款)"; break;      
	case grtw35519: 
		strBrand = "长城(V80 2012-2013款)"; break; 
	case grtw35520: 
		strBrand = "长城(炫丽 2010-2011款)"; break; 
	case grtw35521:
		strBrand = "长城(炫丽 2008-2009款)"; break; 
	case grtw35522: 
		strBrand = "长城(精灵 2008-2009款)"; break; 
	case grtw35523: 
		strBrand = "长城(哈弗H3 2006-2007款)"; break; 
	case grtw35524: 
		strBrand = "长城(哈弗H3 2008款)"; break;      
	case grtw35525:
		strBrand = "长城(哈弗H3领先版 2009-2010款)"; break; 
	case grtw35526:
		strBrand = "长城(哈弗H5智尊版 2010-2012款)"; break; 
	case grtw35527: 
		strBrand = "长城(C30 2010款)"; break;      
	case grtw35528: 
		strBrand = "长城(C30 2012款)"; break;      
	case grtw35529: 
		strBrand = "长城(C30 2013款)"; break;      
	case grtw35530:
		strBrand = "长城(哈弗H5欧风版 2010-2011款)"; break; 
	case grtw35531:
		strBrand = "长城(风骏5 2011款)"; break;      
	case grtw35532: 
		strBrand = "长城(哈弗H5欧风版 2012款)"; break;      
	case grtw35533:
		strBrand = "长城(风骏5 2013款)"; break;
	case grtw35534:   
		strBrand = "长城(*** ***)"; break;  
	case grtw35535: 
		strBrand = "长城(M4 2012-201014款)"; break;  //中客
	case grtw35536:  
		strBrand = "长城(V80/嘉誉 2011款/2008，2009款)"; break;  //中客
	case grtw35537: 
		strBrand = "长城(哈弗H5 2012款)"; break;   //中客  
		//五菱**********36000-36499***********//
	case wuli36000: 
		strBrand = "五菱(五菱荣光 2011-2012款)"; break;   
	case wuli36001: 
		strBrand = "五菱(五菱之光 2013款)"; break;
	case wuli36002:  
		strBrand = "五菱(五菱之光 2008-2010款)"; break;   
	case wuli36003:  
		strBrand = "五菱(五菱兴旺 未知)"; break;  
	case wuli36004:   
		strBrand = "五菱(未知1 未知)"; break;  
	case wuli36005:
		strBrand = "五菱(五菱宏光 2010,2013款)"; break;  
	case wuli36006: 
		strBrand = "五菱(五菱之光 未知)"; break;  
	case wuli36007:
		strBrand = "五菱(宏光舒适/豪华型 2010,2013款)"; break;      
	case wuli36008:
		strBrand = "五菱(荣光标准型 2011-2012款)"; break;       
	case wuli36009:
		strBrand = "五菱(荣光基本型 2011-2012款)"; break;       
	case wuli36010:
		strBrand = "五菱(五菱之光(加保险杠) 2013款)"; break;
	case wuli36011:
		strBrand = "五菱(PN货车 2010款)"; break;
	case wuli36012:
		strBrand = "五菱(五菱之光基本型 2010款)"; break;
	case wuli36013:
		strBrand = "五菱(五菱之光实用型 2010款)"; break;
	case wuli36014: 
		strBrand = "五菱(宏光S 2013-2014款)"; break;   
	case wuli36015:
		strBrand = "五菱(五菱之光 2008款)"; break;    
	case wuli36016: 
		strBrand = "五菱(五菱之光立业型 2010款)"; break;       
	case wuli36017:
		strBrand = "五菱(五菱之光标准版 2010款)"; break;       
	case wuli36018:
		strBrand = "五菱(PN货车(加保险杠) 2010款)"; break;       
	case wuli36019:
		strBrand = "五菱(五菱之光实用型(加保险杠)2010款)"; break; 
	case wuli36020:
		strBrand = "五菱(五菱荣光 2012款)"; break; 
	case wuli36021:
		strBrand = "五菱(五菱宏光 2010款)"; break; 
	case wuli36022:
		strBrand = "五菱(五菱之光 2010款)"; break; 
	case wuli36023:
		strBrand = "五菱(五菱荣光 2014款)"; break; 
	case wuli36024:
		strBrand = "五菱(宏光 2010款)"; break;   //中客
		//中兴**********36500-36999***********//
	case zx36500:  
		strBrand = "中兴(无限V3 2008款)"; break;       
	case zx36501:     
		strBrand = "中兴(昌铃 2010款)"; break;   
	case zx36502:   
		strBrand = "中兴(未知1 未知)"; break;       
	case zx36503:  
		strBrand = "中兴(威虎TUV 2011,2013款)"; break; 
	case zx36504:  
		strBrand = "中兴(威虎G3 2010-2013款)"; break;  
		//讴歌**********37000-37499***********//
	case acur37000:
		strBrand = "讴歌(讴歌TL 2009-2012款)"; break;     
	case acur37001:      
		strBrand = "讴歌(讴歌TSX 2009-2011款)"; break;     
	case acur37002:   
		strBrand = "讴歌(威旺306 2011,2013款)"; break;    
	case acur37003:  
		strBrand = "讴歌(RDX 2010-2013款)"; break; 
	case acur37004: 
		strBrand = "讴歌(MDX 2007,2009款)"; break;
	case acur37005: 
		strBrand = "讴歌(TSX 2009款)"; break;      
	case acur37006: 
		strBrand = "讴歌(ZDX 2009,2012款)"; break;
		//北汽**********37500-37999***********//
	case beiq37500:
		strBrand = "北汽(北汽制造  未知)"; break;       
	case beiq37501:  
		strBrand = "北汽(北汽制造骑士S12 2009款)"; break;     
	case beiq37502:  
		strBrand = "北汽(北京汽车  未知)"; break;       
	case beiq37503: 
		strBrand = "北汽(北京汽车E系列 2012-2013款)"; break;
	case beiq37504:  
		strBrand = "北汽(北汽威望 2011,2013款)"; break;
	case beiq37505: 
		strBrand = "北汽(威旺306 2011,2013款)"; break;
	case beiq37506: 
		strBrand = "北汽(未知 未知)"; break;
	case beiq37507: 
		strBrand = "北汽(北汽威旺M20 2013-2014款)"; break;   //中客
	case beiq37508: 
		strBrand = "北汽(北汽制造 陆铃 2012款)"; break;  //小货
	case beiq37509: 
		strBrand = "北汽(北汽威旺T205-D/北汽威旺T205 2013款/2013款)"; break; //小货/中客
	case beiq37510: 
		strBrand = "北汽(北汽制造BJ 212	2012款)"; break;     
	case beiq37511: 
		strBrand = "北汽(未知 未知)"; break;      
	case beiq37512: 
		strBrand = "北汽制造(路霸 2012款)"; break;    
		//大宇**********38000-38499***********//
	case daew38000:
		strBrand = "大宇(两厢凯越 未知)"; break;  
	case daew38001:
		strBrand = "大宇(未知 未知)"; break; 
	case daew38400:    
		strBrand = "大宇(未知  未知)"; break;   //大客
		//吉奥**********38500-38999***********//
	case gono38500: 
		strBrand = "吉奥(帅舰 2009款)"; break;  
	case gono38501:      
		strBrand = "吉奥(财运100 2009,2012款)"; break;  
	case gono38502:        
		strBrand = "吉奥(未知    未知)"; break; 
	case gono38503:  
		strBrand = "吉奥(帅舰	     2012款)"; break; 
	case gono38504:  
		strBrand = "吉奥(财运100	 2012款)"; break; 
	case gono38505:  
		strBrand = "吉奥(星旺CL	 2012款)"; break;    //小客
	case gono38506: 
		strBrand = "吉奥(星朗	     2013-2014款)"; break;   //中客
	case gono38507: 
		strBrand = "吉奥(财运100	 未知)"; break;          //中客
	case gono38508: 
		strBrand = "吉奥(星旺CL	 未知)"; break;          //小货
		//华泰**********39000-39499***********//
	case hawt39000: 
		strBrand = "华泰(圣达菲 2008-2013款)"; break;  
	case hawt39001:   
		strBrand = "华泰(圣达菲自动四驱 2012款)"; break;       
	case hawt39002:   
		strBrand = "华泰(圣达菲手动两驱 2012款)"; break; 
	case hawt39003:   
		strBrand = "华泰(未知  未知)"; break;
		//陆风**********39500-39999***********//
	case ldwd39500: 
		strBrand = "陆风(陆风X6 2006,2008,2011款)"; break;  
	case ldwd39501:	   
		strBrand = "陆风(风华 2007-2008款)"; break;
	case ldwd39502:     
		strBrand = "陆风(陆风X5 2013款)"; break;     
	case ldwd39503:    
		strBrand = "陆风(龙腾 2006款)"; break;     
	case ldwd39504:  
		strBrand = "陆风(龙腾 2008款)"; break;   
	case ldwd39505:  
		strBrand = "陆风(X8	2012，2014款)"; break;     //中客    
	case ldwd39506:  
		strBrand = "陆风(风华 2007,2008款)"; break;   
	case ldwd39507:  
		strBrand = "陆风(风尚 未知)"; break;        //中客
		//瑞麒**********40000-40499***********//
	case riic40000: 
		strBrand = "瑞麒(G3 2010-2012款)"; break;      
	case riic40001:  
		strBrand = "瑞麒(G5 2010-2012款)"; break;      
	case riic40002:   
		strBrand = "瑞麒(M1 2009-2011,2013款)"; break;
	case riic40003:  
		strBrand = "瑞麒(M5  未知)"; break;     
	case riic40004: 
		strBrand = "瑞麒(G3 2010款)"; break;   
	case riic40005: 
		strBrand = "瑞麒(未知1 未知)"; break;     
	case riic40006: 
		strBrand = "瑞麒(G5 2010款)"; break; 
	case riic40007:
		strBrand = "瑞麒(X1 2010-2012款)"; break;  
	case riic40008: 
		strBrand = "瑞麒(未知 未知)"; break;  
	case riic40009: 
		strBrand = "瑞麒(G6	2011款)"; break;  
		//曙光**********40500-40999***********//
	case sg40500:  
		strBrand = "曙光(旗胜V3 2011款)"; break;
	case sg40501:  
		strBrand = "曙光(挑战者SUV 2010款)"; break;
	case sg40502:  
		strBrand = "曙光(大柴神	2009款)"; break;    //小货
	case sg40503:  
		strBrand = "曙光(挑战者 2010款)"; break;    //中客
	case sg40504:  
		strBrand = "曙光(未知 未知)"; break;
	case sg40505:  
		strBrand = "曙光(傲骏 2009款)"; break;    //小货
	case sg40506:  
		strBrand = "曙光(旗胜F1	2010,2012款)"; break;	  //中客
	case sg40507:  
		strBrand = "曙光((黄海)大柴神	2009,2012款)"; break;	  //中客
	case sg40508:  
		strBrand = "曙光((黄海)N1	2014款)"; break;	  //中客
		//双环**********41000-41499***********// 
	case shhn41000: 
		strBrand = "双环(未知1  未知)"; break;      
	case shhn41001: 
		strBrand = "双环(SCEO 2006,2009,2011款)"; break;
	case shhn41002:  
		strBrand = "双环(SCEO 2005款)"; break;    
	case shhn41003: 
		strBrand = "双环(来宝SRV 2004款)"; break;    
	case shhn41004: 
		strBrand = "双环(未知2 未知)"; break;  
	case shhn41400:    
		strBrand = "双环(未知 未知)"; break;     //大货
		//双龙**********41500-41999***********//
	case shlg41500: 
		strBrand = "双龙(爱腾 2006款)"; break;
	case shlg41501:      
		strBrand = "双龙(未知1  未知)"; break; 
	case shlg41502:    
		strBrand = "双龙(主席 2002,2004款)"; break;  
	case shlg41503:   
		strBrand = "双龙(主席 2012款)"; break;
	case shlg41504:    
		strBrand = "双龙(路帝 2008款)"; break;  //中客
	case shlg41505:    
		strBrand = "双龙(柯兰多	2014款)"; break;   //中客
	case shlg41506:    
		strBrand = "双龙(爱腾	2014款)"; break;   
	case shlg41507:    
		strBrand = "双龙(雷斯特W  2014款)"; break; 
		//华普**********42000-42499***********//
	case sma42000: 
		strBrand = "华普(海尚 2005款)"; break;     
	case sma42001:   
		strBrand = "华普(海域 2004-2007款)"; break; 
	case sma42002:   
		strBrand = "华普(海锋 2007款)"; break;      
	case sma42003:  
		strBrand = "华普(海迅 2006-2007款)"; break; 
	case sma42004:   
		strBrand = "华普(海炫 未知)"; break;       
	case sma42005:    
		strBrand = "华普(海迅 2004款)"; break;      
	case sma42006:    
		strBrand = "华普(海迅 2005款)"; break;     
	case sma42007:   
		strBrand = "华普(海域 2004款)"; break;     
		//众泰**********42500-42999***********//
	case zoty42500: 
		strBrand = "众泰(5008 2008,2010款)"; break;    
	case zoty42501:    
		strBrand = "众泰(5008 2010款)"; break;  
	case zoty42502:    
		strBrand = "众泰(Z300 2012-2014款)"; break;   //小客
	case zoty42503:    
		strBrand = "众泰(5008 2008,2010款)"; break;      
	case zoty42504:    
		strBrand = "众泰(2008 2008,2010款)"; break;  
	case zoty42505:    
		strBrand = "众泰(未知 未知)"; break;  
		//长安**********43000-43499***********//
	case chan43000: 
		strBrand = "长安(长安之星 2009款)"; break;  
	case chan43001:      
		strBrand = "长安(长安V5 2013款)"; break;  
	case chan43002:      
		strBrand = "长安(金牛星 2011款)"; break;  
	case chan43003:      
		strBrand = "长安(长安星光 2007款)"; break;  
	case chan43004:      
		strBrand = "长安(欧诺 2012款)"; break;  
	case chan43005: 
		strBrand = "长安(杰勋 2007,2009款)"; break;    
	case chan43006:	 
		strBrand = "长安(长安之星2 2009款)"; break;       
	case chan43007:	 
		strBrand = "长安(长安之星2 2012款)"; break;       
	case chan43008: 
		strBrand = "长安(奔奔mini 2010-2012款)"; break;  
	case chan43009: 
		strBrand = "长安(CS35 2012,2014款)"; break; 
	case chan43010: 
		strBrand = "长安(悦翔三厢 2009-2012款)"; break;  
	case chan43011: 
		strBrand = "长安(逸动 2012-2014款)"; break;  
	case chan43012: 
		strBrand = "长安(长安之星 2013款)"; break;       
	case chan43013: 
		strBrand = "长安(奥拓	 1999-2000款)"; break;  
	case chan43014: 
		strBrand = "长安(雅科仕 2004-2014款)"; break;  
	case chan43015: 
		strBrand = "长安(未知1 未知)"; break;     
	case chan43016: 
		strBrand = "长安(悦翔V3 2012款)"; break;       
	case chan43017:
		strBrand = "长安(奔奔i 2006-2008款)"; break; 
	case chan43018:
		strBrand = "长安(悦翔两厢 2010款)"; break;      
	case chan43019:
		strBrand = "长安(CX20 2011,2014款)"; break;
	case chan43020: 
		strBrand = "长安(未知1 未知)"; break;     
	case chan43021: 
		strBrand = "长安(悦翔 2012款)"; break;      
	case chan43022: 
		strBrand = "长安(悦翔 2009-2011款)"; break; 
	case chan43023: 
		strBrand = "长安(奔奔LOVE 2010款)"; break;      
	case chan43024:
		strBrand = "长安(长安星光4500 2012款)"; break;      
	case chan43025: 
		strBrand = "长安(商用星卡 未知)"; break;      
	case chan43026:
		strBrand = "长安(逸动 2012-2013款)"; break; 
	case chan43027: 
		strBrand = "长安(CX20 未知)"; break;
	case chan43028:
		strBrand = "长安(商用CM8  未知)"; break;     
	case chan43029: 
		strBrand = "长安(星光小卡 2007款)"; break;      
	case chan43030: 
		strBrand = "长安(奔奔i 2007款)"; break;      
	case chan43031: 
		strBrand = "长安(CX30 2012款)"; break;      
	case chan43032: 
		strBrand = "长安(欧力威 2013款)"; break;  
	case chan43033: 
		strBrand = "长安(金牛星 2011,2013款)"; break;   
	case chan43034: 
		strBrand = "长安(奔奔Mini 2012款)"; break; 
	case chan43035: 
		strBrand = "长安(CX20 未知)"; break;    
	case chan43036: 
		strBrand = "长安(星卡 未知)"; break;  
	case chan43037: 
		strBrand = "长安(未知 未知)"; break;
	case chan43038: 
		strBrand = "长安(神骐    2012款)"; break;   //小货
	case chan43039: 
		strBrand = "长安(悦翔V3  2012款)"; break;   //小客
	case chan43040: 
		strBrand = "长安(长安V5  2013款)"; break;   //中客
	case chan43041: 
		strBrand = "长安(欧力威  2014款)"; break;  //中客
	case chan43042: 
		strBrand = "长安(CX20 2014款)"; break;     //中客
	case chan43043: 
		strBrand = "长安(CS35 2012、2014款)"; break;   //中客
	case chan43044: 
		strBrand = "长安(悦翔 2011款)"; break;         
	case chan43045: 
		strBrand = "长安(奔奔MINI 2012款)"; break;   //中客
	case chan43046: 
		strBrand = "长安(奔奔MINI 未知)"; break;   //中客
	case chan43047: 
		strBrand = "长安(长安星卡 2013款)"; break;   //小货
	case chan43048: 
		strBrand = "长安(悦翔V5 2012款)"; break;  
	case chan43049: 
		strBrand = "长安(睿骋 2013-2014款)"; break;  
	case chan43050: 
		strBrand = "长安(CX30 2010-2011款)"; break;  
	case chan43051: 
		strBrand = "长安(志翔 2008款)"; break;  
		//道奇**********43500-43999***********//
	case dodg43500: 
		strBrand = "道奇(酷博 2008-2011款)"; break;  
	case dodg43501:  
		strBrand = "道奇(未知1 未知)"; break; 
	case dodg43502:  
		strBrand = "道奇(酷威 2009-2011款)"; break;  
	case dodg43503:  
		strBrand = "道奇(酷威 2013款)"; break;       
	case dodg43504:	 
		strBrand = "道奇(凯领（进口） 2013款)"; break;       
	case dodg43505:
		strBrand = "道奇(酷威 未知)"; break;
	case dodg43506: 
		strBrand = "道奇(凯领 2007款)"; break;       
		//哈弗**********44000-44499***********//
	case hava44000: 
		strBrand = "哈弗(H6 2011-2014款)"; break;     
	case hava44001:     
		strBrand = "哈弗(H6 2013款)"; break;  
	case hava44002:     
		strBrand = "哈弗(H6 2012款)"; break;  
	case hava44003:    
		strBrand = "哈弗(M2 2012款)"; break;  
	case hava44004:         
		strBrand = "哈弗(H6	2013、2014款)"; break;  //中客
		//纳智捷**********44500-44999***********//
	case luxg44500:
		strBrand = "纳智捷(大7SUV 2011-2012款)"; break; 
	case luxg44501: 
		strBrand = "纳智捷(5Sedan 2013-2014款)"; break; 
	case luxg44502:  
		strBrand = "纳智捷(U7TURBO 2010款)"; break;      
	case luxg44503: 
		strBrand = "纳智捷(大7MPV 2013款)"; break;   
	case luxg44504:        
		strBrand = "纳智捷(*** ***)"; break; 
	case luxg44505:        
		strBrand = "纳智捷(大7SUV锋芒限量版	2012款)"; break;   //中客
	case luxg44506:        
		strBrand = "纳智捷(U6 TURBO	2014款)"; break;
		//精灵**********45000-45499***********//
	case smar45000:
		strBrand = "精灵(fortwo 2009-2014款)"; break; 
	case smar45001:  
		strBrand = "精灵(fortwo 2009-2011款)"; break; 
	case smar45002:  
		strBrand = "精灵(fortwo 2012-2013款)"; break; 
		//福田**********45500-45999***********//
	case foto45500: 
		strBrand = "福田(风景 2011-2012款)"; break; 
	case foto45501: 
		strBrand = "福田(风景 2009款)"; break;      
	case foto45502: 
		strBrand = "福田(蒙派克 2010-2013款)"; break; 
	case foto45503: 
		strBrand = "福田(风景 2012款)"; break;      
	case foto45504: 
		strBrand = "福田(蒙派克E财富快车标准版 2010-2012款)"; break;     
	case foto45505:   
		strBrand = "福田(萨普V系列 未知)"; break;
	case foto45506:
		strBrand = "福田(未知1 未知)"; break;      
	case foto45507: 
		strBrand = "福田(时代领航1/领航2  未知)"; break;       
	case foto45508:
		strBrand = "福田(时代驭菱V1/VQ1 未知)"; break;       
	case foto45509: 
		strBrand = "福田(奥铃  未知)"; break;      
	case foto45510:
		strBrand = "福田(时代轻卡领航  未知)"; break;       
	case foto45511:
		strBrand = "福田(时代小卡之星2 未知)"; break;       
	case foto45512:
		strBrand = "福田(萨普Z系列 2011款)"; break;       
	case foto45513: 
		strBrand = "福田(欧曼  未知)"; break;      
	case foto45514: 
		strBrand = "福田(蒙派克E商务标准型 2012款)"; break;      
	case foto45515: 
		strBrand = "福田(时代  未知)"; break;      
	case foto45516:
		strBrand = "福田(欧马可  未知)"; break;      
	case foto45517:
		strBrand = "福田(时代驭菱V5/VQ5 未知)"; break; 
	case foto45518:   
		strBrand = "福田(未知 未知1)"; break;
	case foto45519:   
		strBrand = "福田(未知 未知2)"; break;
	case foto45520:   
		strBrand = "福田(未知 未知3)"; break;
	case foto45521:    
		strBrand = "福田(迷笛 2014款)"; break;   //中客
	case foto45522:	
		strBrand = "福田(欧马可3 未知)"; break;	 //大货
	case foto45523:   
		strBrand = "福田(风景快客/海狮 2006款)"; break;  //中客（面包）
	case foto45900:
		strBrand = "福田(未知 未知4)"; break;  //大客
	case foto45901:
		strBrand = "福田(未知 未知5)"; break;  //大货
	case foto45902:
		strBrand = "福田(未知 未知6)"; break;  //中客
	case foto45903:
		strBrand = "福田(时代)"; break;  //中客
	case foto45904:
		strBrand = "福田(Auman)"; break;  //中客
	case foto45905:
		strBrand = "福田(福田五星)"; break;  //中客
		//中顺**********46000-46499***********//
	case pols46000:
		strBrand = "中顺(世纪1	未知)"; break; 
	case pols46001: 
		strBrand = "中顺(世纪2	未知)"; break; 
	case pols46002: 
		strBrand = "中顺(世纪3	未知)"; break; 
	case pols46003:
		strBrand = "中顺(世纪 未知)"; break; 
		//劳斯莱斯**********46500-46999***********//
	case rsrc46500:
		strBrand = "劳斯莱斯(古斯特/魅影/幻影  未知)"; break;  
		//长丰**********47000-47499***********//
	case chfg47000:
		strBrand = "长丰(猎豹黑金刚 未知)"; break;  
	case chfg47001:
		strBrand = "长丰(三菱帕杰罗 未知)"; break;  
	case chfg47002:
		strBrand = "长丰(猎豹CS6 2007款)"; break;  
	case chfg47003:
		strBrand = "长丰(扬子飞系皮卡 未知)"; break;  
	case chfg47004:
		strBrand = "长丰(猎豹飞腾经典版  未知)"; break;   
	case chfg47005:
		strBrand = "长丰(猎豹飞腾时尚版  未知)"; break;  
	case chfg47006:
		strBrand = "长丰(飞扬  2010款)"; break;   //小货
		//广汽**********47500-47999***********//
	case guaq47500:
		strBrand = "广汽(传祺 2012-2014款)"; break; 
		//金旅**********48000-48499***********//
	case gold48000:
		strBrand = "金旅(考斯特 2010款)"; break;      
	case gold48001:
		strBrand = "金旅(海狮 2010款)"; break;  
	case gold48002:       
		strBrand = "金旅(*** ***)"; break; 
	case gold48400:
		strBrand = "金旅(未知 未知)"; break;    //大客
	case gold48401:      
		strBrand = "金旅(未知 未知)"; break; 
		//双龙**********48500-48999***********//
	case ssan48500:
		strBrand = "双龙(陆帝 2007-2008款)"; break; 
	case ssan48501:
		strBrand = "双龙(未知1 未知)"; break;
	case ssan48502:
		strBrand = "双龙(主席 2002-2004款)"; break; 
		//林肯**********49000-49499***********//
	case linc49000:
		strBrand = "林肯(领航员 2004-2005款)"; break;   
	case linc49001:
		strBrand = "林肯(领航员 2010款)"; break;
	case linc49002:
		strBrand = "林肯(MKX 2011款)"; break; 
		//"五征**********49500-49999***********//
	case waw49500:  
		strBrand = "五征(未知 未知1)"; break; 
	case waw49501:       
		strBrand = "五征(未知 未知2)"; break; 
	case waw49502:       
		strBrand = "五征(未知 未知3)"; break; 
	case waw49900:       
		strBrand = "五征(未知 未知)"; break;
		//解放**********50000-50499***********//
	case jief50000: 
		strBrand = "解放(未知 未知)"; break; 
		//春兰**********50500-50999***********//
	case chnl50500: 
		strBrand = "春兰(未知 未知)"; break; 
		//日野**********51000-51499***********//
	case hino51000: 
		strBrand = "日野(未知 未知)"; break; 
		//凯马**********51500-51999***********//
	case kama51500:  
		strBrand = "凯马(未知 未知1)"; break; 
	case kama51501:      
		strBrand = "凯马(未知 未知2)"; break; 

		//前黄牌添加**********************************/
	case kama51900:       //凯马  未知 未知1 //大货
		strBrand = "凯马(未知 未知1)"; break; 
		/***********************前黄牌添加****LiuDan***********************/

		//中国重汽*******52000-52499**********//
	case cnht52000:
		strBrand = "中国重汽(未知 未知1)"; break; // 未知 未知1   //大货
	case cnht52001:
		strBrand = "中国重汽(HOWO)"; break; // 未知 未知1   //大货
	case cnht52002:
		strBrand = "中国重汽(HOWO 3xx)"; break; // 未知 未知1   //大货
	case cnht52003:
		strBrand = "中国重汽(斯太尔)"; break; // 未知 未知1   //大货
	case cnht52004:
		strBrand = "中国重汽(金王子)"; break; // 未知 未知1   //大货
	case cnht52005:
		strBrand = "中国重汽(黄河少帅)"; break; // 未知 未知1   //大货
	case cnht52006:
		strBrand = "中国重汽"; break; // 未知 未知1   //大货

		//东风柳州********52500-52999*********//
	case dflz52500:
		strBrand = "东风柳州(未知 未知1)";  break;  //大客
	case dflz52501:     
		strBrand = "东风柳州(未知 未知2)";  break;   //大货
		//北奔重卡********53000-53499*********//
	case bebt53000:
		strBrand = "北奔重卡(未知 未知)"; break; //  未知  未知   //大货
	case bebt53001:
		strBrand = "北奔重卡(Actros)"; break; //  未知  未知   //大货
		//陕汽重卡********53500-53999*********//
	case shcn53500:
		strBrand = "陕汽重卡(未知 未知)"; break; // 未知  未知    //大货
	case shcn53501:
		strBrand = "陕汽重卡(F2000/F3000)"; break; // 未知  未知    //大货
	case shcn53502:
		strBrand = "陕汽重卡(新M3000)"; break; // 未知  未知    //大货
	case shcn53503:
		strBrand = "陕汽重卡(奥龙)"; break; // 未知  未知    //大货
	case shcn53504:
		strBrand = "陕汽重卡(德龙)"; break; // 未知  未知    //大货
		//华菱********54000-54499*********//
	case camc54000:
		strBrand = "华菱"; break; // 未知  未知  //大货
		//跃进********54500-54999*********//
	case yuji54500:
		strBrand = "跃进"; break; //  未知   未知   //大货
		//红岩********55000-55499*********//
	case hoya55000:
		strBrand = "红岩"; break; //   未知   未知   //大货
		//王牌********55500-55999*********//
	case cdw55500: 
		strBrand = "王牌(未知 未知)"; break;   //   //大货
	case cdw55501:
		strBrand = "王牌(未知 未知)"; break;
		//曼********56000-56499*********//
	case man56000: 
		strBrand = "曼(未知 未知)"; break; //大客  
	case man56001: 
		strBrand = "曼(未知 未知)"; break;  //大货
		//日产柴********56500-56999*********//
	case ud56500:
		strBrand = "日产柴"; break; // 未知   未知   //大货
		//徐工********57000-57499*********//
	case xcmg57000:
		strBrand = "徐工"; break; //  未知   未知   //大货
		//华德********57500-57999*********//
	case huad57500:
		strBrand = "华德(未知 未知)"; break; //  未知    未知   //大客   
	case huad57501:
		strBrand = "华德(未知 未知2)"; break; //中客
		//海格********58000-58499*********//
	case hige58000:
		strBrand = "海格(未知 未知)"; break;  //大客
	case hige58001:
		strBrand = "海格(未知 未知)"; break;   //中客
	case hige58002:
		strBrand = "海格(未知 未知)"; break;   //小货
		//宇通********58500-58999*********//
	case yuto58500:
		strBrand = "宇通"; break; //  未知   未知   //大客
		//青年********59000-59499*********//
	case yoma59000:
		strBrand = "青年"; break; //  未知  未知   //大客
		//江淮汽车********59500-59999*********//
	case jahu59500:
		strBrand = "江淮汽车"; break; //  未知    未知  //大客
		//上海申通********60000-60499*********//
	case sulo60000: 
		strBrand = "上海申通"; break; //  未知     未知  //大客
		//中通********60500-60999*********//
	case zhto60500: 
		strBrand = "中通"; break; //  未知    未知  //大客
		//亚星客车********61000-61499*********//
	case yaxi61000:
		strBrand = "亚星客车"; break; //  未知    未知   //大客
		//金龙客车********61500-61999*********//
	case jinl61500:
		strBrand = "金龙客车(未知 未知)"; break;  //大客
	case jinl61501:
		strBrand = "金龙客车(未知 未知)"; break;  //中客
	case jinl61502:
		strBrand = "金龙(金威 2014款)"; break;  //中客
		//三一********62000-62499*********////修改：将骏马改成三一
	case sany62000:
		strBrand = "三一"; break; //  未知    未知   //大货
		//南骏********62500-62999*********//
	case njun62500:
		strBrand = "南骏(未知 未知1)"; break; //大货     //修改
	case njun62501:      
		strBrand = "南骏(未知 未知2)"; break; //大客
	case njun62502:      
		strBrand = "南骏(未知 未知)";  break;
		//十通********63000-63499*********//
	case shto63000: 
		strBrand = "十通"; break; //  未知    未知   //大货
		//斯堪尼亚********63500-63999*********//
	case scan63500: 
		strBrand = "斯堪尼亚"; break; //  未知    未知   //大货
		//安凯客车********64000-64499*********//   //修改
	case akai64000:
		strBrand = "安凯客车"; break; //  未知   未知   //大客
		//牡丹花都********64500-64999*********//   //修改
	case mdhd64500:
		strBrand = "牡丹花都"; break; //  未知   未知   //大客
		//蜀都公交********65000-65499*********//   //修改
	case shud65000:
		strBrand = "蜀都公交"; break; //  未知   未知   //大客
		//未知大客********65500-65999*********//    //修改
	case busx65500: 
		strBrand = "公交车（***   ***)"; break; //  ***   ***    //大客
		//春兰********66000-66499*********// 
	case chnl66000: 
		strBrand = "春兰(未知 未知)"; break;

		//日野********66500-66999*********// 
	case hino66500: 
		strBrand = "日野(未知 未知)"; break;

		//飞驰********67000-67499*********// 
	case fech67000: 
		strBrand = "飞驰(未知 未知)"; break;

		//联合********67500-67999*********// 
	case cc67500: 
		strBrand = "联合(未知 未知)"; break;

		//20140820
		//神野********68000-68499*********//
	case shy68000: 
		strBrand = "神野(未知 未知)"; break;

		//唐骏*******68500-68999*********//
	case tkng68500: 
		strBrand = "唐骏(未知 未知)"; break;

		//轻骑微卡*******69000-69499*********//
	case qngq69000: 
		strBrand = "轻骑微车(未知 未知)"; break;

		//黄海客车*******69500-69999*********//
	case hugh69500: 
		strBrand = "黄海客车(未知 未知)"; break;

		//瑞沃*******70000-70499*********//
	case rowo70000: 
		strBrand = "瑞沃(未知 未知)"; break;
	case rowo70001: 
		strBrand = "瑞沃(时代)"; break;

		//川汽野马*****70500-70999*********//
	case chqy70500: 
		strBrand = "野马(F10 2011-2012款)"; break;  //中客（suv）

	case chqy70501: 
		strBrand = "野马(F12 2012款)"; break;  
	case chqy70502: 
		strBrand = "野马(F12 2014款)"; break;  

		//新凯********71000-71499**********//
	case xk71000: 
		strBrand = "新凯(未知 未知)"; break;      //小货

		//永源********71500-71999**********//
	case jonw71500: 
		strBrand = "永源(A380 2013款)"; break;    
	case jonw71501: 
		strBrand = "永源(猎鹰 2013款)"; break;    
	case jonw71502: 
		strBrand = "永源(五星 2012款)"; break;   

		//时风********72000-72499**********//
	case sfc72000: 
		strBrand = "时风(风顺)"; break;   
		//楚风********72500-72999**********//
	case cf72500: 
		strBrand = "楚风(未知 未知)"; break;   
		//三环********73000-73499**********//
	case thrc73000: 
		strBrand = "三环昊龙(未知 未知)"; break;   
	case thrc73001: 
		strBrand = "三环(三环征龙)"; break; 
	case blk73500: 
		strBrand = "百路佳(未知 未知)"; break;   
	case bfno74000: 
		strBrand = "北方尼奥普兰(未知 未知)"; break;   
	case OTHERS:
		strBrand = "其他"; break;
	}
	return strBrand;
}


UINT32 CBrandSusection::GetOldBrandFromDetail( UINT32 uDetalBrand )
{
	if(uDetalBrand >= 0 && uDetalBrand <= 154)
		return uDetalBrand;
	UINT32 uCarBrand = uDetalBrand;
	const int nBrandOther = 200000;
	//奥迪**********200-499***********//
	if(uCarBrand >= 200 && 499 >= uCarBrand) return AUDI;
	//大众**********500-999***********//
	if(uCarBrand >= 500 && 999 >= uCarBrand) return VW;
	//宝马**********1000-1499***********// 
	if(uCarBrand >= 1000 && 1499 >= uCarBrand) return BMW;
	//本田**********1500-1999***********//
	if(uCarBrand >= 1500 && 1999 >= uCarBrand) return HONDA;
	//别克**********2000-2499***********//
	if(uCarBrand >= 2000 && 2499 >= uCarBrand) return BUICK;
	//奔驰**********2500-2999***********//
	if(uCarBrand >= 2500 && 2999 >= uCarBrand) return BENZ;
	//现代**********3000-3499***********//
	if(uCarBrand >= 3000 && 3499 >= uCarBrand) return HYUNDAI;
	//福特**********3500-3999***********//
	if(uCarBrand >= 3500 && 3999 >= uCarBrand) return FORD;
	//起亚**********4000-4499***********//
	if(uCarBrand >= 4000 && 4499 >= uCarBrand) return KIA;
	//马自达**********4500-4999***********//
	if(uCarBrand >= 4500 && 4999 >= uCarBrand) return MAZDA;
	//日产**********5000-5499***********//
	if(uCarBrand >= 5000 && 5499 >= uCarBrand) return UD;
	//标志**********5500-5999***********//
	if(uCarBrand >= 5500 && 5999 >= uCarBrand) return PEUGEOT;

	//丰田**********6000-6499***********//
	if(uCarBrand >= 6000 && 6499 >= uCarBrand) return TOYOTA;
	//雪佛兰**********6500-6999***********//
	if(uCarBrand >= 6500 && 6999 >= uCarBrand) return CHEVROLET;	
	//雪铁龙**********7000-7499***********//
	if(uCarBrand >= 7000 && 7499 >= uCarBrand) return CITERON;	
	//斯柯达**********7500-7999***********//
	if(uCarBrand >= 7500 && 7999 >= uCarBrand) return SKODA;	
	//沃尔沃**********8000-8499***********//
	if(uCarBrand >= 8000 && 8499 >= uCarBrand) return VOLVO;	
	//雷克萨斯**********8500-8999***********//无
	if(uCarBrand >= 8500 && 8999 >= uCarBrand) return LEX;
	//雷诺**********9000-9499***********//
	if(uCarBrand >= 9000 && 9499 >= uCarBrand) return RENAULT;	
	//三菱**********9500-9999***********//
	if(uCarBrand >= 9500 && 9999 >= uCarBrand) return MITSUBISHI;	
	//比亚迪**********10000-10499***********//
	if(uCarBrand >= 10000 && 10499 >= uCarBrand) return BYD;	
	//路虎**********10500-10999***********//
	if(uCarBrand >= 10500 && 10999 >= uCarBrand) return LANDROVER;
	//凯迪拉克**********11000-11499***********//
	if(uCarBrand >= 11000 && 11499 >= uCarBrand) return CADILLAC;	
	//斯巴鲁**********11500-11999***********//
	if(uCarBrand >= 11500 && 11999 >= uCarBrand) return SUBARU;	 
	//克莱斯勒**********12000-12499***********//
	if(uCarBrand >= 12000 && 12499 >= uCarBrand) return CHRYSLER;	
	//皇冠**********12500-12999***********//
	if(uCarBrand >= 12500 && 12999 >= uCarBrand) return CROWN;	
	//菲亚特**********13000-13499***********//
	if(uCarBrand >= 13000 && 13499 >= uCarBrand) return FIAT;

	//英菲尼迪**********13500-13999***********//
	if(uCarBrand >= 13500 && 13999 >= uCarBrand) return INFINITI;
	//迷你**********14000-14499***********//
	if(uCarBrand >= 14000 && 14499 >= uCarBrand) return MINI;	
	//捷豹**********14500-14999***********//
	if(uCarBrand >= 14500 && 14999 >= uCarBrand) return JAGUAR;	
	//宾利**********15500-15999***********//
	if(uCarBrand >= 15500 && 15999 >= uCarBrand) return BNTLY;	
	//吉普**********16000-16499***********//
	if(uCarBrand >= 16000 && 16499 >= uCarBrand) return JEEP;	               
	//莲花**********16500-16999***********//
	if(uCarBrand >= 16500 && 16999 >= uCarBrand) return LOTUS;	
	//欧宝**********17000-17499***********//
	if(uCarBrand >= 17000 && 17499 >= uCarBrand) return OPEL;	
	//玛莎拉蒂**********17500-17999***********//
	if(uCarBrand >= 17500 && 17999 >= uCarBrand) return MASERATI;	
	//保时捷**********18000-18499***********// 
	if(uCarBrand >= 18000 && 18499 >= uCarBrand) return PORSCHE;	
	//荣威**********18500-18999***********//
	if(uCarBrand >= 18500 && 18999 >= uCarBrand) return ROWE;	
	//铃木**********19000-19499***********//
	if(uCarBrand >= 19000 && 19499 >= uCarBrand) return SUZUKI;	
	//名爵**********19500-19999***********//
	if(uCarBrand >= 19500 && 19999 >= uCarBrand) return MG;	
	//奇瑞 **********20000-20499***********//
	if(uCarBrand >= 20000 && 20499 >= uCarBrand) return CHERY;	
	//帝豪**********20500-20999***********// 
	if(uCarBrand >= 20500 && 20999 >= uCarBrand) return EMGRANO;	
	//哈飞**********21000-21499***********//
	if(uCarBrand >= 21000 && 21499 >= uCarBrand) return HAFEI;	
	//东南**********21500-21999***********//
	if(uCarBrand >= 21500 && 21999 >= uCarBrand) return SOUEAST;	
	//宝骏**********22000-22499***********//        
	if(uCarBrand >= 22000 && 22499 >= uCarBrand) return BAOJUN;	
	//奔腾**********22500-22999***********//
	if(uCarBrand >= 22500 && 22999 >= uCarBrand) return BESTURN;	
	//昌河**********23000-23499***********//
	if(uCarBrand >= 23000 && 23499 >= uCarBrand) return CHANGHE;	
	//大发**********23500-23999***********//
	if(uCarBrand >= 23500 && 23999 >= uCarBrand) return DAIHATSU;	
	//东风**********24000-24499***********//
	if(uCarBrand >= 24000 && 24499 >= uCarBrand) return DONGFENG;	
	//福迪**********24500-24999***********//
	if(uCarBrand >= 24500 && 24999 >= uCarBrand) return FUDI;

	//传祺**********25500-25999***********
	if(uCarBrand >= 25500 && 25999 >= uCarBrand) return CHUANQI;
	//海马**********26000-26499***********//
	if(uCarBrand >= 26000 && 26499 >= uCarBrand) return HAIMA;	      
	//中华**********26500-26999***********//
	if(uCarBrand >= 26500 && 26999 >= uCarBrand) return FLYWITHOUT;	
	//汇众**********27000-27499***********//
	if(uCarBrand >= 27000 && 27499 >= uCarBrand) return HUIZHONG;	
	//吉利**********27500-27999***********//
	if(uCarBrand >= 27500 && 27999 >= uCarBrand) return GEELY;
	//江淮**********28000-28499***********//
	if(uCarBrand >= 28000 && 28499 >= uCarBrand) return JAC;	
	//江铃**********28500-28999***********//
	if(uCarBrand >= 28500 && 28999 >= uCarBrand) return JMC;	
	//金杯**********29000-29499***********//
	if(uCarBrand >= 29000 && 29499 >= uCarBrand) return JINBEI;	         
	//开瑞**********29500-29999***********//
	if(uCarBrand >= 29500 && 29999 >= uCarBrand) return KARRY;	
	//理念**********30000-30499***********//
	if(uCarBrand >= 30000 && 30499 >= uCarBrand) return LINIAN;	
	//力帆**********30500-30999***********//
	if(uCarBrand >= 30500 && 30999 >= uCarBrand) return LIFAN;		
	//南京**********31000-31499***********//无
	if(uCarBrand >= 31000 && 31499 >= uCarBrand) return NANJ;	
	//启辰**********31500-31999***********//
	if(uCarBrand >= 31500 && 31999 >= uCarBrand) return QICHEN;	
	//威麟**********32000-32499***********//
	if(uCarBrand >= 32000 && 32499 >= uCarBrand) return RELY;	
	//五十铃**********32500-32999***********//
	if(uCarBrand >= 32500 && 32999 >= uCarBrand) return ISUZU;	
	//夏利**********33000-33499***********//
	if(uCarBrand >= 33000 && 33499 >= uCarBrand) return XIALI;	
	//羊城**********33500-33999***********//
	if(uCarBrand >= 33500 && 33999 >= uCarBrand) return YCACO;	
	//一汽**********34000-34499***********//
	if(uCarBrand >= 34000 && 34499 >= uCarBrand) return YIQI;	
	//依维柯**********34500-34999***********//
	if(uCarBrand >= 34500 && 34999 >= uCarBrand) return IVECO;	
	//跃进**********35000-35499***********//
	if(uCarBrand >= 35000 && 35499 >= uCarBrand) return YUEJIN;	
	//长城**********35500-35999***********//
	if(uCarBrand >= 35500 && 35999 >= uCarBrand) return GREATWALL;	
	//五菱**********36000-36499***********//
	if(uCarBrand >= 36000 && 36499 >= uCarBrand) return WULING;	
	//中兴**********36500-36999***********//
	if(uCarBrand >= 36500 && 36999 >= uCarBrand) return ZX;	
	//讴歌**********37000-37499***********//
	if(uCarBrand >= 37000 && 37499 >= uCarBrand) return OUGE;	
	//北汽**********37500-37999***********//
	if(uCarBrand >= 37500 && 37999 >= uCarBrand) return BEIQI;	
	//大宇**********38000-38499***********//
	if(uCarBrand >= 38000 && 38499 >= uCarBrand) return DAEWOO;
	//吉奥**********38500-38999***********//
	if(uCarBrand >= 38500 && 38999 >= uCarBrand) return GONOW;	
	//华泰**********39000-39499***********//
	if(uCarBrand >= 39000 && 39499 >= uCarBrand) return HAWTAIAUTOMOBILE;	
	//陆风**********39500-39999***********//
	if(uCarBrand >= 39500 && 39999 >= uCarBrand) return LANDWIND;

	//瑞麒**********40000-40499***********//
	if(uCarBrand >= 40000 && 40499 >= uCarBrand) return RIICH;
	//曙光**********40500-40999***********//
	if(uCarBrand >= 40500 && 40999 >= uCarBrand) return SG;
	//双环**********41000-41499***********// 
	if(uCarBrand >= 41000 && 41499 >= uCarBrand) return SHUANGHUANAUTO;
	//双龙**********41500-41999***********//       
	if(uCarBrand >= 41500 && 41999 >= uCarBrand) return SSANGYONG;
	//华普**********42000-42499***********//
	if(uCarBrand >= 42000 && 42499 >= uCarBrand) return SMA;
	//众泰**********42500-42999***********//         
	if(uCarBrand >= 42500 && 42999 >= uCarBrand) return ZOTYEAUTO;
	//长安**********43000-43499***********//
	if(uCarBrand >= 43000 && 43499 >= uCarBrand) return CHANA;
	//道奇**********43500-43999***********//
	if(uCarBrand >= 43500 && 43999 >= uCarBrand) return DODGE;   
	//哈弗**********44000-44499***********//
	if(uCarBrand >= 44000 && 44499 >= uCarBrand) return HAVAL;
	//纳智捷**********44500-44999***********//
	if(uCarBrand >= 44500 && 44999 >= uCarBrand) return LUXGEN;
	//精灵**********45000-45499***********//无
	if(uCarBrand >= 45000 && 45499 >= uCarBrand) return SMAR;
	//福田**********45500-45999***********//
	if(uCarBrand >= 45500 && 45999 >= uCarBrand) return FOTON;  
	//中顺**********46000-46499***********//
	if(uCarBrand >= 46000 && 46499 >= uCarBrand) return POLARSUN;
	//劳斯莱斯**********46500-46999***********//
	if(uCarBrand >= 46500 && 46999 >= uCarBrand) return ROLLSROYCE;
	//长丰**********47000-47499***********//
	if(uCarBrand >= 47000 && 47499 >= uCarBrand) return CHANGFENAMOTOR;
	//广汽(传祺)**********47500-47999***********//
	if(uCarBrand >= 47500 && 47999 >= uCarBrand) return GUANGQI;
	//金旅**********48000-48499***********//
	if(uCarBrand >= 48000 && 48499 >= uCarBrand) return GOLDENDRAGON;
	//双龙**********48500-48999***********//
	if(uCarBrand >= 48500 && 48999 >= uCarBrand) return SHUANGLONG;
	//林肯**********49000-49499***********//
	if(uCarBrand >= 49000 && 49499 >= uCarBrand) return LINCOLN;
	//五征**********49500-49999***********//
	if(uCarBrand >= 49500 && 49999 >= uCarBrand) return WAW;
	//解放**********50000-50499***********//
	if(uCarBrand >= 50000 && 50499 >= uCarBrand) return FAW;
	//春兰**********50500-50999***********//
	if(uCarBrand >= 50500 && 50999 >= uCarBrand) return CHUNLAN;
	//日野**********51000-51499***********//
	if(uCarBrand >= 51000 && 51499 >= uCarBrand) return HINO;
	//凯马**********51500-51999***********//无
	if(uCarBrand >= 51500 && 51999 >= uCarBrand) return KAMA;	

	//黄牌车
	//中国重汽*******52000-52499**********//
	if(uCarBrand >= 52000 && 52499 >= uCarBrand) return CNHTC;	
	//东风柳州********52500-52999*********//
	if(uCarBrand >= 52500 && 52999 >= uCarBrand) return DFLZ;	
	//北奔重卡********53000-53499*********//
	if(uCarBrand >= 53000 && 53499 >= uCarBrand) return BEIBENTRUCK;	
	//陕汽重卡********53500-53999*********//
	if(uCarBrand >= 53500 && 53999 >= uCarBrand) return SHACMAN;	
	//华菱********54000-54499*********//
	if(uCarBrand >= 54000 && 54499 >= uCarBrand) return CAMC;	
	//跃进********54500-54999*********//
	if(uCarBrand >= 54500 && 54999 >= uCarBrand) return YUEJIN;	
	//红岩********55000-55499*********//
	if(uCarBrand >= 55000 && 55499 >= uCarBrand) return HONGYAN;	
	//王牌********55500-55999*********//
	if(uCarBrand >= 55500 && 55999 >= uCarBrand) return CDW;	
	//曼********56000-56499*********//
	if(uCarBrand >= 56000 && 56499 >= uCarBrand) return MAN;	
	//日产柴********56500-56999*********//无
	if(uCarBrand >= 56500 && 56999 >= uCarBrand) return UD;	
	//徐工********57000-57499*********//
	if(uCarBrand >= 57000 && 57499 >= uCarBrand) return XCMG;	
	//华德********57500-57999*********//
	if(uCarBrand >= 57500 && 57999 >= uCarBrand) return HUADE;	
	//海格********58000-58499*********//
	if(uCarBrand >= 58000 && 58499 >= uCarBrand) return HIGER;	
	//宇通********58500-58999*********//
	if(uCarBrand >= 58500 && 58999 >= uCarBrand) return YUTONG;	
	//青年********59000-59499*********//
	if(uCarBrand >= 59000 && 59499 >= uCarBrand) return YOUNGMAN;	
	//江淮汽车********59500-59999*********//
	if(uCarBrand >= 59500 && 59999 >= uCarBrand) return JAC;	
	//上海申通********60000-60499*********//无
	if(uCarBrand >= 60000 && 60499 >= uCarBrand) return SULO;	
	//中通********60500-60999*********//
	if(uCarBrand >= 60500 && 60999 >= uCarBrand) return ZHONGTONG;	
	//亚星客车********61000-61499*********//无
	if(uCarBrand >= 61000 && 61499 >= uCarBrand) return YAXI;	
	//金龙客车********61500-61999*********//
	if(uCarBrand >= 61500 && 61999 >= uCarBrand) return KINGLONG;	
	//三一********62000-62499*********//   无                     //修改：将骏马改成三一
	if(uCarBrand >= 62000 && 62499 >= uCarBrand) return SANY;	
	//南骏********62500-62999*********//无
	if(uCarBrand >= 62500 && 62999 >= uCarBrand) return NJUN;	
	//十通********63000-63499*********//
	if(uCarBrand >= 63000 && 63499 >= uCarBrand) return SHITONG;	
	//斯堪尼亚********63500-63999*********//
	if(uCarBrand >= 63500 && 63999 >= uCarBrand) return SCANIA;	
	//安凯客车********64000-64499*********// 无                  //修改
	if(uCarBrand >= 64000 && 64499 >= uCarBrand) return AKAI;	
	//牡丹花都********64500-64999*********//无                   //修改
	if(uCarBrand >= 64500 && 64999 >= uCarBrand) return MDHD;	
	//蜀都公交********65000-65499*********//无                   //修改
	if(uCarBrand >= 65000 && 65499 >= uCarBrand) return SHUD;	
	//未知大客********65500-65999*********//无                    //修改
	if(uCarBrand >= 65500 && 65999 >= uCarBrand) return nBrandOther;	
	//春兰********66000-66499*********// 
	if(uCarBrand >= 66000 && 66499 >= uCarBrand) return CHUNLAN;	
	//日野********66500-66999*********// 
	if(uCarBrand >= 66500 && 66999 >= uCarBrand) return HINO;	
	//飞驰********67000-67499*********// 
	if(uCarBrand >= 67000 && 67499 >= uCarBrand) return FEICHI;	
	//联合********67500-67999*********// 
	if(uCarBrand >= 67500 && 67999 >= uCarBrand) return CC;	
	//神野********68000-68499*********//
	if(uCarBrand >= 68000 && 68499 >= uCarBrand) return SHENYE;	
	//唐骏*******68500-68999*********//无
	if(uCarBrand >= 68500 && 68999 >= uCarBrand) return TKNG;	
	//轻骑微卡*******69000-69499*********//无
	if(uCarBrand >= 69000 && 69499 >= uCarBrand) return QNGQ;	
	//黄海客车*******69500-69999*********//无
	if(uCarBrand >= 69500 && 69999 >= uCarBrand) return HUGH;	
	//瑞沃*******70000-70499*********//
	if(uCarBrand >= 70000 && 70499 >= uCarBrand) return ROWOR;	
	//川汽野马*****70500-70999*********//无
	if(uCarBrand >= 70500 && 70999 >= uCarBrand) return CHQY;	
	//新凯********71000-71499**********//无
	if(uCarBrand >= 71000 && 71499 >= uCarBrand) return XIKAI;	
	//永源********71500-71999**********//
	if(uCarBrand >= 71500 && 71999 >= uCarBrand) return UFO;	
	//时风********72000-72499**********//
	if(uCarBrand >= 72000 && 72499 >= uCarBrand) return SIFENG;
	//楚风********72500-72999**********//
	if(uCarBrand >= 72500 && 72999 >= uCarBrand) return CF;
	//三环********73000-73499**********//
	if(uCarBrand >= 73000 && 73499 >= uCarBrand) return THRC;
	//百路佳********73500-73999**********//
	if(uCarBrand >= 73500 && 73999 >= uCarBrand) return BLK;
	//北方尼奥普兰********74000-74500**********//
	if(uCarBrand >= 74000 && 74500 >= uCarBrand) return BFNO;

	return nBrandOther;
}
